{"what": "python developer", "where": "Bristol", "datetime": "2020-04-17 17:48:33.726183", "content": [{"title": "Python/ Go Developer £40-60k", "company": "Headforwards", "raw_location": "South West", "raw_salary": "\n£40,000 - £60,000 a year", "min_salary": 40000.0, "max_salary": 60000.0, "mid_salary": 50000.0, "detail_url": "http://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0DuHDjNWw39SJ5e6sYpMBsA1c0MQ32LDXTWEMHTY-Wt9ZQzCHqjxt7ZbJTKCx1V4ZVW3A1qpVUyL8QXEoJ4hRVCx1OkQ-efXv4ZkL56kDwdfFnW1kvWN3Z4r7xDPB0FOGn5FWCfWiAk-dPE92itq021Z0WIkC8FCL4t1sd5Y_4svKGy4BvrkeEnsG60q3-9NGVcVFdaGrJli7htyeqV7HHUTiyaepUsM1gUGgBbNIFsEpdV0FECdFUX98fxzUXQM0vv73oNhrxaELjEuzxoXfYPwszxSYLlyU24ZV13vwltDHkDNR11NGRdtQiRAMSxrkFiu4vYyStERm18grqTz1DWaAJflLQ8niwwkToklD1WeC7fMzxLp3l6xhfvvJbSNfUTqCMRZ8om_rN4hGvqAY0r4Lp5hqqMOkEjxa01mug5BZuC3nda9cGqP3JsMVg4iExTSkPJBMkMD39n3pdqxDMOZBHw7ICu_n0=&p=0&fvj=1&vjs=3", "description": "[<p><b>Are you a Developer who is keen to bleed the edges of your experience?</b></p>, <p>If so, we would love to hear from you! We are looking for an experienced developer in Python and/or Go to join one of our high performing development teams. If you have good commercial experience in a similar or related language you could also fit in well.</p>, <p><b>We are offering a salary of up to £60,000 depending on experience.</b></p>, <p><b>What will you be doing? </b></p>, <ul><li>You will be joining a fast-moving development team working on the backend of a cutting-edge web application for one of the largest telecoms companies in the world, building and deploying microservices at scale, on a Kubernetes platform, with multiple global regions.</li><li>You will be using and improving our in house continuous delivery pipelines to release new features and functionality to the client.</li></ul>, <p>We are delivering multiple releases every day and working with some pretty exciting technologies alongside fully employing the use of Agile methodologies across the whole business.</p>, <p>You may currently be a Team Lead, or an Architect in your current role and looking for a new challenge.</p>, <p><b>Why work for Headforwards?</b></p>, <ul><li>We are a software development company with just over 100 people from 18 different countries and we like to have fun at work!</li><li>We are agile with a very laid back feel, a relatively flat structure and small self-organising teams of 2-7 people. We work in teams dedicated to various clients and we work on global projects with cutting edge technologies, tools and techniques.</li><li>There\\'s no pressure to work extra hours to churn out more and more code.</li><li>Our culture and environment is dedicated to making people happy at work.</li><li>We live in beautiful Cornwall, our offices are 5 miles from the beach. We want to make sure our people have a good work life balance so that they can enjoy all that Cornwall has to offer : )</li><li>We have lots of social activities and monthly learning sessions, talks and cross company communities of practice for various languages, tools and frameworks.</li></ul>, <p>This is a place where you can make a difference, work in a small team start-up feel but benefit from the support of a larger community of developers and like-minded people.</p>, <p><b>Key Personal Traits</b></p>, <ul><li>You will have been a developer for at least five years</li></ul>, <ul><li>You will have used Python or Go</li><li>You are happy to work as both a Mentor or Leader within a team, and contribute to a wider project team</li><li>We enjoy spirited exchanges of ideas, pushing us towards technical excellence and we expect to hear your voice in these conversations.</li><li>You will be a natural problem solver and able to align business delivery priories against implementation choices.</li><li>You will have the desire and ability to continually learn in improve yourself, and your colleagues.</li></ul>, <p><b>Key Technical Skills</b></p>, <ul><li>Knowledge of relational and / or non-relational (NoSQL) databases (we use MongoDB, Postgres, Redis, InfluxDB)</li><li>Experience of message queues (we use Kafka)</li><li>Experience of container orchestration (we use Kubernetes, Docker)</li><li>An operational mindset with knowledge of high availability, monitoring and diagnostics</li><li>Understanding of the web application stack</li><li>A pragmatic and practical approach to solving business problems</li><li>Exposure to test driven development and integration testing</li><li>Experience working with development team tools (e.g. continuous integration systems (we use Jenkins) and version control systems (we use Git)</li></ul>, <p><b>The closing date for this role is 31st March 2020. We recruit on a rolling basis and fill our vacancies as soon as we find people who fit our culture and meet the skills requirements. This means that whilst we have a closing date on all of our roles, we may offer the role to someone before the end date, so we recommend that you apply as soon as possible.</b></p>, <p>Job Types: Full-time, Permanent</p>, <p>Salary: £40,000.00 to £60,000.00 /year</p>, <p>Experience:</p>, <ul><li>Python: 4 years (Preferred)</li></ul>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 50.2272249, "longitude": -5.2716259}}, {"title": "Full Stack Applications Developer", "company": "Graphcore", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0B2LP6KtwgLMWcIJbzQK4y118hUYa2NHT0ELzb4aR6nDrO9_32R0LtazQt5Ev9ntbMF67x-uIqCFBIaSgF3Jr_RlBZttv17jHoO36gbiKCViwKMlso9PTYyZrCltqyWFf2M33tYYDFxulDCuG005fjA9bOKTyD0CWzIrw-icr-yXBwW7ivnuNynvQKnyUspYPFbFeleYmRPhjldGEMwjcjmQuhs8QRL-c_xQRSBKiL7IwIRw4sSv9FImJ1uuZRRVI3faUvVL_ALzJ9X0wxZSOHN3Yvmqiut2bno9oAhTukH1kmJUY3xykjTGEdWKseK-6IUPf46cQFg_fyUmUKrsziVhA9WTE-r0ZLsNyrmFG2uLhe_mSO7XnU73RomLFWtAwClVwDgEa-WkD4MweXoo17TeUUoWeWZBP4=&p=1&fvj=0&vjs=3", "description": "[<div><b>Full Stack Applications Developer, Full-Time, Bristol</b>\n<br/>\n<br/>\nGraphcore has created a completely new processor, the Intelligence Processing Unit (IPU), specifically designed for artificial intelligence. The IPU\\'s unique architecture means developers can run current machine learning models orders of magnitude faster. More importantly, it lets AI researchers undertake entirely new types of work, not possible using current technologies, to drive the next great breakthroughs in general machine intelligence.\n<br/>\n<br/>\nWe believe our IPU technology will become the worldwide standard for artificial intelligence compute. The performance of Graphcore\\'s IPU is going to be transformative across all industries and sectors whether you are a medical researcher, roboticist or building autonomous cars.\n<br/>\n<br/>\nOur team is at the forefront of the artificial intelligence revolution, enabling innovators from all industries and sectors to expand human potential with technology. What we do, really makes a difference.\n<br/>\n<br/>\nThe Full-Stack Application Developer will contribute by supporting the planning and release procedures, by designing, scoping and building a number of critical tools and applications. You will be involved in creating a visual tool for release and features planning, release automation, UI to a number of systems to simplify, expand and improve the SDLC of the whole SW engineering and Product team.\n<br/>\n<br/>\nIdeally, you are an expert in full-stack applications space and will be instrumental in the improvements and capabilities of the day-by-day work in Graphcore.\n<br/>\n<br/>\nYou will work with the Release Manager, collect requirements from the Product team. You will be closely involved with the DevOps team and the whole SW engineering while shaping the future SDLC. Everything you will build will be used by hundreds of developers across the globe, to deliver the latest AI technology.<br/>\n<h2 class=\\\"jobSectionHeader\\\"><b>\nResponsibilities</b></h2>\n<ul><li>Develop applications and tools in full-stack, cross-platform, environment.</li>\n<li>Ability to build an application from scratch: from design to deployment</li>\n<li>Ability to design efficient and effective UIs</li>\n<li>Working with an Agile scrum methodology, breaking work down in epics and stories</li>\n</ul><h2 class=\\\"jobSectionHeader\\\"><b>Key Skills</b></h2>\n<ul><li>Passion driven, goal-oriented and \\\"Can do\\\" attitude</li>\n<li>Experience of full-stack cross-platform environment: Linux/MacOS/Windows</li>\n<li>Intimate familiarity of version control, specifically git</li>\n<li>Ability to build complex applications in Python, PHP, bash</li>\n<li>Knowledge of SQL and relational databases like MySQL or SQLite</li>\n<li>Comfortable in understanding opensource tools and build extensions for them</li>\n<li>Ability to interface with opensource communities as needed</li>\n</ul>Please note, we are only considering candidates who have an established right to work in the UK for roles based in Bristol, UK\n<br/>\n<br/>\nWe welcome people of different backgrounds and experiences and are committed to building an inclusive work environment that makes Graphcore a great home for everyone. We are an equal opportunity employer and want to build a work environment where everyone is happy, productive and respectful, so they can do their best work. If you have a disability or additional need that requires accommodation, just let us know.</div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4552872, "longitude": -2.5923872}}, {"title": "Software Test Automation Lead", "company": "Graphcore", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0B2LP6KtwgLMWcIJbzQK4y118hUYa2NHT0ELzb4aR6nDrO9_32R0LtazQt5Ev9ntbM-U9_IOn7b_TGoM7EAWKBLeSVGnWrTEFUfjERxJoP4Hh6R4aVlgJovRmKkoWo9HCdK0t4bX87yeS2Zao7j9AHEJRWtF6VDq4c8sv3NMjUL7O02nX41mgyBNsUKtbApP0gFX7EtuTb-5X_NwjIhYJ93-ryQX4dbthLF0g8YFIYAwiRueNIo74Qmqm_fkK_YPEqhRTJiPTzAYa079J6Omgj1p50AqfrlONziLNL9-pWMDHgO5NShOznkKMzISia9IKaY-R4Eml9AYm11Rt7dQD4TX7oVb2T4bc2k9ETjDjXZYK53HrTQ1gGgvAmWXOrt_tp9rJw3yN-dB89YuzPv0TpEyyMBpKsVWZo=&p=2&fvj=0&vjs=3", "description": "[<div>Founded just over three years ago, Graphcore\\'s growth and impact has been little short of staggering. We believe we\\'re in a unique position as a new wave of machine learning technology begins to emerge. We see a world where technology enhances human potential and takes us into a new era of intelligence and progress that everyone can benefit from.\n<br/>\n<br/>\nWhat we can achieve over the next few years will re-shape businesses around the world.\n<br/>\n<br/>\nGraphcore has created a completely newprocessor, the Intelligence Processing Unit (IPU), specifically designed for artificial intelligence. The IPU\\'s unique architecture means developers can run current machine learning models orders of magnitude faster. More importantly, it lets AI researchers undertake entirely new types of work, not possible using current technologies, to drive the next great breakthroughs in general machine intelligence.\n<br/>\n<br/>\nWe believe our IPU technology will become the worldwide standard for artificial intelligence compute. The performance of Graphcore\\'s IPU is going to be transformative across all industries and sectors whether you are a medical researcher, roboticist or building autonomous cars.\n<br/>\n<br/>\nOur team is at the forefront of the artificial intelligence revolution, enabling innovators from all industries and sectors to expand human potential with technology. What we do, really makes a difference.\n<br/>\n<br/>\n<b>Job Description:</b>\n<br/>\n<br/>\nWe are looking for technical lead who cares deeply about the software quality and is willing to champion validation within the software organisation. Take ownership of the software quality and work closely with engineering teams to deliver outstanding products. Build and lead a talented team of software developers engaged in the construction of automated validation and data gathering tools.\n<br/>\n<br/>\nThe software integration test team is not a standard test team; it consists of talented software developers who are testing a complex stack of parallel processing tools, APIs and machine learning frameworks and models.\n<br/>\n<br/>\n<b>Responsibilities:</b>\n<br/>\n<br/>\n<ul><li>Ownership of the software quality and validation process\n</li></ul><br/>\n<ul><li>Negotiation with internal stakeholders to create a testing schedule that meets requirements and deadlines\n</li></ul><br/>\n<ul><li>Recruitment and mentoring of a team of software engineers specialising in validation and verification across Bristol, Cambridge and London\n</li></ul><br/>\n<b>Key Skills</b>\n<br/>\n<br/>\n<ul><li>A proven track record of leadership\n</li></ul><br/>\n<ul><li>Able to manage multiple changing priorities within a fast-paced environment\n</li></ul><br/>\n<ul><li>Extensive knowledge of Python and testing methodologies\n</li></ul><br/>\n<ul><li>Experience in test automation and CI/CD\n</li></ul><br/>\n<ul><li>Good experience of working with agile methods of development\n</li></ul><br/>\n<ul><li>Experience with Linux or Unix systems\n</li></ul><br/>\n<ul><li>Hold a relevant engineering degree at master\\'s or PhD level\n</li></ul><br/>\n<b>Desirable Skills:</b>\n<br/>\n<br/>\n<ul><li>Some exposure to artificial neural network\n</li></ul><br/>\n<ul><li>Some experience with C++ development\n</li></ul><br/>\n<ul><li>A good understanding of parallel processing\n</li></ul><br/>\n<ul><li>Experience with test data storage and DB management\n</li></ul><br/>\n<ul><li>Experience with cloud computation platform\n</li></ul><br/>\n<b>Benefits</b>\n<br/>\nIn addition to a competitive salary, we also offer a generous pension scheme and to support your well-being we provide health insurance, life cover and an employee assistance programme.\n<br/>\n<br/>\nOur centrally located Bristol office provides a well-stocked kitchen with healthy food, drinks and snacks and our very own barista! We have an active social scene too - from cycling, yoga, running and football right through to a board game group.\n<br/>\n<br/>\nWe welcome people of different backgrounds and experiences and are committed to building an inclusive work environment that makes Graphcore a great home for everyone. We are an equal opportunity employer and want to build a work environment where everyone is happy, productive and respectful. If you have a disability or additional need that requires accommodation, just let us know.\n<br/>\n<br/>\nPlease note, we are only considering candidates who have an established right to work in the UK for roles based in Bristol, UK</div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4552872, "longitude": -2.5923872}}, {"title": "Junior Python Developer - Trading", "company": "Client Server", "raw_location": "Bristol", "raw_salary": "\n£50,000 - £75,000 a year", "min_salary": 50000.0, "max_salary": 75000.0, "mid_salary": 62500.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=1998d35c0a752edc&fccid=892c145157842ceb&vjs=3", "description": "[<p></p>, <div><div><div>Junior Python Developer / Software Engineer (Trading C++ Linux). One of the most successful proprietary trading forms in the world is seeking a bright, ambitious Junior Python Developer to join their highly accomplished team and work on a strong pipeline of projects.\n<br/>\n<br/>\nAs a Junior Python Developer you\\'ll work on highly complex, deeply technical systems with cross-functional teams who are committed to delivering high quality software releases, business-wide exposure with the chance to benefit from their culture of curiosity and continual learning.\n<br/>\n<br/>\nThe organisation is behind one of the most powerful computing grids in the world, and has asserted its position on the global stage by combining cutting-edge technology and granular data to solve the most complex of technical problems.\n<br/>\n<br/>\nAs a Junior Python Developer, you\\'ll join the rapidly expanding Core Development sector of the business, in a highly collaborative team that designs, codes, tests and maintains the high performance distributed systems that powers their trading operation. You\\'ll work directly with a close-knit team to deploy critical features to the trading platform with the opportunity to benefit from accomplished senior colleagues.\n<br/>\n<br/>\n*Please note: this company is able to conduct an entirely remote interview process during the current circumstances*<br/>\n<br/>\nRequirements:<br/>\n<ul><li>You\\'re degree educated (2.1 or above, BSc / MSc / PhD)\n</li><li>You have strong Python coding ability\n</li><li>You have a thorough understanding of Computer Science fundamentals like OOP, Data Structures, threading models and networking\n</li><li>You\\'re naturally analytical and approach complex technical problems in a logical, thoughtful manner\n</li><li>You\\'re a positive team player who enjoys working collaboratively\n</li><li>Desirable: C++ skills\n</li></ul><br/>\nAs a Junior Python Developer you\\'ll earn a highly competitive salary (to £75k) plus bonus and a comprehensive benefits package.\n<br/>\n<br/>\nApply now or call for a confidential discussion about this Junior Python Developer / Software Engineer (Trading C++ Linux) opportunity.</div></div></div>, <p></p>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.454513, "longitude": -2.58791}}, {"title": "Entry Level GIS Professional", "company": "Geollect Limited", "raw_location": "Bristol", "raw_salary": "\n£18,000 - £22,500 a year", "min_salary": 18000.0, "max_salary": 22500.0, "mid_salary": 20250.0, "detail_url": "http://www.indeed.co.uk/company/Geollect/jobs/Entry-Level-GIS-Professional-7aa2c691079199be?fccid=9b81b6ebc61889fd&vjs=3", "description": "[<p><b>Geospatial Analyst - Entry Level</b><br/>Geollect is an agile geospatial intelligence and analysis company, providing dynamic insights for decision support to a network of global clients in the defence, maritime insurance and cruise industries. We are looking for an ambitious candidate who has a passion for GIS, loves a good challenge, and wants to be part of a rapidly growing company.</p>, <p><b>Job Description</b></p>, <p>The successful candidate will form an integral part of the geospatial analytical team, working on multiple projects across a diverse range of sectors. We are looking for someone who can embrace each challenge with enthusiasm as a team player or independently with a strong will to succeed. You will be required to analyse and interpret multiple data layers using innovative techniques to assist in the automation and quality control of Geollect\\'s suite of products. You will leverage all available datasets, including, but not limited to, satellite imagery, infrastructure data, news and social media, maritime vessel locations, third-party APIs and crowd-sourced data. The analytical team are looking for relationships in the data, patterns of life and anomalies to provide powerful insights within a comprehensive operating picture to help our clients identify operational risk and opportunities. You will also work closely with the data scientists, data engineers and web developers.</p>, <p>This opportunity is perfect for a GIS (or related subject) graduate, who wants to develop a keen understanding of how geospatial technology is applied in a commercial setting. For the right employee, this role provides the opportunity to grow into leadership positions as the company scales.</p>, <p>You are encouraged to apply even if you don\\'t meet all of the requirements below. Geollect are building a team that fit together well, and are open to a variety of skills and levels of experience. Candidates are welcome to get in touch for further information prior to application.</p>, <p><b>Required Skill Sets</b></p>, <p><i>GIS analysis qualifications</i></p>, <ul><li>ArcGIS suite of products experience</li><li>ArcGIS Online experience</li><li>Web Mapping Service (WMS) knowledge</li><li>Web Feature Service (WFS) knowledge</li><li>JSON knowledge</li><li>SQL knowledge</li><li>Data entry, conversion and maintenance</li><li>Metadata creation and editing</li><li>Portability of skills on multi-platforms</li><li>Basic understanding of programming</li></ul>, <p><i>Other qualifications</i></p>, <ul><li>Ability to work effectively from a remote location</li><li>Ability to quickly learn sector-specific information to better exploit available datasets</li><li>Apply skill sets and expertise in multiple domains</li><li>Creative thinking with attention to detail</li><li>Innovative and proactive approach to problem solving</li><li>Evidence of continued personal and professional development</li></ul>, <p><i>Desired Skillsets</i></p>, <ul><li>Programming language (Python, .Net)</li><li>Imagery exploitation training or equivalent experience</li><li>GIS workflows - model building</li><li>GIS architecture (web and desktop)</li><li>Knowledge of SAR exploitation</li><li>Ability to translate user needs to solutions</li><li>Ability to present solutions in a simplistic visual manner</li><li>Clear, concise communication skills</li><li>Customer support skills</li></ul>, <p>Benefits:</p>, <ul><li>On-site parking</li><li>Flexible working hours</li><li>Sick pay</li><li>Bonus scheme</li><li>Casual dress</li><li>Company events &amp; social hours</li></ul>, <p>Job Types: Full-time, Contract, Permanent</p>, <p>Salary: £18,000.00 to £22,500.00 /year</p>, <p>Experience:</p>, <ul><li>ArcGIS: 1 year (Preferred)</li><li>GIS: 1 year (Preferred)</li></ul>, <p>Education:</p>, <ul><li>Bachelor\\'s (Preferred)</li></ul>, <p>Location:</p>, <ul><li>Bristol, Bristol (Required)</li></ul>, <p>Language:</p>, <ul><li>English (Required)</li></ul>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.454513, "longitude": -2.58791}}, {"title": "Deals Technology - Software Developer", "company": "PwC", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=56bc499dc653280c&fccid=5e964c4afc56b180&vjs=3", "description": "[<div><p>A career in our National Operations practice, within Operations, will provide the opportunity to support our engagement teams and clients operationally by providing advice on accounting, financial reporting, and strategic business issues. In joining, you’ll help ensure a complete and relevant exchange of information among our consultants and in turn with engagement teams and clients, provide experts advice on a variety of specific topics, support engagement teams in resolving complex issues, and supporting clients and their subsidiaries in evaluating the potential impact of accounting and reporting standard setting initiatives. You’ll develop strong relationships with our engagement teams and enhance our ability to meet greater investor expectations with the challenges of an increasingly complex business environment.<br/>\n<br/>\nOur team collaborates across the PwC business lines of services to review and develop current or future operational strategies.</p><h5 class=\\\"jobSectionHeader\\\"><b>\nAbout the team</b></h5><p>\nOur Deals business is an exciting, fast-paced and an ever-growing business that focuses on deals and crisis situations for our clients. Collectively, we deal with the types of situations you hear about regularly in the news and we provide support, insight and analysis to the management, shareholders and financiers of business.</p><p>\nOur Deals practice supports clients through mergers, acquisitions and responses to financial distress. The Deals Tech team is a centre of excellence for embedding and enabling technology across our Deals practice.</p><p>\nWe help our Deals business go to market with compelling data analysis and automation technology. We are currently looking for a bright, enthusiastic, and hungry individual to help expand the reach of the team.</p><p>\nYou can expect a challenging and rewarding career that will provide you with opportunities to work with our client engagement teams along with other parts of the business. This is a fantastic opportunity to learn new technologies, further develop your skills and advance your career with the market leading employer.</p><p></p><h5 class=\\\"jobSectionHeader\\\"><b>\nAbout the role</b></h5><p>\nYou will be supporting the development and enhancement of in-house developed business software applications and business databases used across a broad range of Deals engagements. Projects will be mostly green field in nature, so you will have the opportunity to develop new solutions from the ground up and have significant input on technical direction. Your responsibilities will include but may not be limited to:</p><ul><li><p>\nCreating and upgrading bespoke applications using the .NET framework to integrate and enhance the teams business systems;</p></li><li><p>\nTesting applications and implementing fixes/code refactoring as necessary;</p></li><li><p>\nHelp to support the team’s SQL database systems;</p></li><li><p>\nAssist in the evaluation, selection, installation, configuration, maintenance, upgrade, and support of software applications within the firm;</p></li><li><p>\nProducing technical documentation; and</p></li><li><p>\nTaking part in code reviews and providing input on architectural decisions.</p></li></ul><p></p><h5 class=\\\"jobSectionHeader\\\"><b>\nRequirements</b></h5><p>\nIf you are naturally inquisitive, have an analytical mind and enjoy solving problems in a rigorous and logical manner, for a variety of different businesses then this is the role for you. Alongside other members of the team you will engage with senior members of our business and clients, helping to solve their business problems and generate value.</p><h5 class=\\\"jobSectionHeader\\\"><b>\nYou will need significant experience demonstrating a number of the following skills:</b></h5><ul><li><p>\nExceptional analytical and technical aptitude, and enjoy problem solving;</p></li><li><p>\nHave an entrepreneurial mind set and self-starter mentality, and be comfortable with a degree of ambiguity to come up with creative solutions to complex problems and develop these ideas into structured deliverable projects;</p></li><li><p>\nAn ability to work effectively on tasks, both individually and collaboratively;</p></li><li><p>\nThe ability to manage time, prioritise tasks, self-review your work and produce deliverables of a high quality under tight client deadlines in time pressured environments;</p></li><li><p>\nA strong desire to acquire and share technical knowledge with others;</p></li><li><p>\nPassion for technology and new tools and applying and developing yourself to new areas (e.g. quickly getting up to speed with tools, analytical approaches and business challenges);</p></li><li><p>\nBuild collaborative working relationships at all levels, establishing credibility both internally and externally.</p></li></ul><h5 class=\\\"jobSectionHeader\\\"><b>\nTechnical skills</b></h5><ul><li><p>\nHave experience of developing applications using the .NET framework (preferably version 4.6 and onwards) with C# and Visual Studio;</p></li><li><p>\nExperience developing ASP.NET MVC Applications;</p></li><li><p>\nExperience using version control systems, preferably Git;</p></li><li><p>\nAn understanding of the Agile development process;</p></li><li><p>\nAn understanding of cloud services such as Azure, Google Cloud and AWS;</p></li><li><p>\nGood experience of using SQL Server (writing queries, designing tables, use of stored procedures, etc);</p></li><li><p>\nExperience using a wide range of APIs; and</p></li><li><p>\nProven experience in all aspects of the Software Development Lifecycle.</p></li></ul><h5 class=\\\"jobSectionHeader\\\"><b>\nThe following skills are also desirable</b></h5><ul><li><p>\nExperience of Entity Framework</p></li><li><p>\nExperience of ADO.NET</p></li><li><p>\nExperience writing and reviewing technical documentation;</p></li><li><p>\nJavascript (jQuery, React/Angular);</p></li><li><p>\nPresentation frameworks such as Bootstrap</p></li><li><p>\nOther coding languages such as Python/VB.NET;</p></li><li><p>\nExperience working in a corporate deal environment; and</p></li><li><p>\nAn understanding of basic accounting principles.</p></li></ul><p></p><h5 class=\\\"jobSectionHeader\\\"><b>\nLocation</b></h5><p>\nThis position is based in our Bristol office, located just near Temple Meads train station.</p><br/>\n<p><b>\nDeals</b></p>\n<p>\nOur Deals business is an exciting, fast-paced and an ever-growing business that focuses on deals and crisis situations for our clients. Collectively, we deal with the types of situations you hear about regularly in the news and we provide support, insight and analysis to the management, shareholders and financiers of business.\n</p><p><b>Not the role for you?</b></p>\n<p>\nDid you know PwC offer flexible contract arrangements as well as contingent work ( ie temporary or day rate contracting)?</p>\n<p><b>\nThe skills we look for in future employees</b></p>\n<p>\nAll our people need to demonstrate the skills and behaviours that support us in delivering our business strategy. This is important to the work we do for our business, and our clients. These skills and behaviours make up our global leadership framework, ‘The PwC Professional’ and are made up of five core attributes; whole leadership, technical capabilities, business acumen, global acumen and relationships.\n</p><p>Learn more here www.pwc.com/uk/careers/experienced/apply</p>\n<p><b>\nDiversity</b></p>\n<p>\nWe work in a changing world which offers great opportunities for people with diverse backgrounds and experiences. We seek to attract and employ the best people from the widest talent pool, as well as those who reflect the diverse nature of our society. And we aim to encourage a culture where people can be themselves and be valued for their strengths. Creating value through diversity is what makes us strong as a business and as an organisation with an increasingly agile workforce, we\\'re open to flexible working arrangements where appropriate.</p></div>, <p></p>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.45171, "longitude": -2.579683}}, {"title": "Backend Developer (Python)", "company": "Chronomics", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=128236f9aae020a8&fccid=be1fa4c3e40ce18e&vjs=3", "description": "[\\'Our mission\\n\\', <br/>, <br/>, \\'\\nWant to make a difference in this world and work on something meaningful? At Chronomics we enable people to quantify how their environment and lifestyle is affecting their health to live healthier and happier lives… all from their DNA. We will love you because…\\n\\', <br/>, \\'You’re an expert coder in at least 1 language (Python/PHP/Node.js).\\n\\', <br/>, \\'You have a product mindset and understand creating value, not features.\\n\\', <br/>, \\\"And most of all you\\'r enthusiastic and get shit done. Working in a product focused cross functional team alongside other developers, designers, data scientists and bioinformaticians you will take ownership of projects and get to work on a cutting edge microservice architecture using serverless working with HUGE data (each DNA sample is 100GB…) to build a ground breaking epigenetics platform which is the first of its kind in the world. We built to ship, we ship fast and then we learn and iterate. With a can-do attitude and a strong product mentality you are happy to jump in and get your hands dirty which could be anything from learning GO, building a Lambda microservice or optimizing an AWS pipeline. You will get the chance to work with numerous different technologies, have a say in how we drive the company forward and learn a ton of science along the way. Essential skills:\\n\\\", <br/>, <br/>, \\'\\nCan write secure, scalable, readable code in at least one or two languages\\n\\', <br/>, \\'Experience designing and scaling databases\\n\\', <br/>, \\'Designing, building, consuming AND documenting REST APIs\\n\\', <br/>, \\'Cloud platforms (AWS)\\n\\', <br/>, \\'Happy on the command line\\n\\', <br/>, \\'Agile development\\n\\', <br/>, \\'Test automation\\n\\', <br/>, \\'Familiarity with mobile and web development\\n\\', <br/>, <ul>\n<li>Work as part of a focused team, but at the same time self-driven and able to work independently Nice to have:</li>\n</ul>, \\'\\nSome dev ops (CI/CD/Docker)\\n\\', <br/>, \\'Infrastructure as code (Terraform/CloudFormation)\\n\\', <br/>, \\'Experience with other languages such as Python/JavaScript (React/Node) etc\\n\\', <br/>, \\'Serverless experience\\n\\', <br/>, \\'Experience with big data\\n\\', <br/>, \\'Experience working on high scalability websites\\n\\', <br/>, \\'Have worked with genetics data\\n\\', <br/>, \\'Experience with serverless and microservices architecture\\n\\', <br/>, \\'Graph Databases\\n\\', <br/>, <b>Location:</b>, \\' Bristol, London, Cambridge or part remote Start date: 1st Jan 2020 onwards Company size: 10-20 people Company type: VC funded\\n\\', <br/>, <br/>, \\'\\nBenefits\\n\\', <br/>, <br/>, \\'\\nShare options so early contributors benefit from our success.\\n\\', <br/>, \\'Epigenetic test!!\\n\\', <br/>, \\'Flexible office or home working.\\n\\', <br/>, \\'Macbook pro\\n\\', <br/>, \\'Friday pub sessions.\\n\\', <br/>, \\'About Us\\n\\', <br/>, <br/>, \\'\\nChronomics is an ambitious health tech start-up that believes people should be in charge of their own health. Health management should be proactive, not reactive and it should be personalised. We are using longitudinal biological data to bring about this revolution. A revolution where not only will people be in control of their own future but also in control of how they contribute to the future of humanity through the use of their data.\\n\\', <br/>, <br/>, \\\"\\nThis product is just the first step towards a platform technology that will serve as the interface between the biological and digital world. It\\'s an incredibly exciting time to come on board where you can really make a difference. Find out more at www.chronomics.com\\\"]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.5166006, "longitude": -0.2254268}}, {"title": "Data Scientist", "company": "Toumetis", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=bad349f4892ea944&fccid=1408f3873505835f&vjs=3", "description": "[<div><p>Toumetis Job Description</p><br/>\n<p></p>\n<p>\nData Scientist</p><br/>\n<p></p>\n<p>\nSalary DOE</p><br/>\n<p></p>\n<p>\nAbout our Company - Our mission at Toumetis is to deliver intelligence that can transform business operations and enable new revenue via the application of machine learning. We combine experience in applied machine learning, frontend development, data engineering, and cloud computing to help Fortune-1000 companies bring elegant IoT solutions to life, surfacing unique insights to predict and prevent problems and improve organisational performance. Our engineers, developers and data scientists share a passion for innovation and are dedicated to providing our customers with solutions that enable new insights that revolutionise business processes. We have a friendly working environment with flexible hours, regular social events, great coffee and snacks, free parking, ride to work scheme, bike racks, shower facilities and you will be supplied with a MacBook Pro.</p><br/>\n<p></p>\n<p>\nThe ideal candidate will have several years experience working commercially as a Data Scientist, with a keen interest to apply data science and machine learning working in client facing roles. You will be a key member of fast paced teams. Working alongside data engineers, front end developers and UX designers, you will be tasked with getting your algorithms into production on our real time analytics platform. You should be open to learning and using data science techniques on other applications.</p><br/>\n<p></p>\n<p>\nResponsibilities / Job Role</p>\n<ul>\n<li>Gaining a detailed understanding of client business issues.</li>\n<li>Exploratory data analysis.</li>\n<li>Cleaning, transforming and fusing large raw data sets.</li>\n<li>Model development and performance evaluation.</li>\n<li>Deploying models in production environments.</li>\n<li>Continuous evaluation and improvement of models in production.</li>\n<li>Keeping up to date with the latest tools, methods &amp; technologies</li><br/>\n</ul><p></p>\n<p>\nKey Skills / Experience</p>\n<ul>\n<li>Knowledge of python for data analysis and machine learning (pandas, numpy, scikit-learn, tensorflow, keras, etc.).</li>\n<li>Demonstrable machine learning experience (supervised/unsupervised) such as developing and deploying deep learning solutions relating to time series, NLP, video, and images.</li>\n<li>Knowledge in visualizing and presenting complex data and information.</li>\n<li>Exposure to working with large, complex and messy data sets.</li>\n<li>Capability to communicate complex concepts and data patterns to non-technical audiences.</li>\n<li>Experience or an interest to work in cloud-based development, test &amp; production environments.</li>\n</ul>\n<p>You’ll also have access to company paid training services as we’re keen for you to grow your skills.</p></div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4470004, "longitude": -2.6086458}}, {"title": "Software Developer Trainer", "company": "Mayden", "raw_location": "Bath", "raw_salary": "\n£30,000 - £50,000 a year", "min_salary": 30000.0, "max_salary": 50000.0, "mid_salary": 40000.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=f82f8cd0cf14dfe3&fccid=c3c454cd2a9999ad&vjs=3", "description": "[<div><p><b>Salary: </b>£30,000 - £50,000<br/>\n</p><p><b>\nLocation: </b>Bath<br/>\n</p><p>\nAre you an enthusiastic programmer looking for a new challenge? Come and work with us to help change people’s lives!</p>\n<p>\nWe run a 16 week coding course which turns newbies into junior developers, then get them great jobs which we know they’ll love. As an Academy trainer you’ll mainly focus on teaching – being a coach, mentor and trainer for your students while they learn the skills that will start their new careers.</p>\n<p>\nOutside of course times, you’ll work with the other trainers to update the curriculum, develop new workshops, assess student applications, run coding sessions for schools and events, deliver bespoke training for tech companies, and work with our hiring partners to find great jobs for your students after they graduate.</p>\n<p>\nAll of our trainers are given their own training, shadowing on the full 16 week Full Stack Track before they begin with their own class. So don’t worry if you’ve never taught before, or don’t know our exact stack. We’ll support you.</p>\n<p>\nThe most important thing is that you’ve got real world experience as a programmer, and want to do something a bit different to help give people a new start in life.</p>\n<p><b>\nAbout you</b></p>\n<p>\nYou’ll have worked as a professional software developer for at least a couple of years, with experience on real client projects. You will have helped support your team with difficult problems and be happy helping junior developers. You will have skills in OOP and be comfortable programming for the web with a back-end language, working with current industry standard technologies.</p>\n<p>\nYou will have experience with a range of development tools as well as experience of methodologies such as agile, pair programming and code reviews.</p>\n<p>\nWe’re not concerned with what language/s you use, as long as you have the experience and are happy to learn our own languages (PHP, Node.js and Javascript).</p>\n<p>\nIt doesn’t matter whether you use C, C++, C#, Ruby, Java, Python, Go, Swift or anything else – the most important thing is that you’re a friendly, motivated team player who wants to help people. We’re all about changing lives, and hope you are too.</p>\n<p><b>\nAbout us</b></p>\n<p>\nWe are all about people. We train people of all ages and backgrounds to code, giving them everything they need to know to land their first job as a junior software developer. We work hard to make sure our course is as inclusive as possible, and help to make positive change in the tech industry. Our graduates consistently tell us that their time at the Academy was one of the best in their lives.</p>\n<p>\nOur small classes mean you’ll get to know your students really well, and you’ll be part of a welcoming and fun team.</p>\n<p>\nOur offices are based in a historic building in beautiful Bath. It’s a 10 minute walk from the train station, with incredible views over the city and a lovely big garden. We’ve got break-out rooms with comfy sofas, books, board games and Mario Kart, and a big kitchen with tea, coffee, toast and fruit.</p>\n<p>\nWe pride ourselves on having created a happy place to work with a strong sense of value and purpose. You’ll be working alongside award-winning trainers and mentors in a team of people who love what they do. And you’ll be making a genuine difference to people’s lives.</p>\n<p>\nInterested?</p>\n<p>\nJust send a CV and a cover letter saying why you’d like to work with us. We’d love to hear from you.</p>\n<p>\nMust be eligible to live and work in the UK.</p>\n<p><b>\nSalary: £30-50k Plus Benefits</b></p>\n<p><b>\nSTRICTLY NO AGENCIES</b></p></div>, <p></p>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.3740822, "longitude": -2.3785498}}, {"title": "C++ Developer - Technologist", "company": "Client Server", "raw_location": "Bristol", "raw_salary": "\n£28,000 - £35,000 a year", "min_salary": 28000.0, "max_salary": 35000.0, "mid_salary": 31500.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=8cb72e2d13039ea3&fccid=892c145157842ceb&vjs=3", "description": "[<p></p>, <div><div><div>C++ Developer / Software Engineer (C++ Python Java SPARK). Are you a skilled, passionate technologist looking for an opportunity to support the global operation of a trailblazing tech start up? You could join a 120-strong, international team of exceptional engineers and will play a key role in developing bleeding edge technologies to meet the highest grade of open-source software development.<br/>\n<br/>\nThe company specialises in secure, reliable applications cover industries; from avionics, aerospace and defence to medical and energy, their advanced technologies are industry leading across the world. In this C++ Developer role, you\\'ll work directly on the language library for code intelligence for their proprietary programming language, and developing tools and libraries to support it.<br/>\n<br/>\nAs a C++ Developer you\\'ll have an extraordinary chance to develop your technical skills using cutting-edge technologies Libadalang, SPARK and Python, in conjunction with refining your craft on more traditional languages like C++ and Java. There will be a continuous, strong pipeline of projects to choose from, and will be supported to learn in a culture based on curiosity.<br/>\n<br/>\nYou\\'ll be based in brand new offices in Bristol, (a short walk from transport links) where you can enjoy great facilities, as well cake on Wednesday\\'s and drinks on Fridays in a highly inclusive team atmosphere. You\\'ll also have access to regular training opportunities, including the chance to travel to the New York and Paris offices, and a 3 day, company-wide gathering in Summer.<br/>\n<br/>\nRequirements:<br/>\n<ul><li>You have experience working with one or more high-level programming language (C++ / Java / Python)</li><li>You\\'re degree educated (2.1 or above, BSc / MSc / PhD)</li><li>You have a strong understanding of Computer Science fundamentals</li><li>You have knowledge of / interest in compilation / programming language analysis (demonstrable experience, even in form of university projects is highly beneficial)</li><li>You\\'re a confident, self-assured communicator who works well independently / is a key contributor in a team</li></ul>\n<br/>\nAs a C++ Developer you\\'ll earn a highly competitive salary (to £35k) plus a profits-based bonus and a comprehensive benefits package, including a generous holiday allowance, pension, private dental and healthcare and more.<br/>\n<br/>\nIf you\\'re interested in this C++ Developer / Software Engineer (C++ Python Java SPARK) role, apply now or get in touch today to find out more.</div></div></div>, <p></p>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.454513, "longitude": -2.58791}}, {"title": "Deals Technology - Software Developer - Senior Associate", "company": "PwC", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=3f66a58e473d972c&fccid=5e964c4afc56b180&vjs=3", "description": "[<div><p>A career in our National Operations practice, within Operations, will provide the opportunity to support our engagement teams and clients operationally by providing advice on accounting, financial reporting, and strategic business issues. In joining, you’ll help ensure a complete and relevant exchange of information among our consultants and in turn with engagement teams and clients, provide experts advice on a variety of specific topics, support engagement teams in resolving complex issues, and supporting clients and their subsidiaries in evaluating the potential impact of accounting and reporting standard setting initiatives. You’ll develop strong relationships with our engagement teams and enhance our ability to meet greater investor expectations with the challenges of an increasingly complex business environment.<br/>\n<br/>\nOur team collaborates across the PwC business lines of services to review and develop current or future operational strategies.</p><h5 class=\\\"jobSectionHeader\\\"><b>\nAbout the team</b></h5><p>\nOur Deals business is an exciting, fast-paced and an ever-growing business that focuses on deals and crisis situations for our clients. Collectively, we deal with the types of situations you hear about regularly in the news and we provide support, insight and analysis to the management, shareholders and financiers of business.</p><p>\nOur Deals practice supports clients through mergers, acquisitions and responses to financial distress. The Deals Tech team is a centre of excellence for embedding and enabling technology across our Deals practice.</p><p>\nWe help our Deals business go to market with compelling data analysis and automation technology. We are currently looking for a bright, enthusiastic, and hungry individual to help expand the reach of the team.</p><p>\nYou can expect a challenging and rewarding career that will provide you with opportunities to work with our client engagement teams along with other parts of the business. This is a fantastic opportunity to learn new technologies, further develop your skills and advance your career with the market leading employer.</p><p></p><h5 class=\\\"jobSectionHeader\\\"><b>\nAbout the role</b></h5><p>\nYou will be supporting the development and enhancement of in-house developed business software applications and business databases used across a broad range of Deals engagements. Projects will be mostly green field in nature, so you will have the opportunity to develop new solutions from the ground up and have significant input on technical direction. Your responsibilities will include but may not be limited to:</p><ul><li><p>\nCreating and upgrading bespoke applications using the .NET framework to integrate and enhance the teams business systems;</p></li><li><p>\nTesting applications and implementing fixes/code refactoring as necessary;</p></li><li><p>\nHelp to support the team’s SQL database systems;</p></li><li><p>\nAssist in the evaluation, selection, installation, configuration, maintenance, upgrade, and support of software applications within the firm;</p></li><li><p>\nProducing technical documentation; and</p></li><li><p>\nTaking part in code reviews and providing input on architectural decisions.</p></li></ul><p></p><h5 class=\\\"jobSectionHeader\\\"><b>\nRequirements</b></h5><p>\nIf you are naturally inquisitive, have an analytical mind and enjoy solving problems in a rigorous and logical manner, for a variety of different businesses then this is the role for you. Alongside other members of the team you will engage with senior members of our business and clients, helping to solve their business problems and generate value.</p><h5 class=\\\"jobSectionHeader\\\"><b>\nYou will need significant experience demonstrating a number of the following skills:</b></h5><ul><li><p>\nExceptional analytical and technical aptitude, and enjoy problem solving;</p></li><li><p>\nHave an entrepreneurial mind set and self-starter mentality, and be comfortable with a degree of ambiguity to come up with creative solutions to complex problems and develop these ideas into structured deliverable projects;</p></li><li><p>\nAn ability to work effectively on tasks, both individually and collaboratively;</p></li><li><p>\nThe ability to manage time, prioritise tasks, self-review your work and produce deliverables of a high quality under tight client deadlines in time pressured environments;</p></li><li><p>\nA strong desire to acquire and share technical knowledge with others;</p></li><li><p>\nPassion for technology and new tools and applying and developing yourself to new areas (e.g. quickly getting up to speed with tools, analytical approaches and business challenges);</p></li><li><p>\nBuild collaborative working relationships at all levels, establishing credibility both internally and externally.</p></li></ul><h5 class=\\\"jobSectionHeader\\\"><b>\nTechnical skills</b></h5><ul><li><p>\nHave experience of developing applications using the .NET framework (preferably version 4.6 and onwards) with C# and Visual Studio;</p></li><li><p>\nExperience developing ASP.NET MVC Applications;</p></li><li><p>\nExperience using version control systems, preferably Git;</p></li><li><p>\nAn understanding of the Agile development process;</p></li><li><p>\nAn understanding of cloud services such as Azure, Google Cloud and AWS;</p></li><li><p>\nGood experience of using SQL Server (writing queries, designing tables, use of stored procedures, etc);</p></li><li><p>\nExperience using a wide range of APIs; and</p></li><li><p>\nProven experience in all aspects of the Software Development Lifecycle.</p></li></ul><h5 class=\\\"jobSectionHeader\\\"><b>\nThe following skills are also desirable</b></h5><ul><li><p>\nExperience of Entity Framework</p></li><li><p>\nExperience of ADO.NET</p></li><li><p>\nExperience writing and reviewing technical documentation;</p></li><li><p>\nJavascript (jQuery, React/Angular);</p></li><li><p>\nPresentation frameworks such as Bootstrap</p></li><li><p>\nOther coding languages such as Python/VB.NET;</p></li><li><p>\nExperience working in a corporate deal environment; and</p></li><li><p>\nAn understanding of basic accounting principles.</p></li></ul><p></p><h5 class=\\\"jobSectionHeader\\\"><b>\nLocation</b></h5><p>\nThis position is based in our Bristol office, located just near Temple Meads train station.</p><br/>\n<p><b>\nDeals</b></p>\n<p>\nOur Deals business is an exciting, fast-paced and an ever-growing business that focuses on deals and crisis situations for our clients. Collectively, we deal with the types of situations you hear about regularly in the news and we provide support, insight and analysis to the management, shareholders and financiers of business.\n</p><p><b>Not the role for you?</b></p>\n<p>\nDid you know PwC offer flexible contract arrangements as well as contingent work ( ie temporary or day rate contracting)?</p>\n<p><b>\nThe skills we look for in future employees</b></p>\n<p>\nAll our people need to demonstrate the skills and behaviours that support us in delivering our business strategy. This is important to the work we do for our business, and our clients. These skills and behaviours make up our global leadership framework, ‘The PwC Professional’ and are made up of five core attributes; whole leadership, technical capabilities, business acumen, global acumen and relationships.\n</p><p>Learn more here www.pwc.com/uk/careers/experienced/apply</p>\n<p><b>\nDiversity</b></p>\n<p>\nWe work in a changing world which offers great opportunities for people with diverse backgrounds and experiences. We seek to attract and employ the best people from the widest talent pool, as well as those who reflect the diverse nature of our society. And we aim to encourage a culture where people can be themselves and be valued for their strengths. Creating value through diversity is what makes us strong as a business and as an organisation with an increasingly agile workforce, we\\'re open to flexible working arrangements where appropriate.</p>\n<p>\nLearn more here www.pwc.com/uk/diversity</p></div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.45171, "longitude": -2.579683}}, {"title": "Python Developer", "company": "Explore Group", "raw_location": "Bath", "raw_salary": "\n£25,000 - £60,000 a year", "min_salary": 25000.0, "max_salary": 60000.0, "mid_salary": 42500.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=ddd4b0b1dbdb5489&fccid=f877f9ab98439bf6&vjs=3", "description": "[\\'After being acquired by a multi-billion dollar company headquartered in America, a software development company based in Bath are looking for a number of Python Developers as they expand.\\n\\', <br/>, <br/>, \\'\\nThis company have revolutionised the retail area, by creating an in-house product that is monitored by a central server. This product has distributed networks of virtualized and containerized services, that gives the client the instruments for Cloud Management in an onsite premise. They use Python, React as well as a number of other technologies and now that they have had great success in the roll out of their product, are looking for several developers at this exciting turning point for the company.\\n\\', <br/>, \\'You will be working on both new and existing areas of the product, with a chance to use a wide range of technologies. They are looking for Fullstack Python Developers from no commercial experience upwards, where you will produce code that is clean, create test-cases for functionality as well as a multitude of other tasks, all within an office in central Bath.\\n\\', <br/>, <br/>, \\'\\n\\', <b>If you have these you could be a great fit:</b>, <br/>, \\'\\nPython experience\\n\\', <br/>, \\'React experience\\n\\', <br/>, \\'Computer Science degree (or similar)\\n\\', <br/>, <b>Now, let\\'s talk numbers:</b>, \\' £25-60k DOE\\']", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.3810641, "longitude": -2.3590167}}, {"title": "Senior Python Developer", "company": "Toumetis", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=f54f8cf6292107ea&fccid=1408f3873505835f&vjs=3", "description": "[<div><p>TouMetis Job Description</p><br/>\n<p></p>\n<p>\nSenior Python Developer</p><br/>\n<p></p>\n<p>\nSalary DOE</p><br/>\n<p></p>\n<p>\nAbout our Company Our mission at Toumetis is to deliver intelligence that can transform business operations and enable new revenue via the application of machine learning. We combine experience in applied machine learning, frontend development, data engineering, and cloud computing to help Fortune-1000 companies bring elegant solutions to life, surfacing unique insights to predict and prevent problems and improve organisational performance. Our engineers, developers and data scientists share a passion for innovation and are dedicated to providing our customers with solutions that enable new insights that revolutionise business processes. We have a friendly working environment with flexible hours, regular social events, great coffee and snacks, free parking, ride to work scheme, bike racks, shower facilities and you will be supplied with a MacBook Pro.</p><br/>\n<p></p>\n<p>\nJoining the Cascadence development team you will work closely with the data science team to deploy data science models. We’re building a service based architecture that gives us flexibility so that we can adapt to the requirements of each customer. We’re deploying on AWS using Docker and Terraform.</p>\n<p>\nWe’re looking for someone with roughly 3 years of professional experience with Python, an interest in data science and data visualisation is a bonus. You’ll be working in a small team of developers who are working in an Agile development process. We’re looking for someone keen to take advantage of opportunities to develop their skills and to suggest ways to improve our code and our products.</p><br/>\n<p></p>\n<p>\nIf you have good experience with any or all of our tech stack then please get in touch!</p>\n<p>\nTech we use</p>\n<ul><li>Python 3</li></ul>\n<ul><li>FastApi</li></ul>\n<ul><li>AWS</li></ul>\n<ul><li>Docker</li></ul>\n<ul><li>Terraform</li></ul>\n<ul><li>React.js (with Redux)</li></ul>\n<ul><li>Typescript</li></ul>\n<ul><li>Git</li></ul>\n<ul><li>Postgres</li></ul><br/>\n<p></p>\n<p>\nYou’ll also have access to company paid training services as we’re keen for you to grow your skills.\n<br/>\n<br/>\nFor a confidential discussion about this role, or if you feel your skillset would be of benefit to the TouMetis team but doesn’t match a specific job spec, please get in touch with our Talent Acquisition team - george.wrightson@Toumetis.com/ 07853 926 928</p></div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4470004, "longitude": -2.6086458}}, {"title": "Python/ Go Developer £40-60k", "company": "Headforwards", "raw_location": "South West", "raw_salary": "\n£40,000 - £60,000 a year", "min_salary": 40000.0, "max_salary": 60000.0, "mid_salary": 50000.0, "detail_url": "http://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0DuHDjNWw39SJ5e6sYpMBsA1c0MQ32LDXTWEMHTY-Wt9ZQzCHqjxt7ZbJTKCx1V4ZVW3A1qpVUyL8QXEoJ4hRVCx1OkQ-efXv4ZkL56kDwdfFnW1kvWN3Z4r7xDPB0FOGn5FWCfWiAk-dPE92itq021Z0WIkC8FCL4t1sd5Y_4svKGy4BvrkeEn7WnRCLDSQAFfC7MqXjLGT4MOEhhhenKHC6wIr3rfs51IZnj5fUdeBe-w4I0Dt1ZyUjaAw-fOwUomvAzQdajb2YS_r-dWnr9E0xYcHgXocf27grW-hZLHB9vEbMWgI9eHJVaDi7GaoI3noklFLm2N-j_ElnoJn_9TJnQDRiid_FNEuPs5AxVCQ0ckcJyRMGqjk1MkEDzkBaThauL9nszuLG3xlbH4ax45b1Qu8aDXvuHleLFNiMpMGFBun1pr5H4cQcJL8Lw_45HhFyYi-Lk6aBpNmqIzwlJVdoJAUzc1xfw=&p=0&fvj=1&vjs=3", "description": "[<p><b>Are you a Developer who is keen to bleed the edges of your experience?</b></p>, <p>If so, we would love to hear from you! We are looking for an experienced developer in Python and/or Go to join one of our high performing development teams. If you have good commercial experience in a similar or related language you could also fit in well.</p>, <p><b>We are offering a salary of up to £60,000 depending on experience.</b></p>, <p><b>What will you be doing? </b></p>, <ul><li>You will be joining a fast-moving development team working on the backend of a cutting-edge web application for one of the largest telecoms companies in the world, building and deploying microservices at scale, on a Kubernetes platform, with multiple global regions.</li><li>You will be using and improving our in house continuous delivery pipelines to release new features and functionality to the client.</li></ul>, <p>We are delivering multiple releases every day and working with some pretty exciting technologies alongside fully employing the use of Agile methodologies across the whole business.</p>, <p>You may currently be a Team Lead, or an Architect in your current role and looking for a new challenge.</p>, <p><b>Why work for Headforwards?</b></p>, <ul><li>We are a software development company with just over 100 people from 18 different countries and we like to have fun at work!</li><li>We are agile with a very laid back feel, a relatively flat structure and small self-organising teams of 2-7 people. We work in teams dedicated to various clients and we work on global projects with cutting edge technologies, tools and techniques.</li><li>There\\'s no pressure to work extra hours to churn out more and more code.</li><li>Our culture and environment is dedicated to making people happy at work.</li><li>We live in beautiful Cornwall, our offices are 5 miles from the beach. We want to make sure our people have a good work life balance so that they can enjoy all that Cornwall has to offer : )</li><li>We have lots of social activities and monthly learning sessions, talks and cross company communities of practice for various languages, tools and frameworks.</li></ul>, <p>This is a place where you can make a difference, work in a small team start-up feel but benefit from the support of a larger community of developers and like-minded people.</p>, <p><b>Key Personal Traits</b></p>, <ul><li>You will have been a developer for at least five years</li></ul>, <ul><li>You will have used Python or Go</li><li>You are happy to work as both a Mentor or Leader within a team, and contribute to a wider project team</li><li>We enjoy spirited exchanges of ideas, pushing us towards technical excellence and we expect to hear your voice in these conversations.</li><li>You will be a natural problem solver and able to align business delivery priories against implementation choices.</li><li>You will have the desire and ability to continually learn in improve yourself, and your colleagues.</li></ul>, <p><b>Key Technical Skills</b></p>, <ul><li>Knowledge of relational and / or non-relational (NoSQL) databases (we use MongoDB, Postgres, Redis, InfluxDB)</li><li>Experience of message queues (we use Kafka)</li><li>Experience of container orchestration (we use Kubernetes, Docker)</li><li>An operational mindset with knowledge of high availability, monitoring and diagnostics</li><li>Understanding of the web application stack</li><li>A pragmatic and practical approach to solving business problems</li><li>Exposure to test driven development and integration testing</li><li>Experience working with development team tools (e.g. continuous integration systems (we use Jenkins) and version control systems (we use Git)</li></ul>, <p><b>The closing date for this role is 31st March 2020. We recruit on a rolling basis and fill our vacancies as soon as we find people who fit our culture and meet the skills requirements. This means that whilst we have a closing date on all of our roles, we may offer the role to someone before the end date, so we recommend that you apply as soon as possible.</b></p>, <p>Job Types: Full-time, Permanent</p>, <p>Salary: £40,000.00 to £60,000.00 /year</p>, <p>Experience:</p>, <ul><li>Python: 4 years (Preferred)</li></ul>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 50.2272249, "longitude": -5.2716259}}, {"title": "Full Stack Applications Developer", "company": "Graphcore", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0B2LP6KtwgLMWcIJbzQK4y118hUYa2NHT0ELzb4aR6nDrO9_32R0LtazQt5Ev9ntbMF67x-uIqCFBIaSgF3Jr_RlBZttv17jHoO36gbiKCViwKMlso9PTYyZrCltqyWFf2M33tYYDFxulDCuG005fjA9bOKTyD0CWzIrw-icr-yXIKNvaOxE690qACRA3_30yCRZW_oaromda9TDeCdlz5HIpqjuDKNSpr4n5RfWJ0kWCFCaMAsu-mZaR8_G4YHqrMH9IhhNo9KqJV5uZnN5JflNzShdPDqPIl37tGJboxVdaGeUeznmZ-xMg82ZBjYkaNLOD6dL5fEcbwZn8m2JLEBwVbpgTvSlEAchj1V8_4BTa-OfOzpeQi7Rh2NZ1NRE4lzkSEnltM6KZjEa90gLo2_QivLQdgucYvCyyNNA8xRcMP-NnBtK5tR&p=1&fvj=0&vjs=3", "description": "[<div><b>Full Stack Applications Developer, Full-Time, Bristol</b>\n<br/>\n<br/>\nGraphcore has created a completely new processor, the Intelligence Processing Unit (IPU), specifically designed for artificial intelligence. The IPU\\'s unique architecture means developers can run current machine learning models orders of magnitude faster. More importantly, it lets AI researchers undertake entirely new types of work, not possible using current technologies, to drive the next great breakthroughs in general machine intelligence.\n<br/>\n<br/>\nWe believe our IPU technology will become the worldwide standard for artificial intelligence compute. The performance of Graphcore\\'s IPU is going to be transformative across all industries and sectors whether you are a medical researcher, roboticist or building autonomous cars.\n<br/>\n<br/>\nOur team is at the forefront of the artificial intelligence revolution, enabling innovators from all industries and sectors to expand human potential with technology. What we do, really makes a difference.\n<br/>\n<br/>\nThe Full-Stack Application Developer will contribute by supporting the planning and release procedures, by designing, scoping and building a number of critical tools and applications. You will be involved in creating a visual tool for release and features planning, release automation, UI to a number of systems to simplify, expand and improve the SDLC of the whole SW engineering and Product team.\n<br/>\n<br/>\nIdeally, you are an expert in full-stack applications space and will be instrumental in the improvements and capabilities of the day-by-day work in Graphcore.\n<br/>\n<br/>\nYou will work with the Release Manager, collect requirements from the Product team. You will be closely involved with the DevOps team and the whole SW engineering while shaping the future SDLC. Everything you will build will be used by hundreds of developers across the globe, to deliver the latest AI technology.<br/>\n<h2 class=\\\"jobSectionHeader\\\"><b>\nResponsibilities</b></h2>\n<ul><li>Develop applications and tools in full-stack, cross-platform, environment.</li>\n<li>Ability to build an application from scratch: from design to deployment</li>\n<li>Ability to design efficient and effective UIs</li>\n<li>Working with an Agile scrum methodology, breaking work down in epics and stories</li>\n</ul><h2 class=\\\"jobSectionHeader\\\"><b>Key Skills</b></h2>\n<ul><li>Passion driven, goal-oriented and \\\"Can do\\\" attitude</li>\n<li>Experience of full-stack cross-platform environment: Linux/MacOS/Windows</li>\n<li>Intimate familiarity of version control, specifically git</li>\n<li>Ability to build complex applications in Python, PHP, bash</li>\n<li>Knowledge of SQL and relational databases like MySQL or SQLite</li>\n<li>Comfortable in understanding opensource tools and build extensions for them</li>\n<li>Ability to interface with opensource communities as needed</li>\n</ul>Please note, we are only considering candidates who have an established right to work in the UK for roles based in Bristol, UK\n<br/>\n<br/>\nWe welcome people of different backgrounds and experiences and are committed to building an inclusive work environment that makes Graphcore a great home for everyone. We are an equal opportunity employer and want to build a work environment where everyone is happy, productive and respectful, so they can do their best work. If you have a disability or additional need that requires accommodation, just let us know.</div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4552872, "longitude": -2.5923872}}, {"title": "Junior Python Developer - Trading", "company": "Client Server", "raw_location": "Bristol", "raw_salary": "\n£50,000 - £75,000 a year", "min_salary": 50000.0, "max_salary": 75000.0, "mid_salary": 62500.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=1998d35c0a752edc&fccid=892c145157842ceb&vjs=3", "description": "[<p></p>, <div><div><div>Junior Python Developer / Software Engineer (Trading C++ Linux). One of the most successful proprietary trading forms in the world is seeking a bright, ambitious Junior Python Developer to join their highly accomplished team and work on a strong pipeline of projects.\n<br/>\n<br/>\nAs a Junior Python Developer you\\'ll work on highly complex, deeply technical systems with cross-functional teams who are committed to delivering high quality software releases, business-wide exposure with the chance to benefit from their culture of curiosity and continual learning.\n<br/>\n<br/>\nThe organisation is behind one of the most powerful computing grids in the world, and has asserted its position on the global stage by combining cutting-edge technology and granular data to solve the most complex of technical problems.\n<br/>\n<br/>\nAs a Junior Python Developer, you\\'ll join the rapidly expanding Core Development sector of the business, in a highly collaborative team that designs, codes, tests and maintains the high performance distributed systems that powers their trading operation. You\\'ll work directly with a close-knit team to deploy critical features to the trading platform with the opportunity to benefit from accomplished senior colleagues.\n<br/>\n<br/>\n*Please note: this company is able to conduct an entirely remote interview process during the current circumstances*<br/>\n<br/>\nRequirements:<br/>\n<ul><li>You\\'re degree educated (2.1 or above, BSc / MSc / PhD)\n</li><li>You have strong Python coding ability\n</li><li>You have a thorough understanding of Computer Science fundamentals like OOP, Data Structures, threading models and networking\n</li><li>You\\'re naturally analytical and approach complex technical problems in a logical, thoughtful manner\n</li><li>You\\'re a positive team player who enjoys working collaboratively\n</li><li>Desirable: C++ skills\n</li></ul><br/>\nAs a Junior Python Developer you\\'ll earn a highly competitive salary (to £75k) plus bonus and a comprehensive benefits package.\n<br/>\n<br/>\nApply now or call for a confidential discussion about this Junior Python Developer / Software Engineer (Trading C++ Linux) opportunity.</div></div></div>, <p></p>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.454513, "longitude": -2.58791}}, {"title": "Backend Developer (Python)", "company": "Chronomics", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=128236f9aae020a8&fccid=be1fa4c3e40ce18e&vjs=3", "description": "[\\'Our mission\\n\\', <br/>, <br/>, \\'\\nWant to make a difference in this world and work on something meaningful? At Chronomics we enable people to quantify how their environment and lifestyle is affecting their health to live healthier and happier lives… all from their DNA. We will love you because…\\n\\', <br/>, \\'You’re an expert coder in at least 1 language (Python/PHP/Node.js).\\n\\', <br/>, \\'You have a product mindset and understand creating value, not features.\\n\\', <br/>, \\\"And most of all you\\'r enthusiastic and get shit done. Working in a product focused cross functional team alongside other developers, designers, data scientists and bioinformaticians you will take ownership of projects and get to work on a cutting edge microservice architecture using serverless working with HUGE data (each DNA sample is 100GB…) to build a ground breaking epigenetics platform which is the first of its kind in the world. We built to ship, we ship fast and then we learn and iterate. With a can-do attitude and a strong product mentality you are happy to jump in and get your hands dirty which could be anything from learning GO, building a Lambda microservice or optimizing an AWS pipeline. You will get the chance to work with numerous different technologies, have a say in how we drive the company forward and learn a ton of science along the way. Essential skills:\\n\\\", <br/>, <br/>, \\'\\nCan write secure, scalable, readable code in at least one or two languages\\n\\', <br/>, \\'Experience designing and scaling databases\\n\\', <br/>, \\'Designing, building, consuming AND documenting REST APIs\\n\\', <br/>, \\'Cloud platforms (AWS)\\n\\', <br/>, \\'Happy on the command line\\n\\', <br/>, \\'Agile development\\n\\', <br/>, \\'Test automation\\n\\', <br/>, \\'Familiarity with mobile and web development\\n\\', <br/>, <ul>\n<li>Work as part of a focused team, but at the same time self-driven and able to work independently Nice to have:</li>\n</ul>, \\'\\nSome dev ops (CI/CD/Docker)\\n\\', <br/>, \\'Infrastructure as code (Terraform/CloudFormation)\\n\\', <br/>, \\'Experience with other languages such as Python/JavaScript (React/Node) etc\\n\\', <br/>, \\'Serverless experience\\n\\', <br/>, \\'Experience with big data\\n\\', <br/>, \\'Experience working on high scalability websites\\n\\', <br/>, \\'Have worked with genetics data\\n\\', <br/>, \\'Experience with serverless and microservices architecture\\n\\', <br/>, \\'Graph Databases\\n\\', <br/>, <b>Location:</b>, \\' Bristol, London, Cambridge or part remote Start date: 1st Jan 2020 onwards Company size: 10-20 people Company type: VC funded\\n\\', <br/>, <br/>, \\'\\nBenefits\\n\\', <br/>, <br/>, \\'\\nShare options so early contributors benefit from our success.\\n\\', <br/>, \\'Epigenetic test!!\\n\\', <br/>, \\'Flexible office or home working.\\n\\', <br/>, \\'Macbook pro\\n\\', <br/>, \\'Friday pub sessions.\\n\\', <br/>, \\'About Us\\n\\', <br/>, <br/>, \\'\\nChronomics is an ambitious health tech start-up that believes people should be in charge of their own health. Health management should be proactive, not reactive and it should be personalised. We are using longitudinal biological data to bring about this revolution. A revolution where not only will people be in control of their own future but also in control of how they contribute to the future of humanity through the use of their data.\\n\\', <br/>, <br/>, \\\"\\nThis product is just the first step towards a platform technology that will serve as the interface between the biological and digital world. It\\'s an incredibly exciting time to come on board where you can really make a difference. Find out more at www.chronomics.com\\\"]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.5166006, "longitude": -0.2254268}}, {"title": "Entry Level GIS Professional", "company": "Geollect Limited", "raw_location": "Bristol", "raw_salary": "\n£18,000 - £22,500 a year", "min_salary": 18000.0, "max_salary": 22500.0, "mid_salary": 20250.0, "detail_url": "http://www.indeed.co.uk/company/Geollect/jobs/Entry-Level-GIS-Professional-7aa2c691079199be?fccid=9b81b6ebc61889fd&vjs=3", "description": "[<p><b>Geospatial Analyst - Entry Level</b><br/>Geollect is an agile geospatial intelligence and analysis company, providing dynamic insights for decision support to a network of global clients in the defence, maritime insurance and cruise industries. We are looking for an ambitious candidate who has a passion for GIS, loves a good challenge, and wants to be part of a rapidly growing company.</p>, <p><b>Job Description</b></p>, <p>The successful candidate will form an integral part of the geospatial analytical team, working on multiple projects across a diverse range of sectors. We are looking for someone who can embrace each challenge with enthusiasm as a team player or independently with a strong will to succeed. You will be required to analyse and interpret multiple data layers using innovative techniques to assist in the automation and quality control of Geollect\\'s suite of products. You will leverage all available datasets, including, but not limited to, satellite imagery, infrastructure data, news and social media, maritime vessel locations, third-party APIs and crowd-sourced data. The analytical team are looking for relationships in the data, patterns of life and anomalies to provide powerful insights within a comprehensive operating picture to help our clients identify operational risk and opportunities. You will also work closely with the data scientists, data engineers and web developers.</p>, <p>This opportunity is perfect for a GIS (or related subject) graduate, who wants to develop a keen understanding of how geospatial technology is applied in a commercial setting. For the right employee, this role provides the opportunity to grow into leadership positions as the company scales.</p>, <p>You are encouraged to apply even if you don\\'t meet all of the requirements below. Geollect are building a team that fit together well, and are open to a variety of skills and levels of experience. Candidates are welcome to get in touch for further information prior to application.</p>, <p><b>Required Skill Sets</b></p>, <p><i>GIS analysis qualifications</i></p>, <ul><li>ArcGIS suite of products experience</li><li>ArcGIS Online experience</li><li>Web Mapping Service (WMS) knowledge</li><li>Web Feature Service (WFS) knowledge</li><li>JSON knowledge</li><li>SQL knowledge</li><li>Data entry, conversion and maintenance</li><li>Metadata creation and editing</li><li>Portability of skills on multi-platforms</li><li>Basic understanding of programming</li></ul>, <p><i>Other qualifications</i></p>, <ul><li>Ability to work effectively from a remote location</li><li>Ability to quickly learn sector-specific information to better exploit available datasets</li><li>Apply skill sets and expertise in multiple domains</li><li>Creative thinking with attention to detail</li><li>Innovative and proactive approach to problem solving</li><li>Evidence of continued personal and professional development</li></ul>, <p><i>Desired Skillsets</i></p>, <ul><li>Programming language (Python, .Net)</li><li>Imagery exploitation training or equivalent experience</li><li>GIS workflows - model building</li><li>GIS architecture (web and desktop)</li><li>Knowledge of SAR exploitation</li><li>Ability to translate user needs to solutions</li><li>Ability to present solutions in a simplistic visual manner</li><li>Clear, concise communication skills</li><li>Customer support skills</li></ul>, <p>Benefits:</p>, <ul><li>On-site parking</li><li>Flexible working hours</li><li>Sick pay</li><li>Bonus scheme</li><li>Casual dress</li><li>Company events &amp; social hours</li></ul>, <p>Job Types: Full-time, Contract, Permanent</p>, <p>Salary: £18,000.00 to £22,500.00 /year</p>, <p>Experience:</p>, <ul><li>ArcGIS: 1 year (Preferred)</li><li>GIS: 1 year (Preferred)</li></ul>, <p>Education:</p>, <ul><li>Bachelor\\'s (Preferred)</li></ul>, <p>Location:</p>, <ul><li>Bristol, Bristol (Required)</li></ul>, <p>Language:</p>, <ul><li>English (Required)</li></ul>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.454513, "longitude": -2.58791}}, {"title": "Data Scientist", "company": "Toumetis", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=bad349f4892ea944&fccid=1408f3873505835f&vjs=3", "description": "[<div><p>Toumetis Job Description</p><br/>\n<p></p>\n<p>\nData Scientist</p><br/>\n<p></p>\n<p>\nSalary DOE</p><br/>\n<p></p>\n<p>\nAbout our Company - Our mission at Toumetis is to deliver intelligence that can transform business operations and enable new revenue via the application of machine learning. We combine experience in applied machine learning, frontend development, data engineering, and cloud computing to help Fortune-1000 companies bring elegant IoT solutions to life, surfacing unique insights to predict and prevent problems and improve organisational performance. Our engineers, developers and data scientists share a passion for innovation and are dedicated to providing our customers with solutions that enable new insights that revolutionise business processes. We have a friendly working environment with flexible hours, regular social events, great coffee and snacks, free parking, ride to work scheme, bike racks, shower facilities and you will be supplied with a MacBook Pro.</p><br/>\n<p></p>\n<p>\nThe ideal candidate will have several years experience working commercially as a Data Scientist, with a keen interest to apply data science and machine learning working in client facing roles. You will be a key member of fast paced teams. Working alongside data engineers, front end developers and UX designers, you will be tasked with getting your algorithms into production on our real time analytics platform. You should be open to learning and using data science techniques on other applications.</p><br/>\n<p></p>\n<p>\nResponsibilities / Job Role</p>\n<ul>\n<li>Gaining a detailed understanding of client business issues.</li>\n<li>Exploratory data analysis.</li>\n<li>Cleaning, transforming and fusing large raw data sets.</li>\n<li>Model development and performance evaluation.</li>\n<li>Deploying models in production environments.</li>\n<li>Continuous evaluation and improvement of models in production.</li>\n<li>Keeping up to date with the latest tools, methods &amp; technologies</li><br/>\n</ul><p></p>\n<p>\nKey Skills / Experience</p>\n<ul>\n<li>Knowledge of python for data analysis and machine learning (pandas, numpy, scikit-learn, tensorflow, keras, etc.).</li>\n<li>Demonstrable machine learning experience (supervised/unsupervised) such as developing and deploying deep learning solutions relating to time series, NLP, video, and images.</li>\n<li>Knowledge in visualizing and presenting complex data and information.</li>\n<li>Exposure to working with large, complex and messy data sets.</li>\n<li>Capability to communicate complex concepts and data patterns to non-technical audiences.</li>\n<li>Experience or an interest to work in cloud-based development, test &amp; production environments.</li>\n</ul>\n<p>You’ll also have access to company paid training services as we’re keen for you to grow your skills.</p></div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4470004, "longitude": -2.6086458}}, {"title": "C++ Developer - Technologist", "company": "Client Server", "raw_location": "Bristol", "raw_salary": "\n£28,000 - £35,000 a year", "min_salary": 28000.0, "max_salary": 35000.0, "mid_salary": 31500.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=8cb72e2d13039ea3&fccid=892c145157842ceb&vjs=3", "description": "[<p></p>, <div><div><div>C++ Developer / Software Engineer (C++ Python Java SPARK). Are you a skilled, passionate technologist looking for an opportunity to support the global operation of a trailblazing tech start up? You could join a 120-strong, international team of exceptional engineers and will play a key role in developing bleeding edge technologies to meet the highest grade of open-source software development.<br/>\n<br/>\nThe company specialises in secure, reliable applications cover industries; from avionics, aerospace and defence to medical and energy, their advanced technologies are industry leading across the world. In this C++ Developer role, you\\'ll work directly on the language library for code intelligence for their proprietary programming language, and developing tools and libraries to support it.<br/>\n<br/>\nAs a C++ Developer you\\'ll have an extraordinary chance to develop your technical skills using cutting-edge technologies Libadalang, SPARK and Python, in conjunction with refining your craft on more traditional languages like C++ and Java. There will be a continuous, strong pipeline of projects to choose from, and will be supported to learn in a culture based on curiosity.<br/>\n<br/>\nYou\\'ll be based in brand new offices in Bristol, (a short walk from transport links) where you can enjoy great facilities, as well cake on Wednesday\\'s and drinks on Fridays in a highly inclusive team atmosphere. You\\'ll also have access to regular training opportunities, including the chance to travel to the New York and Paris offices, and a 3 day, company-wide gathering in Summer.<br/>\n<br/>\nRequirements:<br/>\n<ul><li>You have experience working with one or more high-level programming language (C++ / Java / Python)</li><li>You\\'re degree educated (2.1 or above, BSc / MSc / PhD)</li><li>You have a strong understanding of Computer Science fundamentals</li><li>You have knowledge of / interest in compilation / programming language analysis (demonstrable experience, even in form of university projects is highly beneficial)</li><li>You\\'re a confident, self-assured communicator who works well independently / is a key contributor in a team</li></ul>\n<br/>\nAs a C++ Developer you\\'ll earn a highly competitive salary (to £35k) plus a profits-based bonus and a comprehensive benefits package, including a generous holiday allowance, pension, private dental and healthcare and more.<br/>\n<br/>\nIf you\\'re interested in this C++ Developer / Software Engineer (C++ Python Java SPARK) role, apply now or get in touch today to find out more.</div></div></div>, <p></p>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.454513, "longitude": -2.58791}}, {"title": "Python Developer", "company": "Explore Group", "raw_location": "Bath", "raw_salary": "\n£25,000 - £60,000 a year", "min_salary": 25000.0, "max_salary": 60000.0, "mid_salary": 42500.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=ddd4b0b1dbdb5489&fccid=f877f9ab98439bf6&vjs=3", "description": "[\\'After being acquired by a multi-billion dollar company headquartered in America, a software development company based in Bath are looking for a number of Python Developers as they expand.\\n\\', <br/>, <br/>, \\'\\nThis company have revolutionised the retail area, by creating an in-house product that is monitored by a central server. This product has distributed networks of virtualized and containerized services, that gives the client the instruments for Cloud Management in an onsite premise. They use Python, React as well as a number of other technologies and now that they have had great success in the roll out of their product, are looking for several developers at this exciting turning point for the company.\\n\\', <br/>, \\'You will be working on both new and existing areas of the product, with a chance to use a wide range of technologies. They are looking for Fullstack Python Developers from no commercial experience upwards, where you will produce code that is clean, create test-cases for functionality as well as a multitude of other tasks, all within an office in central Bath.\\n\\', <br/>, <br/>, \\'\\n\\', <b>If you have these you could be a great fit:</b>, <br/>, \\'\\nPython experience\\n\\', <br/>, \\'React experience\\n\\', <br/>, \\'Computer Science degree (or similar)\\n\\', <br/>, <b>Now, let\\'s talk numbers:</b>, \\' £25-60k DOE\\']", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.3810641, "longitude": -2.3590167}}, {"title": "Python Developer", "company": "+1 location", "raw_location": "Bristol", "raw_salary": "\n£45,000 - £55,000 a year", "min_salary": 45000.0, "max_salary": 55000.0, "mid_salary": 50000.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=b74c0444f5ddc94e&fccid=e884fac1a9f6027b&vjs=3", "description": "[\\'Varied project base all centred on Data Science/IoT.\\n\\', <br/>, \\'Ambitious growth period with scope to get from 30 to 100 in the next 2 years.\\n\\', <br/>, \\'International customer base working with a diverse range of household names.\\n\\', <br/>, <br/>, \\'\\nA well-reputed predictive analytics & application consulting provider is going through a rapid period of growth and are looking for Python Developers to join their team. Born in America, the Bristol office is now at c30 (developers, testers, data scientists/engineers) with scope to get to 50 in 2020, and 100 in the next 2 years. They operate in a highly Agile environment, working with an incredibly diverse & global customer base spread across the UK, Australia, Canada, Germany, Mexico, Spain & Monaco. The business are constantly looking to integrate new & emerging technologies into the business, a lot of their techies are customer facing as well.\\n\\', <br/>, <br/>, \\\"\\nWhat skills you\\'ll need\\n\\\", <br/>, <br/>, \\'\\nProven Python development experience, preferably with an interest in data science/visualisation.\\n\\', <br/>, \\'Back-end focused with an appreciation for front-end technology. Understanding of React/TypeScript.\\n\\', <br/>, \\'Significant knowledge of infrastructure-as-code (Terraform).\\n\\', <br/>, \\'Containerisation experience (Docker, Kubernetes).\\n\\', <br/>, \\'Awareness of cloud technology, particularly with AWS.\\n\\', <br/>, \\'Any understanding of FastAPI, Git or Postgres would be beneficial.\\n\\', <br/>, \\'Extensive knowledge of Agile/Scrum methodologies and ability to work in a highly Agile environment.\\n\\', <br/>, <br/>, \\\"\\nWhat you\\'ll be doing\\n\\\", <br/>, <br/>, \\'\\nJoining a small development team in the data science division of the business, you will take ownership of a high-level data science platform which will need a service-based architecture built to allow adaptation of requirements depending on the particular customer. This role is primarily server-side focused but you will need to offer enthusiasm for the front-end and will offer support with React/TypeScript as and when needed. The solution will be deployed on AWS using Docker & Terraform; it ingests & processes data from various sources and then cascades it back to their stakeholders. There will be some backlog work to involve yourself in initially but then the focus will be on adding new features/functionalities to the platform. You will need to grasp technical details quickly, familiarising yourself with the design & architecture of any given project so you can adjust your approach to best support the customer’s requirements\\n\\', <br/>, <br/>, \\\"\\nWhat you\\'ll get in return for your experience\\n\\\", <br/>, <br/>, \\'\\nThe company offer a very relaxed & casual environment, offering flexible working hours (core day is 10am – 4pm) and plenty of scope for training & progression. As the business expands there could be scope to move into more of a lead position depending on which way you see your career going, and they encourage their employees to go on a range of training courses & tech conferences. They’re offering a generous salary, healthy pension scheme and free food in the office. It really does have the culture of a start-up but with the backing of a large international business!\\n\\', <br/>, <br/>, \\'\\nWhat next?\\n\\', <br/>, <br/>, \\\"\\nThis is a fantastic opportunity to work for an amazing company, so if you\\'re interested, send your CV to Joe ASAP or give us a call to find out more.\\\"]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4087315, "longitude": -2.5799254}}, {"title": "Senior Python Developer", "company": "Toumetis", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=f54f8cf6292107ea&fccid=1408f3873505835f&vjs=3", "description": "[<div><p>TouMetis Job Description</p><br/>\n<p></p>\n<p>\nSenior Python Developer</p><br/>\n<p></p>\n<p>\nSalary DOE</p><br/>\n<p></p>\n<p>\nAbout our Company Our mission at Toumetis is to deliver intelligence that can transform business operations and enable new revenue via the application of machine learning. We combine experience in applied machine learning, frontend development, data engineering, and cloud computing to help Fortune-1000 companies bring elegant solutions to life, surfacing unique insights to predict and prevent problems and improve organisational performance. Our engineers, developers and data scientists share a passion for innovation and are dedicated to providing our customers with solutions that enable new insights that revolutionise business processes. We have a friendly working environment with flexible hours, regular social events, great coffee and snacks, free parking, ride to work scheme, bike racks, shower facilities and you will be supplied with a MacBook Pro.</p><br/>\n<p></p>\n<p>\nJoining the Cascadence development team you will work closely with the data science team to deploy data science models. We’re building a service based architecture that gives us flexibility so that we can adapt to the requirements of each customer. We’re deploying on AWS using Docker and Terraform.</p>\n<p>\nWe’re looking for someone with roughly 3 years of professional experience with Python, an interest in data science and data visualisation is a bonus. You’ll be working in a small team of developers who are working in an Agile development process. We’re looking for someone keen to take advantage of opportunities to develop their skills and to suggest ways to improve our code and our products.</p><br/>\n<p></p>\n<p>\nIf you have good experience with any or all of our tech stack then please get in touch!</p>\n<p>\nTech we use</p>\n<ul><li>Python 3</li></ul>\n<ul><li>FastApi</li></ul>\n<ul><li>AWS</li></ul>\n<ul><li>Docker</li></ul>\n<ul><li>Terraform</li></ul>\n<ul><li>React.js (with Redux)</li></ul>\n<ul><li>Typescript</li></ul>\n<ul><li>Git</li></ul>\n<ul><li>Postgres</li></ul><br/>\n<p></p>\n<p>\nYou’ll also have access to company paid training services as we’re keen for you to grow your skills.\n<br/>\n<br/>\nFor a confidential discussion about this role, or if you feel your skillset would be of benefit to the TouMetis team but doesn’t match a specific job spec, please get in touch with our Talent Acquisition team - george.wrightson@Toumetis.com/ 07853 926 928</p></div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4470004, "longitude": -2.6086458}}, {"title": "Vulnerable Application Developer (Contract)", "company": "Immersive Labs", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=2d2b1d960d8bc910&fccid=8f8f3106603d3e52&vjs=3", "description": "[\\'Contract\\n\\', <br/>, <br/>, \\'\\nDo you enjoy building Capture the Flag (CTF) style challenges?\\n\\', <br/>, <br/>, \\'\\nCan you write web applications in various languages and understand how to improve the security of your code?\\n\\', <br/>, <br/>, \\'\\nDo you want to help others overcome coding challenges and educate people on coding vulnerabilities?\\n\\', <br/>, <br/>, \\'\\nWe are looking for engineers on a contract basis either Bristol based or remotely (with regular visits to the Bristol office) to write deliberately vulnerable web applications for Immersive Labs and help us educate developers around the world on how to fix vulnerabilities in their code and engineer more secure applications.\\n\\', <br/>, <br/>, \\'\\nThe opportunity\\n\\', <br/>, <br/>, \\\"\\nAt Immersive Labs, we\\'ve just launched our latest offering - Secure Coding. This exciting new addition to our market-leading platform teaches developers how to write secure code. We are creating labs that take our users from the basics of writing a secure application avoiding the standard OWASP pitfalls through to building secure public cloud-hosted web apps.\\n\\\", <br/>, <br/>, \\'\\nThe first set of secure coding labs are live and loved by our users, we are now looking to expand our offering to drive this forward!\\n\\', <br/>, <br/>, \\'\\n\\', <b>Your main responsibilities:</b>, <br/>, \\'\\n\\', <ul>\n<li>Develop deliberately vulnerable applications</li>\n<li>Develop a set of resources to help users understand the vulnerabilities for each lab and how to mitigate them</li>\n<li>Develop an automated set of tests that can verify that the user has fixed a given vulnerability</li>\n<li>Plan, write, test and improve secure coding labs in the Immersive Labs platform</li>\n<li>Understand the learning process for software developers to challenge and teach them through Immersive Labs</li>\n</ul>, \\'\\n\\', <b>To be successful:</b>, <br/>, \\'\\n\\', <ul>\n<li>Software Development experience across one or all of the following languages: PHP, Java, Rails</li>\n<li>Some experience developing in HTML/CSS, JavaScript and Python would be beneficial</li>\n<li>Deep and demonstrable understanding of developing secure software</li>\n<li>An understanding of the OWASP Top 10 Web application security risks, and other historic, prevalent or emerging application security risks</li>\n<li>Experience writing theory and online learning content about programming, secure coding, IT/Computing and/or Cyber</li>\n<li>Familiarity with Linux and Docker would be beneficial</li>\n</ul>, \\'\\nFind out more at https://www.immersivelabs.com/careers/\\n\\', <br/>, <br/>, \\'\\nHelp change the face of cybersecurity, apply now!\\']", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4531476, "longitude": -2.5912439}}, {"title": "Software Developer Trainer", "company": "Mayden", "raw_location": "Bath", "raw_salary": "\n£30,000 - £50,000 a year", "min_salary": 30000.0, "max_salary": 50000.0, "mid_salary": 40000.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=f82f8cd0cf14dfe3&fccid=c3c454cd2a9999ad&vjs=3", "description": "[<div><p><b>Salary: </b>£30,000 - £50,000<br/>\n</p><p><b>\nLocation: </b>Bath<br/>\n</p><p>\nAre you an enthusiastic programmer looking for a new challenge? Come and work with us to help change people’s lives!</p>\n<p>\nWe run a 16 week coding course which turns newbies into junior developers, then get them great jobs which we know they’ll love. As an Academy trainer you’ll mainly focus on teaching – being a coach, mentor and trainer for your students while they learn the skills that will start their new careers.</p>\n<p>\nOutside of course times, you’ll work with the other trainers to update the curriculum, develop new workshops, assess student applications, run coding sessions for schools and events, deliver bespoke training for tech companies, and work with our hiring partners to find great jobs for your students after they graduate.</p>\n<p>\nAll of our trainers are given their own training, shadowing on the full 16 week Full Stack Track before they begin with their own class. So don’t worry if you’ve never taught before, or don’t know our exact stack. We’ll support you.</p>\n<p>\nThe most important thing is that you’ve got real world experience as a programmer, and want to do something a bit different to help give people a new start in life.</p>\n<p><b>\nAbout you</b></p>\n<p>\nYou’ll have worked as a professional software developer for at least a couple of years, with experience on real client projects. You will have helped support your team with difficult problems and be happy helping junior developers. You will have skills in OOP and be comfortable programming for the web with a back-end language, working with current industry standard technologies.</p>\n<p>\nYou will have experience with a range of development tools as well as experience of methodologies such as agile, pair programming and code reviews.</p>\n<p>\nWe’re not concerned with what language/s you use, as long as you have the experience and are happy to learn our own languages (PHP, Node.js and Javascript).</p>\n<p>\nIt doesn’t matter whether you use C, C++, C#, Ruby, Java, Python, Go, Swift or anything else – the most important thing is that you’re a friendly, motivated team player who wants to help people. We’re all about changing lives, and hope you are too.</p>\n<p><b>\nAbout us</b></p>\n<p>\nWe are all about people. We train people of all ages and backgrounds to code, giving them everything they need to know to land their first job as a junior software developer. We work hard to make sure our course is as inclusive as possible, and help to make positive change in the tech industry. Our graduates consistently tell us that their time at the Academy was one of the best in their lives.</p>\n<p>\nOur small classes mean you’ll get to know your students really well, and you’ll be part of a welcoming and fun team.</p>\n<p>\nOur offices are based in a historic building in beautiful Bath. It’s a 10 minute walk from the train station, with incredible views over the city and a lovely big garden. We’ve got break-out rooms with comfy sofas, books, board games and Mario Kart, and a big kitchen with tea, coffee, toast and fruit.</p>\n<p>\nWe pride ourselves on having created a happy place to work with a strong sense of value and purpose. You’ll be working alongside award-winning trainers and mentors in a team of people who love what they do. And you’ll be making a genuine difference to people’s lives.</p>\n<p>\nInterested?</p>\n<p>\nJust send a CV and a cover letter saying why you’d like to work with us. We’d love to hear from you.</p>\n<p>\nMust be eligible to live and work in the UK.</p>\n<p><b>\nSalary: £30-50k Plus Benefits</b></p>\n<p><b>\nSTRICTLY NO AGENCIES</b></p></div>, <p></p>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.3740822, "longitude": -2.3785498}}, {"title": "Software Developer Trainer - Mayden Academy", "company": "Mayden", "raw_location": "Bath", "raw_salary": "\n£30,000 - £50,000 a year", "min_salary": 30000.0, "max_salary": 50000.0, "mid_salary": 40000.0, "detail_url": "http://www.indeed.co.uk/company/Mayden/jobs/Software-Developer-Trainer-dfedd1c031d61796?fccid=2d4c73d1e68cf818&vjs=3", "description": "[<p><b>Software developer trainer</b></p>, <p><b>Are you an enthusiastic programmer looking for a new challenge? Come and work with us to help change people’s lives!</b></p>, <p><b>We run a 16 week coding course which turns newbies into junior developers, then get them great jobs which we know they’ll love. As an Academy trainer you’ll mainly focus on teaching - being a coach, mentor and trainer for your students while they learn the skills that will start their new careers.</b></p>, <p><b>Outside of course times, you’ll work with the other trainers to update the curriculum, develop new workshops, assess student applications, run coding sessions for schools and events, deliver bespoke training for tech companies, and work with our hiring partners to find great jobs for your students after they graduate.</b></p>, <p><b>All of our trainers are given their own training, shadowing on the full 16 week Full Stack Track before they begin with their own class. So don’t worry if you’ve never taught before, or don’t know our exact stack. We’ll support you. </b></p>, <p><b>The most important thing is that you’ve got real world experience as a programmer, and want to do something a bit different to help give people a new start in life.</b></p>, <p><b>About you</b></p>, <p><b>You’ll have worked as a professional software developer for at least a couple of years, with experience on real client projects. You will have helped support your team with difficult problems and be happy helping junior developers. You will have skills in OOP and be comfortable programming for the web with a back-end language, working with current industry standard technologies. </b></p>, <p><b>You will have experience with a range of development tools as well as experience of methodologies such as agile, pair programming and code reviews.</b></p>, <p><b>We’re not concerned with what language/s you use, as long as you have the experience and are happy to learn our own languages (PHP, Node.js and Javascript). </b></p>, <p><b>It doesn’t matter whether you use C, C++, C#, Ruby, Java, Python, Go, Swift or anything else – the most important thing is that you’re a friendly, motivated team player who wants to help people. We’re all about changing lives, and hope you are too. </b></p>, <p><b>About us</b></p>, <p><b>We are all about people. We train people of all ages and backgrounds to code, giving them everything they need to know to land their first job as a junior software developer. We work hard to make sure our course is as inclusive as possible, and help to make positive change in the tech industry. Our graduates consistently tell us that their time at the Academy was one of the best in their lives. </b></p>, <p><b>Our small classes mean you’ll get to know your students really well, and you’ll be part of a welcoming and fun team.</b></p>, <p><b>Our offices are based in a historic building in beautiful Bath. It’s a 10 minute walk from the train station, with incredible views over the city and a lovely big garden. We’ve got break-out rooms with comfy sofas, books, board games and Mario Kart, and a big kitchen with tea, coffee, toast and fruit.</b></p>, <p><b>We pride ourselves on having created a happy place to work with a strong sense of value and purpose. You’ll be working alongside award-winning trainers and mentors in a team of people who love what they do. And you’ll be making a genuine difference to people’s lives.</b></p>, <p><b>Interested?</b></p>, <p><b>Just send a CV and a cover letter saying why you’d like to work with us. We’d love to hear from you.</b></p>, <p><b>Must be eligible to live and work in the UK.</b></p>, <p><b>Salary: Competitive DOE Plus Benefits</b></p>, <p><b>STRICTLY NO AGENCIES</b></p>, <p>Job Types: Full-time, Permanent</p>, <p>Salary: £30,000.00 to £50,000.00 /year</p>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.3740822, "longitude": -2.3785498}}, {"title": "Node JS Full Stack Developer", "company": "Ignite Digital", "raw_location": "Bristol", "raw_salary": "\n£45,000 a year", "min_salary": 45000.0, "max_salary": 45000.0, "mid_salary": 45000.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=540c9fbefa8b0c41&fccid=0c51e1b4ac484e43&vjs=3", "description": "[<div><h2 class=\\\"jobSectionHeader\\\"><b>Full Stack Developer (Node JS)</b></h2>\n<br/>\nA small &amp; dynamic product and services company based in North Bristol who have a focus on the defence and security sectors are actively seeking an experienced full stack developer to help produce scalable software solutions within a small deployment team.<br/>\n<br/>\nThey are looking for a developer who is comfortable amongst both front-end and back-end coding languages, development frameworks and third-party libraries - ideally a candidate who also does have a knack for detailed, visual design and utility.<br/>\n<br/>\n<b>Day To Day</b><br/>\n<br/>\n. Working alongside engineering teams and PM\\'s to ideate software solutions<br/>\n. Designing client-side and server-side architecture<br/>\n. Write effective API\\'s<br/>\n. Test software to ensure responsiveness and efficiency<br/>\n. Troubleshoot, debug and upgrade software<br/>\n. Create security and data protection settings<br/>\n. Build features and applications with a mobile responsive design<br/>\n. Write technical documentation<br/>\n. Work with engineering and capability delivery to improve software<br/>\n. Work out of our clients Bristol office but occasional on-site engagements within the UK and abroad and also WFH options available<br/>\n<br/>\n<b>Experience</b><br/>\n<br/>\n. Proven experience as full stack developer<br/>\n. Desktop and mobile experience<br/>\n. Familiarity with the TICK stack (Telegraf, InfluxDB, Chronograf and Kapacitor)<br/>\n. HTML, CSS, JavaScript, XML, jQuery<br/>\n. Experience of front end libraries such as Vue, Bootstrap, ReactJS, Angular<br/>\n. Strong Node JS experience and knowledge of Python<br/>\n. API\\'s<br/>\n. MySQL, MongoDB<br/>\n<br/>\n<b>Culture</b><br/>\n<br/>\n. Tech and process driven<br/>\n. Innovative and inquisitive thinking<br/>\n. Flexible, friendly and fun but driven to making the business a success<br/>\n<br/>\n<b>On Application</b><br/>\n<br/>\n. Applicants must be entitled work in the UK<br/>\n. Applicants must be willing to be security vetted</div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.44805239999999, "longitude": -2.5822392}}, {"title": "Data Architect", "company": "Elenor Consulting Limited", "raw_location": "Bristol", "raw_salary": "\n£38,000 a year", "min_salary": 38000.0, "max_salary": 38000.0, "mid_salary": 38000.0, "detail_url": "http://www.indeed.co.uk/company/Elenor-Consulting-Limited/jobs/Data-Architect-277ff5129ab6631f?fccid=a1dd5de0a1bed61d&vjs=3", "description": "[<p>Data Artichet – BigData, Python, Java, Scala, AWS, Kafka, RabbitMQ, Elasticsearch, Spark –</p>, <p>A leading AI software house, based in Bristol, are seeking a Data Architect to join their innovative, data team and work closely with Data Scientists, Analysts, developers, Product etc in an Agile Lean environment.</p>, <p>The successful Data Architect , will be part of a team and participate in technology decisions whilst building scalable, complex data driven models/features in a range of different languages such as Python, Java, Scala along with AWS, Cloudformation, DynamoDB, Druid, Kafka, Elasticsearch, Spark, Airflow etc.</p>, <p>Job Types: Full-time, Permanent</p>, <p>Salary: £38,000.00 /year</p>, <p>Experience:</p>, <ul><li>ETL: 7 years (Preferred)</li></ul>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.454513, "longitude": -2.58791}}, {"title": "Python/ Go Developer £40-60k", "company": "Headforwards", "raw_location": "South West", "raw_salary": "\n£40,000 - £60,000 a year", "min_salary": 40000.0, "max_salary": 60000.0, "mid_salary": 50000.0, "detail_url": "http://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0DuHDjNWw39SJ5e6sYpMBsA1c0MQ32LDXTWEMHTY-Wt9ZQzCHqjxt7ZbJTKCx1V4ZVW3A1qpVUyL8QXEoJ4hRVCx1OkQ-efXv4ZkL56kDwdfFnW1kvWN3Z4r7xDPB0FOGn5FWCfWiAk-dPE92itq021Z0WIkC8FCL4t1sd5Y_4svKGy4BvrkeEnIZUXWAIq9QqSIM3FoI3T07Rd4UJ1_B0_XMF-uV6iuBTLw60RQuHbiKWuNmtg7i3Ul8yuDGCf5UwJnyX8lGfQtUx_jaMeLB0e70PzTYTS0hN5OKoj8nvq0TGrgPViewOw2II6XlXGaMZOSY3o9IOG1rbHRfkNY5fzNs9a5h5gikBoeWculH9-niqPpU5EUI0l5njFJqnVrSA5vzuO3HfcbgWqY12LPijRCFUTxRZrU7lUekTaWTmZpwdyc8NA-n0xcPIQLo5-o43EVkQF9lSop8rCRdM7M_9e0MLCKvzBJpI=&p=0&fvj=1&vjs=3", "description": "[<p><b>Are you a Developer who is keen to bleed the edges of your experience?</b></p>, <p>If so, we would love to hear from you! We are looking for an experienced developer in Python and/or Go to join one of our high performing development teams. If you have good commercial experience in a similar or related language you could also fit in well.</p>, <p><b>We are offering a salary of up to £60,000 depending on experience.</b></p>, <p><b>What will you be doing? </b></p>, <ul><li>You will be joining a fast-moving development team working on the backend of a cutting-edge web application for one of the largest telecoms companies in the world, building and deploying microservices at scale, on a Kubernetes platform, with multiple global regions.</li><li>You will be using and improving our in house continuous delivery pipelines to release new features and functionality to the client.</li></ul>, <p>We are delivering multiple releases every day and working with some pretty exciting technologies alongside fully employing the use of Agile methodologies across the whole business.</p>, <p>You may currently be a Team Lead, or an Architect in your current role and looking for a new challenge.</p>, <p><b>Why work for Headforwards?</b></p>, <ul><li>We are a software development company with just over 100 people from 18 different countries and we like to have fun at work!</li><li>We are agile with a very laid back feel, a relatively flat structure and small self-organising teams of 2-7 people. We work in teams dedicated to various clients and we work on global projects with cutting edge technologies, tools and techniques.</li><li>There\\'s no pressure to work extra hours to churn out more and more code.</li><li>Our culture and environment is dedicated to making people happy at work.</li><li>We live in beautiful Cornwall, our offices are 5 miles from the beach. We want to make sure our people have a good work life balance so that they can enjoy all that Cornwall has to offer : )</li><li>We have lots of social activities and monthly learning sessions, talks and cross company communities of practice for various languages, tools and frameworks.</li></ul>, <p>This is a place where you can make a difference, work in a small team start-up feel but benefit from the support of a larger community of developers and like-minded people.</p>, <p><b>Key Personal Traits</b></p>, <ul><li>You will have been a developer for at least five years</li></ul>, <ul><li>You will have used Python or Go</li><li>You are happy to work as both a Mentor or Leader within a team, and contribute to a wider project team</li><li>We enjoy spirited exchanges of ideas, pushing us towards technical excellence and we expect to hear your voice in these conversations.</li><li>You will be a natural problem solver and able to align business delivery priories against implementation choices.</li><li>You will have the desire and ability to continually learn in improve yourself, and your colleagues.</li></ul>, <p><b>Key Technical Skills</b></p>, <ul><li>Knowledge of relational and / or non-relational (NoSQL) databases (we use MongoDB, Postgres, Redis, InfluxDB)</li><li>Experience of message queues (we use Kafka)</li><li>Experience of container orchestration (we use Kubernetes, Docker)</li><li>An operational mindset with knowledge of high availability, monitoring and diagnostics</li><li>Understanding of the web application stack</li><li>A pragmatic and practical approach to solving business problems</li><li>Exposure to test driven development and integration testing</li><li>Experience working with development team tools (e.g. continuous integration systems (we use Jenkins) and version control systems (we use Git)</li></ul>, <p><b>The closing date for this role is 31st March 2020. We recruit on a rolling basis and fill our vacancies as soon as we find people who fit our culture and meet the skills requirements. This means that whilst we have a closing date on all of our roles, we may offer the role to someone before the end date, so we recommend that you apply as soon as possible.</b></p>, <p>Job Types: Full-time, Permanent</p>, <p>Salary: £40,000.00 to £60,000.00 /year</p>, <p>Experience:</p>, <ul><li>Python: 4 years (Preferred)</li></ul>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 50.2272249, "longitude": -5.2716259}}, {"title": "Software Test Automation Lead", "company": "Graphcore", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0B2LP6KtwgLMWcIJbzQK4y118hUYa2NHT0ELzb4aR6nDrO9_32R0LtazQt5Ev9ntbM-U9_IOn7b_TGoM7EAWKBLeSVGnWrTEFUfjERxJoP4Hh6R4aVlgJovRmKkoWo9HCdK0t4bX87yeS2Zao7j9AHEJRWtF6VDq4c8sv3NMjUL7Ena4aCsTr8vkofv5KNevonFbqBWsMoVstzRQOY2Ynz13MX09GBfkH63O4tRAG9-HPCDGEWx2SKGKAGu6H792RfSSNr99rB0sHpDLd0OsC9MHRuNLEDzeuf4WVZC2pfAgMHj9bwXDJe1uFQXSP_lz3n6XTK2VSN10WZn-RwSQ8b20C3Uaq8tm4liIhHqUHfFbJrpyuNDzxLAF-IxfAC4vYZspHhZPMGtfXM79yVgAjASI6X5D9BqxXU5llemw1l-BpjGpnUvFqoc&p=1&fvj=0&vjs=3", "description": "[<div>Founded just over three years ago, Graphcore\\'s growth and impact has been little short of staggering. We believe we\\'re in a unique position as a new wave of machine learning technology begins to emerge. We see a world where technology enhances human potential and takes us into a new era of intelligence and progress that everyone can benefit from.\n<br/>\n<br/>\nWhat we can achieve over the next few years will re-shape businesses around the world.\n<br/>\n<br/>\nGraphcore has created a completely newprocessor, the Intelligence Processing Unit (IPU), specifically designed for artificial intelligence. The IPU\\'s unique architecture means developers can run current machine learning models orders of magnitude faster. More importantly, it lets AI researchers undertake entirely new types of work, not possible using current technologies, to drive the next great breakthroughs in general machine intelligence.\n<br/>\n<br/>\nWe believe our IPU technology will become the worldwide standard for artificial intelligence compute. The performance of Graphcore\\'s IPU is going to be transformative across all industries and sectors whether you are a medical researcher, roboticist or building autonomous cars.\n<br/>\n<br/>\nOur team is at the forefront of the artificial intelligence revolution, enabling innovators from all industries and sectors to expand human potential with technology. What we do, really makes a difference.\n<br/>\n<br/>\n<b>Job Description:</b>\n<br/>\n<br/>\nWe are looking for technical lead who cares deeply about the software quality and is willing to champion validation within the software organisation. Take ownership of the software quality and work closely with engineering teams to deliver outstanding products. Build and lead a talented team of software developers engaged in the construction of automated validation and data gathering tools.\n<br/>\n<br/>\nThe software integration test team is not a standard test team; it consists of talented software developers who are testing a complex stack of parallel processing tools, APIs and machine learning frameworks and models.\n<br/>\n<br/>\n<b>Responsibilities:</b>\n<br/>\n<br/>\n<ul><li>Ownership of the software quality and validation process\n</li></ul><br/>\n<ul><li>Negotiation with internal stakeholders to create a testing schedule that meets requirements and deadlines\n</li></ul><br/>\n<ul><li>Recruitment and mentoring of a team of software engineers specialising in validation and verification across Bristol, Cambridge and London\n</li></ul><br/>\n<b>Key Skills</b>\n<br/>\n<br/>\n<ul><li>A proven track record of leadership\n</li></ul><br/>\n<ul><li>Able to manage multiple changing priorities within a fast-paced environment\n</li></ul><br/>\n<ul><li>Extensive knowledge of Python and testing methodologies\n</li></ul><br/>\n<ul><li>Experience in test automation and CI/CD\n</li></ul><br/>\n<ul><li>Good experience of working with agile methods of development\n</li></ul><br/>\n<ul><li>Experience with Linux or Unix systems\n</li></ul><br/>\n<ul><li>Hold a relevant engineering degree at master\\'s or PhD level\n</li></ul><br/>\n<b>Desirable Skills:</b>\n<br/>\n<br/>\n<ul><li>Some exposure to artificial neural network\n</li></ul><br/>\n<ul><li>Some experience with C++ development\n</li></ul><br/>\n<ul><li>A good understanding of parallel processing\n</li></ul><br/>\n<ul><li>Experience with test data storage and DB management\n</li></ul><br/>\n<ul><li>Experience with cloud computation platform\n</li></ul><br/>\n<b>Benefits</b>\n<br/>\nIn addition to a competitive salary, we also offer a generous pension scheme and to support your well-being we provide health insurance, life cover and an employee assistance programme.\n<br/>\n<br/>\nOur centrally located Bristol office provides a well-stocked kitchen with healthy food, drinks and snacks and our very own barista! We have an active social scene too - from cycling, yoga, running and football right through to a board game group.\n<br/>\n<br/>\nWe welcome people of different backgrounds and experiences and are committed to building an inclusive work environment that makes Graphcore a great home for everyone. We are an equal opportunity employer and want to build a work environment where everyone is happy, productive and respectful. If you have a disability or additional need that requires accommodation, just let us know.\n<br/>\n<br/>\nPlease note, we are only considering candidates who have an established right to work in the UK for roles based in Bristol, UK</div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4552872, "longitude": -2.5923872}}, {"title": "Junior Python Developer - Trading", "company": "Client Server", "raw_location": "Bristol", "raw_salary": "\n£50,000 - £75,000 a year", "min_salary": 50000.0, "max_salary": 75000.0, "mid_salary": 62500.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=1998d35c0a752edc&fccid=892c145157842ceb&vjs=3", "description": "[<p></p>, <div><div><div>Junior Python Developer / Software Engineer (Trading C++ Linux). One of the most successful proprietary trading forms in the world is seeking a bright, ambitious Junior Python Developer to join their highly accomplished team and work on a strong pipeline of projects.\n<br/>\n<br/>\nAs a Junior Python Developer you\\'ll work on highly complex, deeply technical systems with cross-functional teams who are committed to delivering high quality software releases, business-wide exposure with the chance to benefit from their culture of curiosity and continual learning.\n<br/>\n<br/>\nThe organisation is behind one of the most powerful computing grids in the world, and has asserted its position on the global stage by combining cutting-edge technology and granular data to solve the most complex of technical problems.\n<br/>\n<br/>\nAs a Junior Python Developer, you\\'ll join the rapidly expanding Core Development sector of the business, in a highly collaborative team that designs, codes, tests and maintains the high performance distributed systems that powers their trading operation. You\\'ll work directly with a close-knit team to deploy critical features to the trading platform with the opportunity to benefit from accomplished senior colleagues.\n<br/>\n<br/>\n*Please note: this company is able to conduct an entirely remote interview process during the current circumstances*<br/>\n<br/>\nRequirements:<br/>\n<ul><li>You\\'re degree educated (2.1 or above, BSc / MSc / PhD)\n</li><li>You have strong Python coding ability\n</li><li>You have a thorough understanding of Computer Science fundamentals like OOP, Data Structures, threading models and networking\n</li><li>You\\'re naturally analytical and approach complex technical problems in a logical, thoughtful manner\n</li><li>You\\'re a positive team player who enjoys working collaboratively\n</li><li>Desirable: C++ skills\n</li></ul><br/>\nAs a Junior Python Developer you\\'ll earn a highly competitive salary (to £75k) plus bonus and a comprehensive benefits package.\n<br/>\n<br/>\nApply now or call for a confidential discussion about this Junior Python Developer / Software Engineer (Trading C++ Linux) opportunity.</div></div></div>, <p></p>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.454513, "longitude": -2.58791}}, {"title": "Entry Level GIS Professional", "company": "Geollect Limited", "raw_location": "Bristol", "raw_salary": "\n£18,000 - £22,500 a year", "min_salary": 18000.0, "max_salary": 22500.0, "mid_salary": 20250.0, "detail_url": "http://www.indeed.co.uk/company/Geollect/jobs/Entry-Level-GIS-Professional-7aa2c691079199be?fccid=9b81b6ebc61889fd&vjs=3", "description": "[<p><b>Geospatial Analyst - Entry Level</b><br/>Geollect is an agile geospatial intelligence and analysis company, providing dynamic insights for decision support to a network of global clients in the defence, maritime insurance and cruise industries. We are looking for an ambitious candidate who has a passion for GIS, loves a good challenge, and wants to be part of a rapidly growing company.</p>, <p><b>Job Description</b></p>, <p>The successful candidate will form an integral part of the geospatial analytical team, working on multiple projects across a diverse range of sectors. We are looking for someone who can embrace each challenge with enthusiasm as a team player or independently with a strong will to succeed. You will be required to analyse and interpret multiple data layers using innovative techniques to assist in the automation and quality control of Geollect\\'s suite of products. You will leverage all available datasets, including, but not limited to, satellite imagery, infrastructure data, news and social media, maritime vessel locations, third-party APIs and crowd-sourced data. The analytical team are looking for relationships in the data, patterns of life and anomalies to provide powerful insights within a comprehensive operating picture to help our clients identify operational risk and opportunities. You will also work closely with the data scientists, data engineers and web developers.</p>, <p>This opportunity is perfect for a GIS (or related subject) graduate, who wants to develop a keen understanding of how geospatial technology is applied in a commercial setting. For the right employee, this role provides the opportunity to grow into leadership positions as the company scales.</p>, <p>You are encouraged to apply even if you don\\'t meet all of the requirements below. Geollect are building a team that fit together well, and are open to a variety of skills and levels of experience. Candidates are welcome to get in touch for further information prior to application.</p>, <p><b>Required Skill Sets</b></p>, <p><i>GIS analysis qualifications</i></p>, <ul><li>ArcGIS suite of products experience</li><li>ArcGIS Online experience</li><li>Web Mapping Service (WMS) knowledge</li><li>Web Feature Service (WFS) knowledge</li><li>JSON knowledge</li><li>SQL knowledge</li><li>Data entry, conversion and maintenance</li><li>Metadata creation and editing</li><li>Portability of skills on multi-platforms</li><li>Basic understanding of programming</li></ul>, <p><i>Other qualifications</i></p>, <ul><li>Ability to work effectively from a remote location</li><li>Ability to quickly learn sector-specific information to better exploit available datasets</li><li>Apply skill sets and expertise in multiple domains</li><li>Creative thinking with attention to detail</li><li>Innovative and proactive approach to problem solving</li><li>Evidence of continued personal and professional development</li></ul>, <p><i>Desired Skillsets</i></p>, <ul><li>Programming language (Python, .Net)</li><li>Imagery exploitation training or equivalent experience</li><li>GIS workflows - model building</li><li>GIS architecture (web and desktop)</li><li>Knowledge of SAR exploitation</li><li>Ability to translate user needs to solutions</li><li>Ability to present solutions in a simplistic visual manner</li><li>Clear, concise communication skills</li><li>Customer support skills</li></ul>, <p>Benefits:</p>, <ul><li>On-site parking</li><li>Flexible working hours</li><li>Sick pay</li><li>Bonus scheme</li><li>Casual dress</li><li>Company events &amp; social hours</li></ul>, <p>Job Types: Full-time, Contract, Permanent</p>, <p>Salary: £18,000.00 to £22,500.00 /year</p>, <p>Experience:</p>, <ul><li>ArcGIS: 1 year (Preferred)</li><li>GIS: 1 year (Preferred)</li></ul>, <p>Education:</p>, <ul><li>Bachelor\\'s (Preferred)</li></ul>, <p>Location:</p>, <ul><li>Bristol, Bristol (Required)</li></ul>, <p>Language:</p>, <ul><li>English (Required)</li></ul>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.454513, "longitude": -2.58791}}, {"title": "Deals Technology - Software Developer", "company": "PwC", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=56bc499dc653280c&fccid=5e964c4afc56b180&vjs=3", "description": "[<div><p>A career in our National Operations practice, within Operations, will provide the opportunity to support our engagement teams and clients operationally by providing advice on accounting, financial reporting, and strategic business issues. In joining, you’ll help ensure a complete and relevant exchange of information among our consultants and in turn with engagement teams and clients, provide experts advice on a variety of specific topics, support engagement teams in resolving complex issues, and supporting clients and their subsidiaries in evaluating the potential impact of accounting and reporting standard setting initiatives. You’ll develop strong relationships with our engagement teams and enhance our ability to meet greater investor expectations with the challenges of an increasingly complex business environment.<br/>\n<br/>\nOur team collaborates across the PwC business lines of services to review and develop current or future operational strategies.</p><h5 class=\\\"jobSectionHeader\\\"><b>\nAbout the team</b></h5><p>\nOur Deals business is an exciting, fast-paced and an ever-growing business that focuses on deals and crisis situations for our clients. Collectively, we deal with the types of situations you hear about regularly in the news and we provide support, insight and analysis to the management, shareholders and financiers of business.</p><p>\nOur Deals practice supports clients through mergers, acquisitions and responses to financial distress. The Deals Tech team is a centre of excellence for embedding and enabling technology across our Deals practice.</p><p>\nWe help our Deals business go to market with compelling data analysis and automation technology. We are currently looking for a bright, enthusiastic, and hungry individual to help expand the reach of the team.</p><p>\nYou can expect a challenging and rewarding career that will provide you with opportunities to work with our client engagement teams along with other parts of the business. This is a fantastic opportunity to learn new technologies, further develop your skills and advance your career with the market leading employer.</p><p></p><h5 class=\\\"jobSectionHeader\\\"><b>\nAbout the role</b></h5><p>\nYou will be supporting the development and enhancement of in-house developed business software applications and business databases used across a broad range of Deals engagements. Projects will be mostly green field in nature, so you will have the opportunity to develop new solutions from the ground up and have significant input on technical direction. Your responsibilities will include but may not be limited to:</p><ul><li><p>\nCreating and upgrading bespoke applications using the .NET framework to integrate and enhance the teams business systems;</p></li><li><p>\nTesting applications and implementing fixes/code refactoring as necessary;</p></li><li><p>\nHelp to support the team’s SQL database systems;</p></li><li><p>\nAssist in the evaluation, selection, installation, configuration, maintenance, upgrade, and support of software applications within the firm;</p></li><li><p>\nProducing technical documentation; and</p></li><li><p>\nTaking part in code reviews and providing input on architectural decisions.</p></li></ul><p></p><h5 class=\\\"jobSectionHeader\\\"><b>\nRequirements</b></h5><p>\nIf you are naturally inquisitive, have an analytical mind and enjoy solving problems in a rigorous and logical manner, for a variety of different businesses then this is the role for you. Alongside other members of the team you will engage with senior members of our business and clients, helping to solve their business problems and generate value.</p><h5 class=\\\"jobSectionHeader\\\"><b>\nYou will need significant experience demonstrating a number of the following skills:</b></h5><ul><li><p>\nExceptional analytical and technical aptitude, and enjoy problem solving;</p></li><li><p>\nHave an entrepreneurial mind set and self-starter mentality, and be comfortable with a degree of ambiguity to come up with creative solutions to complex problems and develop these ideas into structured deliverable projects;</p></li><li><p>\nAn ability to work effectively on tasks, both individually and collaboratively;</p></li><li><p>\nThe ability to manage time, prioritise tasks, self-review your work and produce deliverables of a high quality under tight client deadlines in time pressured environments;</p></li><li><p>\nA strong desire to acquire and share technical knowledge with others;</p></li><li><p>\nPassion for technology and new tools and applying and developing yourself to new areas (e.g. quickly getting up to speed with tools, analytical approaches and business challenges);</p></li><li><p>\nBuild collaborative working relationships at all levels, establishing credibility both internally and externally.</p></li></ul><h5 class=\\\"jobSectionHeader\\\"><b>\nTechnical skills</b></h5><ul><li><p>\nHave experience of developing applications using the .NET framework (preferably version 4.6 and onwards) with C# and Visual Studio;</p></li><li><p>\nExperience developing ASP.NET MVC Applications;</p></li><li><p>\nExperience using version control systems, preferably Git;</p></li><li><p>\nAn understanding of the Agile development process;</p></li><li><p>\nAn understanding of cloud services such as Azure, Google Cloud and AWS;</p></li><li><p>\nGood experience of using SQL Server (writing queries, designing tables, use of stored procedures, etc);</p></li><li><p>\nExperience using a wide range of APIs; and</p></li><li><p>\nProven experience in all aspects of the Software Development Lifecycle.</p></li></ul><h5 class=\\\"jobSectionHeader\\\"><b>\nThe following skills are also desirable</b></h5><ul><li><p>\nExperience of Entity Framework</p></li><li><p>\nExperience of ADO.NET</p></li><li><p>\nExperience writing and reviewing technical documentation;</p></li><li><p>\nJavascript (jQuery, React/Angular);</p></li><li><p>\nPresentation frameworks such as Bootstrap</p></li><li><p>\nOther coding languages such as Python/VB.NET;</p></li><li><p>\nExperience working in a corporate deal environment; and</p></li><li><p>\nAn understanding of basic accounting principles.</p></li></ul><p></p><h5 class=\\\"jobSectionHeader\\\"><b>\nLocation</b></h5><p>\nThis position is based in our Bristol office, located just near Temple Meads train station.</p><br/>\n<p><b>\nDeals</b></p>\n<p>\nOur Deals business is an exciting, fast-paced and an ever-growing business that focuses on deals and crisis situations for our clients. Collectively, we deal with the types of situations you hear about regularly in the news and we provide support, insight and analysis to the management, shareholders and financiers of business.\n</p><p><b>Not the role for you?</b></p>\n<p>\nDid you know PwC offer flexible contract arrangements as well as contingent work ( ie temporary or day rate contracting)?</p>\n<p><b>\nThe skills we look for in future employees</b></p>\n<p>\nAll our people need to demonstrate the skills and behaviours that support us in delivering our business strategy. This is important to the work we do for our business, and our clients. These skills and behaviours make up our global leadership framework, ‘The PwC Professional’ and are made up of five core attributes; whole leadership, technical capabilities, business acumen, global acumen and relationships.\n</p><p>Learn more here www.pwc.com/uk/careers/experienced/apply</p>\n<p><b>\nDiversity</b></p>\n<p>\nWe work in a changing world which offers great opportunities for people with diverse backgrounds and experiences. We seek to attract and employ the best people from the widest talent pool, as well as those who reflect the diverse nature of our society. And we aim to encourage a culture where people can be themselves and be valued for their strengths. Creating value through diversity is what makes us strong as a business and as an organisation with an increasingly agile workforce, we\\'re open to flexible working arrangements where appropriate.</p></div>, <p></p>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.45171, "longitude": -2.579683}}, {"title": "Backend Developer (Python)", "company": "Chronomics", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=128236f9aae020a8&fccid=be1fa4c3e40ce18e&vjs=3", "description": "[\\'Our mission\\n\\', <br/>, <br/>, \\'\\nWant to make a difference in this world and work on something meaningful? At Chronomics we enable people to quantify how their environment and lifestyle is affecting their health to live healthier and happier lives… all from their DNA. We will love you because…\\n\\', <br/>, \\'You’re an expert coder in at least 1 language (Python/PHP/Node.js).\\n\\', <br/>, \\'You have a product mindset and understand creating value, not features.\\n\\', <br/>, \\\"And most of all you\\'r enthusiastic and get shit done. Working in a product focused cross functional team alongside other developers, designers, data scientists and bioinformaticians you will take ownership of projects and get to work on a cutting edge microservice architecture using serverless working with HUGE data (each DNA sample is 100GB…) to build a ground breaking epigenetics platform which is the first of its kind in the world. We built to ship, we ship fast and then we learn and iterate. With a can-do attitude and a strong product mentality you are happy to jump in and get your hands dirty which could be anything from learning GO, building a Lambda microservice or optimizing an AWS pipeline. You will get the chance to work with numerous different technologies, have a say in how we drive the company forward and learn a ton of science along the way. Essential skills:\\n\\\", <br/>, <br/>, \\'\\nCan write secure, scalable, readable code in at least one or two languages\\n\\', <br/>, \\'Experience designing and scaling databases\\n\\', <br/>, \\'Designing, building, consuming AND documenting REST APIs\\n\\', <br/>, \\'Cloud platforms (AWS)\\n\\', <br/>, \\'Happy on the command line\\n\\', <br/>, \\'Agile development\\n\\', <br/>, \\'Test automation\\n\\', <br/>, \\'Familiarity with mobile and web development\\n\\', <br/>, <ul>\n<li>Work as part of a focused team, but at the same time self-driven and able to work independently Nice to have:</li>\n</ul>, \\'\\nSome dev ops (CI/CD/Docker)\\n\\', <br/>, \\'Infrastructure as code (Terraform/CloudFormation)\\n\\', <br/>, \\'Experience with other languages such as Python/JavaScript (React/Node) etc\\n\\', <br/>, \\'Serverless experience\\n\\', <br/>, \\'Experience with big data\\n\\', <br/>, \\'Experience working on high scalability websites\\n\\', <br/>, \\'Have worked with genetics data\\n\\', <br/>, \\'Experience with serverless and microservices architecture\\n\\', <br/>, \\'Graph Databases\\n\\', <br/>, <b>Location:</b>, \\' Bristol, London, Cambridge or part remote Start date: 1st Jan 2020 onwards Company size: 10-20 people Company type: VC funded\\n\\', <br/>, <br/>, \\'\\nBenefits\\n\\', <br/>, <br/>, \\'\\nShare options so early contributors benefit from our success.\\n\\', <br/>, \\'Epigenetic test!!\\n\\', <br/>, \\'Flexible office or home working.\\n\\', <br/>, \\'Macbook pro\\n\\', <br/>, \\'Friday pub sessions.\\n\\', <br/>, \\'About Us\\n\\', <br/>, <br/>, \\'\\nChronomics is an ambitious health tech start-up that believes people should be in charge of their own health. Health management should be proactive, not reactive and it should be personalised. We are using longitudinal biological data to bring about this revolution. A revolution where not only will people be in control of their own future but also in control of how they contribute to the future of humanity through the use of their data.\\n\\', <br/>, <br/>, \\\"\\nThis product is just the first step towards a platform technology that will serve as the interface between the biological and digital world. It\\'s an incredibly exciting time to come on board where you can really make a difference. Find out more at www.chronomics.com\\\"]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.5166006, "longitude": -0.2254268}}, {"title": "Data Scientist", "company": "Toumetis", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=bad349f4892ea944&fccid=1408f3873505835f&vjs=3", "description": "[<div><p>Toumetis Job Description</p><br/>\n<p></p>\n<p>\nData Scientist</p><br/>\n<p></p>\n<p>\nSalary DOE</p><br/>\n<p></p>\n<p>\nAbout our Company - Our mission at Toumetis is to deliver intelligence that can transform business operations and enable new revenue via the application of machine learning. We combine experience in applied machine learning, frontend development, data engineering, and cloud computing to help Fortune-1000 companies bring elegant IoT solutions to life, surfacing unique insights to predict and prevent problems and improve organisational performance. Our engineers, developers and data scientists share a passion for innovation and are dedicated to providing our customers with solutions that enable new insights that revolutionise business processes. We have a friendly working environment with flexible hours, regular social events, great coffee and snacks, free parking, ride to work scheme, bike racks, shower facilities and you will be supplied with a MacBook Pro.</p><br/>\n<p></p>\n<p>\nThe ideal candidate will have several years experience working commercially as a Data Scientist, with a keen interest to apply data science and machine learning working in client facing roles. You will be a key member of fast paced teams. Working alongside data engineers, front end developers and UX designers, you will be tasked with getting your algorithms into production on our real time analytics platform. You should be open to learning and using data science techniques on other applications.</p><br/>\n<p></p>\n<p>\nResponsibilities / Job Role</p>\n<ul>\n<li>Gaining a detailed understanding of client business issues.</li>\n<li>Exploratory data analysis.</li>\n<li>Cleaning, transforming and fusing large raw data sets.</li>\n<li>Model development and performance evaluation.</li>\n<li>Deploying models in production environments.</li>\n<li>Continuous evaluation and improvement of models in production.</li>\n<li>Keeping up to date with the latest tools, methods &amp; technologies</li><br/>\n</ul><p></p>\n<p>\nKey Skills / Experience</p>\n<ul>\n<li>Knowledge of python for data analysis and machine learning (pandas, numpy, scikit-learn, tensorflow, keras, etc.).</li>\n<li>Demonstrable machine learning experience (supervised/unsupervised) such as developing and deploying deep learning solutions relating to time series, NLP, video, and images.</li>\n<li>Knowledge in visualizing and presenting complex data and information.</li>\n<li>Exposure to working with large, complex and messy data sets.</li>\n<li>Capability to communicate complex concepts and data patterns to non-technical audiences.</li>\n<li>Experience or an interest to work in cloud-based development, test &amp; production environments.</li>\n</ul>\n<p>You’ll also have access to company paid training services as we’re keen for you to grow your skills.</p></div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4470004, "longitude": -2.6086458}}, {"title": "Software Developer Trainer", "company": "Mayden", "raw_location": "Bath", "raw_salary": "\n£30,000 - £50,000 a year", "min_salary": 30000.0, "max_salary": 50000.0, "mid_salary": 40000.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=f82f8cd0cf14dfe3&fccid=c3c454cd2a9999ad&vjs=3", "description": "[<div><p><b>Salary: </b>£30,000 - £50,000<br/>\n</p><p><b>\nLocation: </b>Bath<br/>\n</p><p>\nAre you an enthusiastic programmer looking for a new challenge? Come and work with us to help change people’s lives!</p>\n<p>\nWe run a 16 week coding course which turns newbies into junior developers, then get them great jobs which we know they’ll love. As an Academy trainer you’ll mainly focus on teaching – being a coach, mentor and trainer for your students while they learn the skills that will start their new careers.</p>\n<p>\nOutside of course times, you’ll work with the other trainers to update the curriculum, develop new workshops, assess student applications, run coding sessions for schools and events, deliver bespoke training for tech companies, and work with our hiring partners to find great jobs for your students after they graduate.</p>\n<p>\nAll of our trainers are given their own training, shadowing on the full 16 week Full Stack Track before they begin with their own class. So don’t worry if you’ve never taught before, or don’t know our exact stack. We’ll support you.</p>\n<p>\nThe most important thing is that you’ve got real world experience as a programmer, and want to do something a bit different to help give people a new start in life.</p>\n<p><b>\nAbout you</b></p>\n<p>\nYou’ll have worked as a professional software developer for at least a couple of years, with experience on real client projects. You will have helped support your team with difficult problems and be happy helping junior developers. You will have skills in OOP and be comfortable programming for the web with a back-end language, working with current industry standard technologies.</p>\n<p>\nYou will have experience with a range of development tools as well as experience of methodologies such as agile, pair programming and code reviews.</p>\n<p>\nWe’re not concerned with what language/s you use, as long as you have the experience and are happy to learn our own languages (PHP, Node.js and Javascript).</p>\n<p>\nIt doesn’t matter whether you use C, C++, C#, Ruby, Java, Python, Go, Swift or anything else – the most important thing is that you’re a friendly, motivated team player who wants to help people. We’re all about changing lives, and hope you are too.</p>\n<p><b>\nAbout us</b></p>\n<p>\nWe are all about people. We train people of all ages and backgrounds to code, giving them everything they need to know to land their first job as a junior software developer. We work hard to make sure our course is as inclusive as possible, and help to make positive change in the tech industry. Our graduates consistently tell us that their time at the Academy was one of the best in their lives.</p>\n<p>\nOur small classes mean you’ll get to know your students really well, and you’ll be part of a welcoming and fun team.</p>\n<p>\nOur offices are based in a historic building in beautiful Bath. It’s a 10 minute walk from the train station, with incredible views over the city and a lovely big garden. We’ve got break-out rooms with comfy sofas, books, board games and Mario Kart, and a big kitchen with tea, coffee, toast and fruit.</p>\n<p>\nWe pride ourselves on having created a happy place to work with a strong sense of value and purpose. You’ll be working alongside award-winning trainers and mentors in a team of people who love what they do. And you’ll be making a genuine difference to people’s lives.</p>\n<p>\nInterested?</p>\n<p>\nJust send a CV and a cover letter saying why you’d like to work with us. We’d love to hear from you.</p>\n<p>\nMust be eligible to live and work in the UK.</p>\n<p><b>\nSalary: £30-50k Plus Benefits</b></p>\n<p><b>\nSTRICTLY NO AGENCIES</b></p></div>, <p></p>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.3740822, "longitude": -2.3785498}}, {"title": "C++ Developer - Technologist", "company": "Client Server", "raw_location": "Bristol", "raw_salary": "\n£28,000 - £35,000 a year", "min_salary": 28000.0, "max_salary": 35000.0, "mid_salary": 31500.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=8cb72e2d13039ea3&fccid=892c145157842ceb&vjs=3", "description": "[<p></p>, <div><div><div>C++ Developer / Software Engineer (C++ Python Java SPARK). Are you a skilled, passionate technologist looking for an opportunity to support the global operation of a trailblazing tech start up? You could join a 120-strong, international team of exceptional engineers and will play a key role in developing bleeding edge technologies to meet the highest grade of open-source software development.<br/>\n<br/>\nThe company specialises in secure, reliable applications cover industries; from avionics, aerospace and defence to medical and energy, their advanced technologies are industry leading across the world. In this C++ Developer role, you\\'ll work directly on the language library for code intelligence for their proprietary programming language, and developing tools and libraries to support it.<br/>\n<br/>\nAs a C++ Developer you\\'ll have an extraordinary chance to develop your technical skills using cutting-edge technologies Libadalang, SPARK and Python, in conjunction with refining your craft on more traditional languages like C++ and Java. There will be a continuous, strong pipeline of projects to choose from, and will be supported to learn in a culture based on curiosity.<br/>\n<br/>\nYou\\'ll be based in brand new offices in Bristol, (a short walk from transport links) where you can enjoy great facilities, as well cake on Wednesday\\'s and drinks on Fridays in a highly inclusive team atmosphere. You\\'ll also have access to regular training opportunities, including the chance to travel to the New York and Paris offices, and a 3 day, company-wide gathering in Summer.<br/>\n<br/>\nRequirements:<br/>\n<ul><li>You have experience working with one or more high-level programming language (C++ / Java / Python)</li><li>You\\'re degree educated (2.1 or above, BSc / MSc / PhD)</li><li>You have a strong understanding of Computer Science fundamentals</li><li>You have knowledge of / interest in compilation / programming language analysis (demonstrable experience, even in form of university projects is highly beneficial)</li><li>You\\'re a confident, self-assured communicator who works well independently / is a key contributor in a team</li></ul>\n<br/>\nAs a C++ Developer you\\'ll earn a highly competitive salary (to £35k) plus a profits-based bonus and a comprehensive benefits package, including a generous holiday allowance, pension, private dental and healthcare and more.<br/>\n<br/>\nIf you\\'re interested in this C++ Developer / Software Engineer (C++ Python Java SPARK) role, apply now or get in touch today to find out more.</div></div></div>, <p></p>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.454513, "longitude": -2.58791}}, {"title": "Deals Technology - Software Developer - Senior Associate", "company": "PwC", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=3f66a58e473d972c&fccid=5e964c4afc56b180&vjs=3", "description": "[<div><p>A career in our National Operations practice, within Operations, will provide the opportunity to support our engagement teams and clients operationally by providing advice on accounting, financial reporting, and strategic business issues. In joining, you’ll help ensure a complete and relevant exchange of information among our consultants and in turn with engagement teams and clients, provide experts advice on a variety of specific topics, support engagement teams in resolving complex issues, and supporting clients and their subsidiaries in evaluating the potential impact of accounting and reporting standard setting initiatives. You’ll develop strong relationships with our engagement teams and enhance our ability to meet greater investor expectations with the challenges of an increasingly complex business environment.<br/>\n<br/>\nOur team collaborates across the PwC business lines of services to review and develop current or future operational strategies.</p><h5 class=\\\"jobSectionHeader\\\"><b>\nAbout the team</b></h5><p>\nOur Deals business is an exciting, fast-paced and an ever-growing business that focuses on deals and crisis situations for our clients. Collectively, we deal with the types of situations you hear about regularly in the news and we provide support, insight and analysis to the management, shareholders and financiers of business.</p><p>\nOur Deals practice supports clients through mergers, acquisitions and responses to financial distress. The Deals Tech team is a centre of excellence for embedding and enabling technology across our Deals practice.</p><p>\nWe help our Deals business go to market with compelling data analysis and automation technology. We are currently looking for a bright, enthusiastic, and hungry individual to help expand the reach of the team.</p><p>\nYou can expect a challenging and rewarding career that will provide you with opportunities to work with our client engagement teams along with other parts of the business. This is a fantastic opportunity to learn new technologies, further develop your skills and advance your career with the market leading employer.</p><p></p><h5 class=\\\"jobSectionHeader\\\"><b>\nAbout the role</b></h5><p>\nYou will be supporting the development and enhancement of in-house developed business software applications and business databases used across a broad range of Deals engagements. Projects will be mostly green field in nature, so you will have the opportunity to develop new solutions from the ground up and have significant input on technical direction. Your responsibilities will include but may not be limited to:</p><ul><li><p>\nCreating and upgrading bespoke applications using the .NET framework to integrate and enhance the teams business systems;</p></li><li><p>\nTesting applications and implementing fixes/code refactoring as necessary;</p></li><li><p>\nHelp to support the team’s SQL database systems;</p></li><li><p>\nAssist in the evaluation, selection, installation, configuration, maintenance, upgrade, and support of software applications within the firm;</p></li><li><p>\nProducing technical documentation; and</p></li><li><p>\nTaking part in code reviews and providing input on architectural decisions.</p></li></ul><p></p><h5 class=\\\"jobSectionHeader\\\"><b>\nRequirements</b></h5><p>\nIf you are naturally inquisitive, have an analytical mind and enjoy solving problems in a rigorous and logical manner, for a variety of different businesses then this is the role for you. Alongside other members of the team you will engage with senior members of our business and clients, helping to solve their business problems and generate value.</p><h5 class=\\\"jobSectionHeader\\\"><b>\nYou will need significant experience demonstrating a number of the following skills:</b></h5><ul><li><p>\nExceptional analytical and technical aptitude, and enjoy problem solving;</p></li><li><p>\nHave an entrepreneurial mind set and self-starter mentality, and be comfortable with a degree of ambiguity to come up with creative solutions to complex problems and develop these ideas into structured deliverable projects;</p></li><li><p>\nAn ability to work effectively on tasks, both individually and collaboratively;</p></li><li><p>\nThe ability to manage time, prioritise tasks, self-review your work and produce deliverables of a high quality under tight client deadlines in time pressured environments;</p></li><li><p>\nA strong desire to acquire and share technical knowledge with others;</p></li><li><p>\nPassion for technology and new tools and applying and developing yourself to new areas (e.g. quickly getting up to speed with tools, analytical approaches and business challenges);</p></li><li><p>\nBuild collaborative working relationships at all levels, establishing credibility both internally and externally.</p></li></ul><h5 class=\\\"jobSectionHeader\\\"><b>\nTechnical skills</b></h5><ul><li><p>\nHave experience of developing applications using the .NET framework (preferably version 4.6 and onwards) with C# and Visual Studio;</p></li><li><p>\nExperience developing ASP.NET MVC Applications;</p></li><li><p>\nExperience using version control systems, preferably Git;</p></li><li><p>\nAn understanding of the Agile development process;</p></li><li><p>\nAn understanding of cloud services such as Azure, Google Cloud and AWS;</p></li><li><p>\nGood experience of using SQL Server (writing queries, designing tables, use of stored procedures, etc);</p></li><li><p>\nExperience using a wide range of APIs; and</p></li><li><p>\nProven experience in all aspects of the Software Development Lifecycle.</p></li></ul><h5 class=\\\"jobSectionHeader\\\"><b>\nThe following skills are also desirable</b></h5><ul><li><p>\nExperience of Entity Framework</p></li><li><p>\nExperience of ADO.NET</p></li><li><p>\nExperience writing and reviewing technical documentation;</p></li><li><p>\nJavascript (jQuery, React/Angular);</p></li><li><p>\nPresentation frameworks such as Bootstrap</p></li><li><p>\nOther coding languages such as Python/VB.NET;</p></li><li><p>\nExperience working in a corporate deal environment; and</p></li><li><p>\nAn understanding of basic accounting principles.</p></li></ul><p></p><h5 class=\\\"jobSectionHeader\\\"><b>\nLocation</b></h5><p>\nThis position is based in our Bristol office, located just near Temple Meads train station.</p><br/>\n<p><b>\nDeals</b></p>\n<p>\nOur Deals business is an exciting, fast-paced and an ever-growing business that focuses on deals and crisis situations for our clients. Collectively, we deal with the types of situations you hear about regularly in the news and we provide support, insight and analysis to the management, shareholders and financiers of business.\n</p><p><b>Not the role for you?</b></p>\n<p>\nDid you know PwC offer flexible contract arrangements as well as contingent work ( ie temporary or day rate contracting)?</p>\n<p><b>\nThe skills we look for in future employees</b></p>\n<p>\nAll our people need to demonstrate the skills and behaviours that support us in delivering our business strategy. This is important to the work we do for our business, and our clients. These skills and behaviours make up our global leadership framework, ‘The PwC Professional’ and are made up of five core attributes; whole leadership, technical capabilities, business acumen, global acumen and relationships.\n</p><p>Learn more here www.pwc.com/uk/careers/experienced/apply</p>\n<p><b>\nDiversity</b></p>\n<p>\nWe work in a changing world which offers great opportunities for people with diverse backgrounds and experiences. We seek to attract and employ the best people from the widest talent pool, as well as those who reflect the diverse nature of our society. And we aim to encourage a culture where people can be themselves and be valued for their strengths. Creating value through diversity is what makes us strong as a business and as an organisation with an increasingly agile workforce, we\\'re open to flexible working arrangements where appropriate.</p>\n<p>\nLearn more here www.pwc.com/uk/diversity</p></div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.45171, "longitude": -2.579683}}, {"title": "Python Developer", "company": "Explore Group", "raw_location": "Bath", "raw_salary": "\n£25,000 - £60,000 a year", "min_salary": 25000.0, "max_salary": 60000.0, "mid_salary": 42500.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=ddd4b0b1dbdb5489&fccid=f877f9ab98439bf6&vjs=3", "description": "[\\'After being acquired by a multi-billion dollar company headquartered in America, a software development company based in Bath are looking for a number of Python Developers as they expand.\\n\\', <br/>, <br/>, \\'\\nThis company have revolutionised the retail area, by creating an in-house product that is monitored by a central server. This product has distributed networks of virtualized and containerized services, that gives the client the instruments for Cloud Management in an onsite premise. They use Python, React as well as a number of other technologies and now that they have had great success in the roll out of their product, are looking for several developers at this exciting turning point for the company.\\n\\', <br/>, \\'You will be working on both new and existing areas of the product, with a chance to use a wide range of technologies. They are looking for Fullstack Python Developers from no commercial experience upwards, where you will produce code that is clean, create test-cases for functionality as well as a multitude of other tasks, all within an office in central Bath.\\n\\', <br/>, <br/>, \\'\\n\\', <b>If you have these you could be a great fit:</b>, <br/>, \\'\\nPython experience\\n\\', <br/>, \\'React experience\\n\\', <br/>, \\'Computer Science degree (or similar)\\n\\', <br/>, <b>Now, let\\'s talk numbers:</b>, \\' £25-60k DOE\\']", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.3810641, "longitude": -2.3590167}}, {"title": "Senior Python Developer", "company": "Toumetis", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=f54f8cf6292107ea&fccid=1408f3873505835f&vjs=3", "description": "[<div><p>TouMetis Job Description</p><br/>\n<p></p>\n<p>\nSenior Python Developer</p><br/>\n<p></p>\n<p>\nSalary DOE</p><br/>\n<p></p>\n<p>\nAbout our Company Our mission at Toumetis is to deliver intelligence that can transform business operations and enable new revenue via the application of machine learning. We combine experience in applied machine learning, frontend development, data engineering, and cloud computing to help Fortune-1000 companies bring elegant solutions to life, surfacing unique insights to predict and prevent problems and improve organisational performance. Our engineers, developers and data scientists share a passion for innovation and are dedicated to providing our customers with solutions that enable new insights that revolutionise business processes. We have a friendly working environment with flexible hours, regular social events, great coffee and snacks, free parking, ride to work scheme, bike racks, shower facilities and you will be supplied with a MacBook Pro.</p><br/>\n<p></p>\n<p>\nJoining the Cascadence development team you will work closely with the data science team to deploy data science models. We’re building a service based architecture that gives us flexibility so that we can adapt to the requirements of each customer. We’re deploying on AWS using Docker and Terraform.</p>\n<p>\nWe’re looking for someone with roughly 3 years of professional experience with Python, an interest in data science and data visualisation is a bonus. You’ll be working in a small team of developers who are working in an Agile development process. We’re looking for someone keen to take advantage of opportunities to develop their skills and to suggest ways to improve our code and our products.</p><br/>\n<p></p>\n<p>\nIf you have good experience with any or all of our tech stack then please get in touch!</p>\n<p>\nTech we use</p>\n<ul><li>Python 3</li></ul>\n<ul><li>FastApi</li></ul>\n<ul><li>AWS</li></ul>\n<ul><li>Docker</li></ul>\n<ul><li>Terraform</li></ul>\n<ul><li>React.js (with Redux)</li></ul>\n<ul><li>Typescript</li></ul>\n<ul><li>Git</li></ul>\n<ul><li>Postgres</li></ul><br/>\n<p></p>\n<p>\nYou’ll also have access to company paid training services as we’re keen for you to grow your skills.\n<br/>\n<br/>\nFor a confidential discussion about this role, or if you feel your skillset would be of benefit to the TouMetis team but doesn’t match a specific job spec, please get in touch with our Talent Acquisition team - george.wrightson@Toumetis.com/ 07853 926 928</p></div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4470004, "longitude": -2.6086458}}, {"title": "(Senior) DevOps Engineer (m/f/x) Linux (relocated to Germany)", "company": "Avira Operations GmbH & Co. KG", "raw_location": "United Kingdom", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0DVAdzec4bw6rQ4FO3PDdwz3gCZ43d7Gsr17jnu3o1g5JTNhwfE3RbVqb1qOUCNPvmqfeRlxIK638MJTb_r-nVqv0JV8YUUAU7nHtcgYd74oFFqM7IYikTWrK7B6pNT26Yny_EYJXsRP34XuN0tvew9m4sph7-FLubkn_EVVb3j6ZX7aoq79tpqrGfDfQlU2MU9BRUwCG6Bv5HcdGtt2B9xA-R7Ix12cYodKzwi_qPyv1WCMGQKXLtqwiLUVW_pQSaYdOShUxsvAxWi_0HPY97QPMH1n4vM6wTvx59zbZDm8aX2nHGxYoWKOmbsC2WWKULoSS-FBfFlMMIQMbQs8Nn52VSAyoQ9J3ywc5-fvymcEIaFTtA5cIPjz9c8unZNxes4VJIsfHWW-VMsRrLvQlYjeooTczMlJfdP1DYvFi7icA==&p=12&fvj=0&vjs=3", "description": "[<div><b>(Senior) DevOps Engineer (m/f/x) Linux</b><br/>\n<br/>\n<b>The Challenge</b><br/>\nYou will be part of the Development and Operations Team at Avira which operates various engineering services for development teams worldwide. Your main task will be to ensure the functionality, reliability and further development of Avira’s CI/CD tool stack. You will be closely working together with development teams to find sustainable and innovative solutions for our services. This includes version control, build processes and our testing platform, as well as signing solutions, the upload of our products and much more.<br/>\n<br/>\n<b>The Team</b><br/>\nYou will join a team of currently four experienced software developers and DevOps engineers, who are strongly convinced by the agile approach. In our team we value open communication and honest feedback. We strive to find generic and automated solutions for the challenges we face. Our success is measured by the quality and reliability of the services we provide.<br/>\n<br/>\nThe team is located in Tettnang, Germany.<br/>\n<br/>\n<b>What you will do</b><br/>\n<ul><li>You will mainly use Python and Bash</li><li>You will operating parts of our Atlassian Tool Stack (Bamboo and Bitbucket) and other state of the art platforms like Jfrog Artifactory and HashiCorp Vault</li><li>You will be responsible for the operation and further development of our internal tool stack (e.g. Testing Platform, Bamboo PlugIns)</li><li>You will setup, deploy and maintain our mostly Linux based infrastructure</li><li>You will work with various virtualization and cloud technologies</li><li>You will work with configuration management software</li><li>You will focus on getting things done</li><li>Experiences in other languages are welcome or you should be willing to learn new languages if needed (e.g. Java)</li></ul><br/>\n<b>\nBenefits and perks:</b><br/>\n<ul><li>New Work</li></ul>\nStylish building with roof terraces<br/>\nCanteen and ChocaVira<br/>\nModern office concept<br/>\n<br/>\n<ul><li><b>Learning &amp; Development</b></li></ul>\nUnlimited access to Udemy<br/>\nTrainings &amp; Conferences<br/>\nSpecialist Career<br/>\n<br/>\n<ul><li><b>Health &amp; Wellbeing</b></li></ul>\nGym and fitness courses<br/>\n“JobRad” bike leasing<br/>\nMedical checkups<br/>\n<br/>\n<ul><li><b>Family &amp; Living</b></li></ul>\nRelocation Package<br/>\nVacation child care<br/>\nAvira Prime licences<br/>\n<br/>\n<ul><li><b>Events</b></li></ul>\nOnboarding events<br/>\nMonthly Employee Meetings<br/>\nSummer &amp; Christmas parties<br/>\n<br/>\nLocation: Tettnang<br/>\n<br/>\nAN OPPORTUNITY TO MAKE A DIFFERENCE<br/>\n<br/>\nWe’re an international software company at the forefront of imagining the future of digital security. Avira’s award-winning products and technology protect over 500 million users in the connected world.<br/>\n<br/>\nWhat makes us special? First and foremost – it’s the authentic people at Avira. We have a great community feeling that fosters your uniqueness and offers the space to reflect, the feedback to grow, and the freedom to innovate. If you are looking for a culture that also encourages aspiration and professional excellence, get in touch with us and discover the Avira experience firsthand.<br/>\n<br/>\nLena Komarek<br/>\nHR Recruiter<br/>\nAvira Operations GmbH &amp; Co. KG<br/>\nKaplaneiweg 1<br/>\n88069 Tettnang<br/>\nD: +49 7542-500 2207<br/>\nT: +49 7542-500 0</div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.454513, "longitude": -2.58791}}, {"title": "Full Stack Applications Developer", "company": "Graphcore", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0B2LP6KtwgLMWcIJbzQK4y118hUYa2NHT0ELzb4aR6nDrO9_32R0LtazQt5Ev9ntbMF67x-uIqCFBIaSgF3Jr_RlBZttv17jHoO36gbiKCViwKMlso9PTYyZrCltqyWFf2M33tYYDFxulDCuG005fjA9bOKTyD0CWzIrw-icr-yXLfhPLS2Ws0X5jpQXJNw6_x0bl_yRANmKd_pHdzkLcGtCgBJI8c3z5-l1HdDkiY4UMqeq8jqv-Mpl_UIHGdKpI4nbB7nQzen8X4fnbhCIUiJMU4XV0elBursqSrfKZiAsnGz8Ld9pLU5WirFyzW9OqOsxNz1kb8854Dsxd41iB0GCLrDp6154gPG8eAL_m71WFbNNmcH7QIQg1XUnv2LI6LujJaSr9A2ufRb9WrjpSxMTFRqt2e0Jldg2_S0AqwmH4URRkBchvRu&p=13&fvj=0&vjs=3", "description": "[<div><b>Full Stack Applications Developer, Full-Time, Bristol</b>\n<br/>\n<br/>\nGraphcore has created a completely new processor, the Intelligence Processing Unit (IPU), specifically designed for artificial intelligence. The IPU\\'s unique architecture means developers can run current machine learning models orders of magnitude faster. More importantly, it lets AI researchers undertake entirely new types of work, not possible using current technologies, to drive the next great breakthroughs in general machine intelligence.\n<br/>\n<br/>\nWe believe our IPU technology will become the worldwide standard for artificial intelligence compute. The performance of Graphcore\\'s IPU is going to be transformative across all industries and sectors whether you are a medical researcher, roboticist or building autonomous cars.\n<br/>\n<br/>\nOur team is at the forefront of the artificial intelligence revolution, enabling innovators from all industries and sectors to expand human potential with technology. What we do, really makes a difference.\n<br/>\n<br/>\nThe Full-Stack Application Developer will contribute by supporting the planning and release procedures, by designing, scoping and building a number of critical tools and applications. You will be involved in creating a visual tool for release and features planning, release automation, UI to a number of systems to simplify, expand and improve the SDLC of the whole SW engineering and Product team.\n<br/>\n<br/>\nIdeally, you are an expert in full-stack applications space and will be instrumental in the improvements and capabilities of the day-by-day work in Graphcore.\n<br/>\n<br/>\nYou will work with the Release Manager, collect requirements from the Product team. You will be closely involved with the DevOps team and the whole SW engineering while shaping the future SDLC. Everything you will build will be used by hundreds of developers across the globe, to deliver the latest AI technology.<br/>\n<h2 class=\\\"jobSectionHeader\\\"><b>\nResponsibilities</b></h2>\n<ul><li>Develop applications and tools in full-stack, cross-platform, environment.</li>\n<li>Ability to build an application from scratch: from design to deployment</li>\n<li>Ability to design efficient and effective UIs</li>\n<li>Working with an Agile scrum methodology, breaking work down in epics and stories</li>\n</ul><h2 class=\\\"jobSectionHeader\\\"><b>Key Skills</b></h2>\n<ul><li>Passion driven, goal-oriented and \\\"Can do\\\" attitude</li>\n<li>Experience of full-stack cross-platform environment: Linux/MacOS/Windows</li>\n<li>Intimate familiarity of version control, specifically git</li>\n<li>Ability to build complex applications in Python, PHP, bash</li>\n<li>Knowledge of SQL and relational databases like MySQL or SQLite</li>\n<li>Comfortable in understanding opensource tools and build extensions for them</li>\n<li>Ability to interface with opensource communities as needed</li>\n</ul>Please note, we are only considering candidates who have an established right to work in the UK for roles based in Bristol, UK\n<br/>\n<br/>\nWe welcome people of different backgrounds and experiences and are committed to building an inclusive work environment that makes Graphcore a great home for everyone. We are an equal opportunity employer and want to build a work environment where everyone is happy, productive and respectful, so they can do their best work. If you have a disability or additional need that requires accommodation, just let us know.</div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4552872, "longitude": -2.5923872}}, {"title": "Python/ Go Developer £40-60k", "company": "Headforwards", "raw_location": "South West", "raw_salary": "\n£40,000 - £60,000 a year", "min_salary": 40000.0, "max_salary": 60000.0, "mid_salary": 50000.0, "detail_url": "http://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0DuHDjNWw39SJ5e6sYpMBsA1c0MQ32LDXTWEMHTY-Wt9ZQzCHqjxt7ZbJTKCx1V4ZVW3A1qpVUyL8QXEoJ4hRVCx1OkQ-efXv4ZkL56kDwdfFnW1kvWN3Z4r7xDPB0FOGn5FWCfWiAk-dPE92itq021Z0WIkC8FCL4t1sd5Y_4svKGy4BvrkeEnvfQJCi_JCv_nXUifL8vcDiRrdrJSH5IKH5Pq1PGh4mjisAFdG9Ckt_V-QSItUs_XqhvfZgNIzXF9KKVbZy00vXucugfagOeosv2lbJx1mjjBXbmrL6MUMGN2slPfJ7KdHuXYuhprNBhSctWGzZ397O663q4L2UTvMxboPd3E3N3qvyX84cMKP3DuhLWfdRWHZC7vE9NPfceADQPgg1VseEfe3_sAHL-qWp1dti6N7c6gXvSfEqE7bSm3ivcLelGu6QTnEYhRKtaWNs9hDbZka200_NsWEWi3gcMjkD3hNZ4=&p=0&fvj=1&vjs=3", "description": "[<p><b>Are you a Developer who is keen to bleed the edges of your experience?</b></p>, <p>If so, we would love to hear from you! We are looking for an experienced developer in Python and/or Go to join one of our high performing development teams. If you have good commercial experience in a similar or related language you could also fit in well.</p>, <p><b>We are offering a salary of up to £60,000 depending on experience.</b></p>, <p><b>What will you be doing? </b></p>, <ul><li>You will be joining a fast-moving development team working on the backend of a cutting-edge web application for one of the largest telecoms companies in the world, building and deploying microservices at scale, on a Kubernetes platform, with multiple global regions.</li><li>You will be using and improving our in house continuous delivery pipelines to release new features and functionality to the client.</li></ul>, <p>We are delivering multiple releases every day and working with some pretty exciting technologies alongside fully employing the use of Agile methodologies across the whole business.</p>, <p>You may currently be a Team Lead, or an Architect in your current role and looking for a new challenge.</p>, <p><b>Why work for Headforwards?</b></p>, <ul><li>We are a software development company with just over 100 people from 18 different countries and we like to have fun at work!</li><li>We are agile with a very laid back feel, a relatively flat structure and small self-organising teams of 2-7 people. We work in teams dedicated to various clients and we work on global projects with cutting edge technologies, tools and techniques.</li><li>There\\'s no pressure to work extra hours to churn out more and more code.</li><li>Our culture and environment is dedicated to making people happy at work.</li><li>We live in beautiful Cornwall, our offices are 5 miles from the beach. We want to make sure our people have a good work life balance so that they can enjoy all that Cornwall has to offer : )</li><li>We have lots of social activities and monthly learning sessions, talks and cross company communities of practice for various languages, tools and frameworks.</li></ul>, <p>This is a place where you can make a difference, work in a small team start-up feel but benefit from the support of a larger community of developers and like-minded people.</p>, <p><b>Key Personal Traits</b></p>, <ul><li>You will have been a developer for at least five years</li></ul>, <ul><li>You will have used Python or Go</li><li>You are happy to work as both a Mentor or Leader within a team, and contribute to a wider project team</li><li>We enjoy spirited exchanges of ideas, pushing us towards technical excellence and we expect to hear your voice in these conversations.</li><li>You will be a natural problem solver and able to align business delivery priories against implementation choices.</li><li>You will have the desire and ability to continually learn in improve yourself, and your colleagues.</li></ul>, <p><b>Key Technical Skills</b></p>, <ul><li>Knowledge of relational and / or non-relational (NoSQL) databases (we use MongoDB, Postgres, Redis, InfluxDB)</li><li>Experience of message queues (we use Kafka)</li><li>Experience of container orchestration (we use Kubernetes, Docker)</li><li>An operational mindset with knowledge of high availability, monitoring and diagnostics</li><li>Understanding of the web application stack</li><li>A pragmatic and practical approach to solving business problems</li><li>Exposure to test driven development and integration testing</li><li>Experience working with development team tools (e.g. continuous integration systems (we use Jenkins) and version control systems (we use Git)</li></ul>, <p><b>The closing date for this role is 31st March 2020. We recruit on a rolling basis and fill our vacancies as soon as we find people who fit our culture and meet the skills requirements. This means that whilst we have a closing date on all of our roles, we may offer the role to someone before the end date, so we recommend that you apply as soon as possible.</b></p>, <p>Job Types: Full-time, Permanent</p>, <p>Salary: £40,000.00 to £60,000.00 /year</p>, <p>Experience:</p>, <ul><li>Python: 4 years (Preferred)</li></ul>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 50.2272249, "longitude": -5.2716259}}, {"title": "Full Stack Applications Developer", "company": "Graphcore", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0B2LP6KtwgLMWcIJbzQK4y118hUYa2NHT0ELzb4aR6nDrO9_32R0LtazQt5Ev9ntbMF67x-uIqCFBIaSgF3Jr_RlBZttv17jHoO36gbiKCViwKMlso9PTYyZrCltqyWFf2M33tYYDFxulDCuG005fjA9bOKTyD0CWzIrw-icr-yXIUyg34W6Tq5W2gpDPMRtsfrKm_VGUksamLwGQ-UPIX5bGMR97bMaggoRSZ5_ahRydoz5gInplEkgG2WvYDQPGCWDiDeno_Gj3-77MEyg0H59JJl2GnKg2Bw4Vv3vEM_WeaJwl2uPsMmgFTen-av7VDzKnr2ETr-2cJ8EKohwCUT16pWM_FGCAP15o1UT4EHloo24U4dBPt9geGJIxzfvHPJidN5IXf72cB0hONbDzwTnNHLiE2QtUqTHOSvSzKC6_QBAmKJu9nQ&p=1&fvj=0&vjs=3", "description": "[<div><b>Full Stack Applications Developer, Full-Time, Bristol</b>\n<br/>\n<br/>\nGraphcore has created a completely new processor, the Intelligence Processing Unit (IPU), specifically designed for artificial intelligence. The IPU\\'s unique architecture means developers can run current machine learning models orders of magnitude faster. More importantly, it lets AI researchers undertake entirely new types of work, not possible using current technologies, to drive the next great breakthroughs in general machine intelligence.\n<br/>\n<br/>\nWe believe our IPU technology will become the worldwide standard for artificial intelligence compute. The performance of Graphcore\\'s IPU is going to be transformative across all industries and sectors whether you are a medical researcher, roboticist or building autonomous cars.\n<br/>\n<br/>\nOur team is at the forefront of the artificial intelligence revolution, enabling innovators from all industries and sectors to expand human potential with technology. What we do, really makes a difference.\n<br/>\n<br/>\nThe Full-Stack Application Developer will contribute by supporting the planning and release procedures, by designing, scoping and building a number of critical tools and applications. You will be involved in creating a visual tool for release and features planning, release automation, UI to a number of systems to simplify, expand and improve the SDLC of the whole SW engineering and Product team.\n<br/>\n<br/>\nIdeally, you are an expert in full-stack applications space and will be instrumental in the improvements and capabilities of the day-by-day work in Graphcore.\n<br/>\n<br/>\nYou will work with the Release Manager, collect requirements from the Product team. You will be closely involved with the DevOps team and the whole SW engineering while shaping the future SDLC. Everything you will build will be used by hundreds of developers across the globe, to deliver the latest AI technology.<br/>\n<h2 class=\\\"jobSectionHeader\\\"><b>\nResponsibilities</b></h2>\n<ul><li>Develop applications and tools in full-stack, cross-platform, environment.</li>\n<li>Ability to build an application from scratch: from design to deployment</li>\n<li>Ability to design efficient and effective UIs</li>\n<li>Working with an Agile scrum methodology, breaking work down in epics and stories</li>\n</ul><h2 class=\\\"jobSectionHeader\\\"><b>Key Skills</b></h2>\n<ul><li>Passion driven, goal-oriented and \\\"Can do\\\" attitude</li>\n<li>Experience of full-stack cross-platform environment: Linux/MacOS/Windows</li>\n<li>Intimate familiarity of version control, specifically git</li>\n<li>Ability to build complex applications in Python, PHP, bash</li>\n<li>Knowledge of SQL and relational databases like MySQL or SQLite</li>\n<li>Comfortable in understanding opensource tools and build extensions for them</li>\n<li>Ability to interface with opensource communities as needed</li>\n</ul>Please note, we are only considering candidates who have an established right to work in the UK for roles based in Bristol, UK\n<br/>\n<br/>\nWe welcome people of different backgrounds and experiences and are committed to building an inclusive work environment that makes Graphcore a great home for everyone. We are an equal opportunity employer and want to build a work environment where everyone is happy, productive and respectful, so they can do their best work. If you have a disability or additional need that requires accommodation, just let us know.</div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4552872, "longitude": -2.5923872}}, {"title": "Junior Python Developer - Trading", "company": "Client Server", "raw_location": "Bristol", "raw_salary": "\n£50,000 - £75,000 a year", "min_salary": 50000.0, "max_salary": 75000.0, "mid_salary": 62500.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=1998d35c0a752edc&fccid=892c145157842ceb&vjs=3", "description": "[<p></p>, <div><div><div>Junior Python Developer / Software Engineer (Trading C++ Linux). One of the most successful proprietary trading forms in the world is seeking a bright, ambitious Junior Python Developer to join their highly accomplished team and work on a strong pipeline of projects.\n<br/>\n<br/>\nAs a Junior Python Developer you\\'ll work on highly complex, deeply technical systems with cross-functional teams who are committed to delivering high quality software releases, business-wide exposure with the chance to benefit from their culture of curiosity and continual learning.\n<br/>\n<br/>\nThe organisation is behind one of the most powerful computing grids in the world, and has asserted its position on the global stage by combining cutting-edge technology and granular data to solve the most complex of technical problems.\n<br/>\n<br/>\nAs a Junior Python Developer, you\\'ll join the rapidly expanding Core Development sector of the business, in a highly collaborative team that designs, codes, tests and maintains the high performance distributed systems that powers their trading operation. You\\'ll work directly with a close-knit team to deploy critical features to the trading platform with the opportunity to benefit from accomplished senior colleagues.\n<br/>\n<br/>\n*Please note: this company is able to conduct an entirely remote interview process during the current circumstances*<br/>\n<br/>\nRequirements:<br/>\n<ul><li>You\\'re degree educated (2.1 or above, BSc / MSc / PhD)\n</li><li>You have strong Python coding ability\n</li><li>You have a thorough understanding of Computer Science fundamentals like OOP, Data Structures, threading models and networking\n</li><li>You\\'re naturally analytical and approach complex technical problems in a logical, thoughtful manner\n</li><li>You\\'re a positive team player who enjoys working collaboratively\n</li><li>Desirable: C++ skills\n</li></ul><br/>\nAs a Junior Python Developer you\\'ll earn a highly competitive salary (to £75k) plus bonus and a comprehensive benefits package.\n<br/>\n<br/>\nApply now or call for a confidential discussion about this Junior Python Developer / Software Engineer (Trading C++ Linux) opportunity.</div></div></div>, <p></p>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.454513, "longitude": -2.58791}}, {"title": "Backend Developer (Python)", "company": "Chronomics", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=128236f9aae020a8&fccid=be1fa4c3e40ce18e&vjs=3", "description": "[\\'Our mission\\n\\', <br/>, <br/>, \\'\\nWant to make a difference in this world and work on something meaningful? At Chronomics we enable people to quantify how their environment and lifestyle is affecting their health to live healthier and happier lives… all from their DNA. We will love you because…\\n\\', <br/>, \\'You’re an expert coder in at least 1 language (Python/PHP/Node.js).\\n\\', <br/>, \\'You have a product mindset and understand creating value, not features.\\n\\', <br/>, \\\"And most of all you\\'r enthusiastic and get shit done. Working in a product focused cross functional team alongside other developers, designers, data scientists and bioinformaticians you will take ownership of projects and get to work on a cutting edge microservice architecture using serverless working with HUGE data (each DNA sample is 100GB…) to build a ground breaking epigenetics platform which is the first of its kind in the world. We built to ship, we ship fast and then we learn and iterate. With a can-do attitude and a strong product mentality you are happy to jump in and get your hands dirty which could be anything from learning GO, building a Lambda microservice or optimizing an AWS pipeline. You will get the chance to work with numerous different technologies, have a say in how we drive the company forward and learn a ton of science along the way. Essential skills:\\n\\\", <br/>, <br/>, \\'\\nCan write secure, scalable, readable code in at least one or two languages\\n\\', <br/>, \\'Experience designing and scaling databases\\n\\', <br/>, \\'Designing, building, consuming AND documenting REST APIs\\n\\', <br/>, \\'Cloud platforms (AWS)\\n\\', <br/>, \\'Happy on the command line\\n\\', <br/>, \\'Agile development\\n\\', <br/>, \\'Test automation\\n\\', <br/>, \\'Familiarity with mobile and web development\\n\\', <br/>, <ul>\n<li>Work as part of a focused team, but at the same time self-driven and able to work independently Nice to have:</li>\n</ul>, \\'\\nSome dev ops (CI/CD/Docker)\\n\\', <br/>, \\'Infrastructure as code (Terraform/CloudFormation)\\n\\', <br/>, \\'Experience with other languages such as Python/JavaScript (React/Node) etc\\n\\', <br/>, \\'Serverless experience\\n\\', <br/>, \\'Experience with big data\\n\\', <br/>, \\'Experience working on high scalability websites\\n\\', <br/>, \\'Have worked with genetics data\\n\\', <br/>, \\'Experience with serverless and microservices architecture\\n\\', <br/>, \\'Graph Databases\\n\\', <br/>, <b>Location:</b>, \\' Bristol, London, Cambridge or part remote Start date: 1st Jan 2020 onwards Company size: 10-20 people Company type: VC funded\\n\\', <br/>, <br/>, \\'\\nBenefits\\n\\', <br/>, <br/>, \\'\\nShare options so early contributors benefit from our success.\\n\\', <br/>, \\'Epigenetic test!!\\n\\', <br/>, \\'Flexible office or home working.\\n\\', <br/>, \\'Macbook pro\\n\\', <br/>, \\'Friday pub sessions.\\n\\', <br/>, \\'About Us\\n\\', <br/>, <br/>, \\'\\nChronomics is an ambitious health tech start-up that believes people should be in charge of their own health. Health management should be proactive, not reactive and it should be personalised. We are using longitudinal biological data to bring about this revolution. A revolution where not only will people be in control of their own future but also in control of how they contribute to the future of humanity through the use of their data.\\n\\', <br/>, <br/>, \\\"\\nThis product is just the first step towards a platform technology that will serve as the interface between the biological and digital world. It\\'s an incredibly exciting time to come on board where you can really make a difference. Find out more at www.chronomics.com\\\"]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.5166006, "longitude": -0.2254268}}, {"title": "Entry Level GIS Professional", "company": "Geollect Limited", "raw_location": "Bristol", "raw_salary": "\n£18,000 - £22,500 a year", "min_salary": 18000.0, "max_salary": 22500.0, "mid_salary": 20250.0, "detail_url": "http://www.indeed.co.uk/company/Geollect/jobs/Entry-Level-GIS-Professional-7aa2c691079199be?fccid=9b81b6ebc61889fd&vjs=3", "description": "[<p><b>Geospatial Analyst - Entry Level</b><br/>Geollect is an agile geospatial intelligence and analysis company, providing dynamic insights for decision support to a network of global clients in the defence, maritime insurance and cruise industries. We are looking for an ambitious candidate who has a passion for GIS, loves a good challenge, and wants to be part of a rapidly growing company.</p>, <p><b>Job Description</b></p>, <p>The successful candidate will form an integral part of the geospatial analytical team, working on multiple projects across a diverse range of sectors. We are looking for someone who can embrace each challenge with enthusiasm as a team player or independently with a strong will to succeed. You will be required to analyse and interpret multiple data layers using innovative techniques to assist in the automation and quality control of Geollect\\'s suite of products. You will leverage all available datasets, including, but not limited to, satellite imagery, infrastructure data, news and social media, maritime vessel locations, third-party APIs and crowd-sourced data. The analytical team are looking for relationships in the data, patterns of life and anomalies to provide powerful insights within a comprehensive operating picture to help our clients identify operational risk and opportunities. You will also work closely with the data scientists, data engineers and web developers.</p>, <p>This opportunity is perfect for a GIS (or related subject) graduate, who wants to develop a keen understanding of how geospatial technology is applied in a commercial setting. For the right employee, this role provides the opportunity to grow into leadership positions as the company scales.</p>, <p>You are encouraged to apply even if you don\\'t meet all of the requirements below. Geollect are building a team that fit together well, and are open to a variety of skills and levels of experience. Candidates are welcome to get in touch for further information prior to application.</p>, <p><b>Required Skill Sets</b></p>, <p><i>GIS analysis qualifications</i></p>, <ul><li>ArcGIS suite of products experience</li><li>ArcGIS Online experience</li><li>Web Mapping Service (WMS) knowledge</li><li>Web Feature Service (WFS) knowledge</li><li>JSON knowledge</li><li>SQL knowledge</li><li>Data entry, conversion and maintenance</li><li>Metadata creation and editing</li><li>Portability of skills on multi-platforms</li><li>Basic understanding of programming</li></ul>, <p><i>Other qualifications</i></p>, <ul><li>Ability to work effectively from a remote location</li><li>Ability to quickly learn sector-specific information to better exploit available datasets</li><li>Apply skill sets and expertise in multiple domains</li><li>Creative thinking with attention to detail</li><li>Innovative and proactive approach to problem solving</li><li>Evidence of continued personal and professional development</li></ul>, <p><i>Desired Skillsets</i></p>, <ul><li>Programming language (Python, .Net)</li><li>Imagery exploitation training or equivalent experience</li><li>GIS workflows - model building</li><li>GIS architecture (web and desktop)</li><li>Knowledge of SAR exploitation</li><li>Ability to translate user needs to solutions</li><li>Ability to present solutions in a simplistic visual manner</li><li>Clear, concise communication skills</li><li>Customer support skills</li></ul>, <p>Benefits:</p>, <ul><li>On-site parking</li><li>Flexible working hours</li><li>Sick pay</li><li>Bonus scheme</li><li>Casual dress</li><li>Company events &amp; social hours</li></ul>, <p>Job Types: Full-time, Contract, Permanent</p>, <p>Salary: £18,000.00 to £22,500.00 /year</p>, <p>Experience:</p>, <ul><li>ArcGIS: 1 year (Preferred)</li><li>GIS: 1 year (Preferred)</li></ul>, <p>Education:</p>, <ul><li>Bachelor\\'s (Preferred)</li></ul>, <p>Location:</p>, <ul><li>Bristol, Bristol (Required)</li></ul>, <p>Language:</p>, <ul><li>English (Required)</li></ul>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.454513, "longitude": -2.58791}}, {"title": "Data Scientist", "company": "Toumetis", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=bad349f4892ea944&fccid=1408f3873505835f&vjs=3", "description": "[<div><p>Toumetis Job Description</p><br/>\n<p></p>\n<p>\nData Scientist</p><br/>\n<p></p>\n<p>\nSalary DOE</p><br/>\n<p></p>\n<p>\nAbout our Company - Our mission at Toumetis is to deliver intelligence that can transform business operations and enable new revenue via the application of machine learning. We combine experience in applied machine learning, frontend development, data engineering, and cloud computing to help Fortune-1000 companies bring elegant IoT solutions to life, surfacing unique insights to predict and prevent problems and improve organisational performance. Our engineers, developers and data scientists share a passion for innovation and are dedicated to providing our customers with solutions that enable new insights that revolutionise business processes. We have a friendly working environment with flexible hours, regular social events, great coffee and snacks, free parking, ride to work scheme, bike racks, shower facilities and you will be supplied with a MacBook Pro.</p><br/>\n<p></p>\n<p>\nThe ideal candidate will have several years experience working commercially as a Data Scientist, with a keen interest to apply data science and machine learning working in client facing roles. You will be a key member of fast paced teams. Working alongside data engineers, front end developers and UX designers, you will be tasked with getting your algorithms into production on our real time analytics platform. You should be open to learning and using data science techniques on other applications.</p><br/>\n<p></p>\n<p>\nResponsibilities / Job Role</p>\n<ul>\n<li>Gaining a detailed understanding of client business issues.</li>\n<li>Exploratory data analysis.</li>\n<li>Cleaning, transforming and fusing large raw data sets.</li>\n<li>Model development and performance evaluation.</li>\n<li>Deploying models in production environments.</li>\n<li>Continuous evaluation and improvement of models in production.</li>\n<li>Keeping up to date with the latest tools, methods &amp; technologies</li><br/>\n</ul><p></p>\n<p>\nKey Skills / Experience</p>\n<ul>\n<li>Knowledge of python for data analysis and machine learning (pandas, numpy, scikit-learn, tensorflow, keras, etc.).</li>\n<li>Demonstrable machine learning experience (supervised/unsupervised) such as developing and deploying deep learning solutions relating to time series, NLP, video, and images.</li>\n<li>Knowledge in visualizing and presenting complex data and information.</li>\n<li>Exposure to working with large, complex and messy data sets.</li>\n<li>Capability to communicate complex concepts and data patterns to non-technical audiences.</li>\n<li>Experience or an interest to work in cloud-based development, test &amp; production environments.</li>\n</ul>\n<p>You’ll also have access to company paid training services as we’re keen for you to grow your skills.</p></div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4470004, "longitude": -2.6086458}}, {"title": "C++ Developer - Technologist", "company": "Client Server", "raw_location": "Bristol", "raw_salary": "\n£28,000 - £35,000 a year", "min_salary": 28000.0, "max_salary": 35000.0, "mid_salary": 31500.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=8cb72e2d13039ea3&fccid=892c145157842ceb&vjs=3", "description": "[<p></p>, <div><div><div>C++ Developer / Software Engineer (C++ Python Java SPARK). Are you a skilled, passionate technologist looking for an opportunity to support the global operation of a trailblazing tech start up? You could join a 120-strong, international team of exceptional engineers and will play a key role in developing bleeding edge technologies to meet the highest grade of open-source software development.<br/>\n<br/>\nThe company specialises in secure, reliable applications cover industries; from avionics, aerospace and defence to medical and energy, their advanced technologies are industry leading across the world. In this C++ Developer role, you\\'ll work directly on the language library for code intelligence for their proprietary programming language, and developing tools and libraries to support it.<br/>\n<br/>\nAs a C++ Developer you\\'ll have an extraordinary chance to develop your technical skills using cutting-edge technologies Libadalang, SPARK and Python, in conjunction with refining your craft on more traditional languages like C++ and Java. There will be a continuous, strong pipeline of projects to choose from, and will be supported to learn in a culture based on curiosity.<br/>\n<br/>\nYou\\'ll be based in brand new offices in Bristol, (a short walk from transport links) where you can enjoy great facilities, as well cake on Wednesday\\'s and drinks on Fridays in a highly inclusive team atmosphere. You\\'ll also have access to regular training opportunities, including the chance to travel to the New York and Paris offices, and a 3 day, company-wide gathering in Summer.<br/>\n<br/>\nRequirements:<br/>\n<ul><li>You have experience working with one or more high-level programming language (C++ / Java / Python)</li><li>You\\'re degree educated (2.1 or above, BSc / MSc / PhD)</li><li>You have a strong understanding of Computer Science fundamentals</li><li>You have knowledge of / interest in compilation / programming language analysis (demonstrable experience, even in form of university projects is highly beneficial)</li><li>You\\'re a confident, self-assured communicator who works well independently / is a key contributor in a team</li></ul>\n<br/>\nAs a C++ Developer you\\'ll earn a highly competitive salary (to £35k) plus a profits-based bonus and a comprehensive benefits package, including a generous holiday allowance, pension, private dental and healthcare and more.<br/>\n<br/>\nIf you\\'re interested in this C++ Developer / Software Engineer (C++ Python Java SPARK) role, apply now or get in touch today to find out more.</div></div></div>, <p></p>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.454513, "longitude": -2.58791}}, {"title": "Python Developer", "company": "Explore Group", "raw_location": "Bath", "raw_salary": "\n£25,000 - £60,000 a year", "min_salary": 25000.0, "max_salary": 60000.0, "mid_salary": 42500.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=ddd4b0b1dbdb5489&fccid=f877f9ab98439bf6&vjs=3", "description": "[\\'After being acquired by a multi-billion dollar company headquartered in America, a software development company based in Bath are looking for a number of Python Developers as they expand.\\n\\', <br/>, <br/>, \\'\\nThis company have revolutionised the retail area, by creating an in-house product that is monitored by a central server. This product has distributed networks of virtualized and containerized services, that gives the client the instruments for Cloud Management in an onsite premise. They use Python, React as well as a number of other technologies and now that they have had great success in the roll out of their product, are looking for several developers at this exciting turning point for the company.\\n\\', <br/>, \\'You will be working on both new and existing areas of the product, with a chance to use a wide range of technologies. They are looking for Fullstack Python Developers from no commercial experience upwards, where you will produce code that is clean, create test-cases for functionality as well as a multitude of other tasks, all within an office in central Bath.\\n\\', <br/>, <br/>, \\'\\n\\', <b>If you have these you could be a great fit:</b>, <br/>, \\'\\nPython experience\\n\\', <br/>, \\'React experience\\n\\', <br/>, \\'Computer Science degree (or similar)\\n\\', <br/>, <b>Now, let\\'s talk numbers:</b>, \\' £25-60k DOE\\']", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.3810641, "longitude": -2.3590167}}, {"title": "Python Developer", "company": "+1 location", "raw_location": "Bristol", "raw_salary": "\n£45,000 - £55,000 a year", "min_salary": 45000.0, "max_salary": 55000.0, "mid_salary": 50000.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=b74c0444f5ddc94e&fccid=e884fac1a9f6027b&vjs=3", "description": "[\\'Varied project base all centred on Data Science/IoT.\\n\\', <br/>, \\'Ambitious growth period with scope to get from 30 to 100 in the next 2 years.\\n\\', <br/>, \\'International customer base working with a diverse range of household names.\\n\\', <br/>, <br/>, \\'\\nA well-reputed predictive analytics & application consulting provider is going through a rapid period of growth and are looking for Python Developers to join their team. Born in America, the Bristol office is now at c30 (developers, testers, data scientists/engineers) with scope to get to 50 in 2020, and 100 in the next 2 years. They operate in a highly Agile environment, working with an incredibly diverse & global customer base spread across the UK, Australia, Canada, Germany, Mexico, Spain & Monaco. The business are constantly looking to integrate new & emerging technologies into the business, a lot of their techies are customer facing as well.\\n\\', <br/>, <br/>, \\\"\\nWhat skills you\\'ll need\\n\\\", <br/>, <br/>, \\'\\nProven Python development experience, preferably with an interest in data science/visualisation.\\n\\', <br/>, \\'Back-end focused with an appreciation for front-end technology. Understanding of React/TypeScript.\\n\\', <br/>, \\'Significant knowledge of infrastructure-as-code (Terraform).\\n\\', <br/>, \\'Containerisation experience (Docker, Kubernetes).\\n\\', <br/>, \\'Awareness of cloud technology, particularly with AWS.\\n\\', <br/>, \\'Any understanding of FastAPI, Git or Postgres would be beneficial.\\n\\', <br/>, \\'Extensive knowledge of Agile/Scrum methodologies and ability to work in a highly Agile environment.\\n\\', <br/>, <br/>, \\\"\\nWhat you\\'ll be doing\\n\\\", <br/>, <br/>, \\'\\nJoining a small development team in the data science division of the business, you will take ownership of a high-level data science platform which will need a service-based architecture built to allow adaptation of requirements depending on the particular customer. This role is primarily server-side focused but you will need to offer enthusiasm for the front-end and will offer support with React/TypeScript as and when needed. The solution will be deployed on AWS using Docker & Terraform; it ingests & processes data from various sources and then cascades it back to their stakeholders. There will be some backlog work to involve yourself in initially but then the focus will be on adding new features/functionalities to the platform. You will need to grasp technical details quickly, familiarising yourself with the design & architecture of any given project so you can adjust your approach to best support the customer’s requirements\\n\\', <br/>, <br/>, \\\"\\nWhat you\\'ll get in return for your experience\\n\\\", <br/>, <br/>, \\'\\nThe company offer a very relaxed & casual environment, offering flexible working hours (core day is 10am – 4pm) and plenty of scope for training & progression. As the business expands there could be scope to move into more of a lead position depending on which way you see your career going, and they encourage their employees to go on a range of training courses & tech conferences. They’re offering a generous salary, healthy pension scheme and free food in the office. It really does have the culture of a start-up but with the backing of a large international business!\\n\\', <br/>, <br/>, \\'\\nWhat next?\\n\\', <br/>, <br/>, \\\"\\nThis is a fantastic opportunity to work for an amazing company, so if you\\'re interested, send your CV to Joe ASAP or give us a call to find out more.\\\"]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4087315, "longitude": -2.5799254}}, {"title": "Senior Python Developer", "company": "Toumetis", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=f54f8cf6292107ea&fccid=1408f3873505835f&vjs=3", "description": "[<div><p>TouMetis Job Description</p><br/>\n<p></p>\n<p>\nSenior Python Developer</p><br/>\n<p></p>\n<p>\nSalary DOE</p><br/>\n<p></p>\n<p>\nAbout our Company Our mission at Toumetis is to deliver intelligence that can transform business operations and enable new revenue via the application of machine learning. We combine experience in applied machine learning, frontend development, data engineering, and cloud computing to help Fortune-1000 companies bring elegant solutions to life, surfacing unique insights to predict and prevent problems and improve organisational performance. Our engineers, developers and data scientists share a passion for innovation and are dedicated to providing our customers with solutions that enable new insights that revolutionise business processes. We have a friendly working environment with flexible hours, regular social events, great coffee and snacks, free parking, ride to work scheme, bike racks, shower facilities and you will be supplied with a MacBook Pro.</p><br/>\n<p></p>\n<p>\nJoining the Cascadence development team you will work closely with the data science team to deploy data science models. We’re building a service based architecture that gives us flexibility so that we can adapt to the requirements of each customer. We’re deploying on AWS using Docker and Terraform.</p>\n<p>\nWe’re looking for someone with roughly 3 years of professional experience with Python, an interest in data science and data visualisation is a bonus. You’ll be working in a small team of developers who are working in an Agile development process. We’re looking for someone keen to take advantage of opportunities to develop their skills and to suggest ways to improve our code and our products.</p><br/>\n<p></p>\n<p>\nIf you have good experience with any or all of our tech stack then please get in touch!</p>\n<p>\nTech we use</p>\n<ul><li>Python 3</li></ul>\n<ul><li>FastApi</li></ul>\n<ul><li>AWS</li></ul>\n<ul><li>Docker</li></ul>\n<ul><li>Terraform</li></ul>\n<ul><li>React.js (with Redux)</li></ul>\n<ul><li>Typescript</li></ul>\n<ul><li>Git</li></ul>\n<ul><li>Postgres</li></ul><br/>\n<p></p>\n<p>\nYou’ll also have access to company paid training services as we’re keen for you to grow your skills.\n<br/>\n<br/>\nFor a confidential discussion about this role, or if you feel your skillset would be of benefit to the TouMetis team but doesn’t match a specific job spec, please get in touch with our Talent Acquisition team - george.wrightson@Toumetis.com/ 07853 926 928</p></div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4470004, "longitude": -2.6086458}}, {"title": "Vulnerable Application Developer (Contract)", "company": "Immersive Labs", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=2d2b1d960d8bc910&fccid=8f8f3106603d3e52&vjs=3", "description": "[\\'Contract\\n\\', <br/>, <br/>, \\'\\nDo you enjoy building Capture the Flag (CTF) style challenges?\\n\\', <br/>, <br/>, \\'\\nCan you write web applications in various languages and understand how to improve the security of your code?\\n\\', <br/>, <br/>, \\'\\nDo you want to help others overcome coding challenges and educate people on coding vulnerabilities?\\n\\', <br/>, <br/>, \\'\\nWe are looking for engineers on a contract basis either Bristol based or remotely (with regular visits to the Bristol office) to write deliberately vulnerable web applications for Immersive Labs and help us educate developers around the world on how to fix vulnerabilities in their code and engineer more secure applications.\\n\\', <br/>, <br/>, \\'\\nThe opportunity\\n\\', <br/>, <br/>, \\\"\\nAt Immersive Labs, we\\'ve just launched our latest offering - Secure Coding. This exciting new addition to our market-leading platform teaches developers how to write secure code. We are creating labs that take our users from the basics of writing a secure application avoiding the standard OWASP pitfalls through to building secure public cloud-hosted web apps.\\n\\\", <br/>, <br/>, \\'\\nThe first set of secure coding labs are live and loved by our users, we are now looking to expand our offering to drive this forward!\\n\\', <br/>, <br/>, \\'\\n\\', <b>Your main responsibilities:</b>, <br/>, \\'\\n\\', <ul>\n<li>Develop deliberately vulnerable applications</li>\n<li>Develop a set of resources to help users understand the vulnerabilities for each lab and how to mitigate them</li>\n<li>Develop an automated set of tests that can verify that the user has fixed a given vulnerability</li>\n<li>Plan, write, test and improve secure coding labs in the Immersive Labs platform</li>\n<li>Understand the learning process for software developers to challenge and teach them through Immersive Labs</li>\n</ul>, \\'\\n\\', <b>To be successful:</b>, <br/>, \\'\\n\\', <ul>\n<li>Software Development experience across one or all of the following languages: PHP, Java, Rails</li>\n<li>Some experience developing in HTML/CSS, JavaScript and Python would be beneficial</li>\n<li>Deep and demonstrable understanding of developing secure software</li>\n<li>An understanding of the OWASP Top 10 Web application security risks, and other historic, prevalent or emerging application security risks</li>\n<li>Experience writing theory and online learning content about programming, secure coding, IT/Computing and/or Cyber</li>\n<li>Familiarity with Linux and Docker would be beneficial</li>\n</ul>, \\'\\nFind out more at https://www.immersivelabs.com/careers/\\n\\', <br/>, <br/>, \\'\\nHelp change the face of cybersecurity, apply now!\\']", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4531476, "longitude": -2.5912439}}, {"title": "Software Developer Trainer", "company": "Mayden", "raw_location": "Bath", "raw_salary": "\n£30,000 - £50,000 a year", "min_salary": 30000.0, "max_salary": 50000.0, "mid_salary": 40000.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=f82f8cd0cf14dfe3&fccid=c3c454cd2a9999ad&vjs=3", "description": "[<div><p><b>Salary: </b>£30,000 - £50,000<br/>\n</p><p><b>\nLocation: </b>Bath<br/>\n</p><p>\nAre you an enthusiastic programmer looking for a new challenge? Come and work with us to help change people’s lives!</p>\n<p>\nWe run a 16 week coding course which turns newbies into junior developers, then get them great jobs which we know they’ll love. As an Academy trainer you’ll mainly focus on teaching – being a coach, mentor and trainer for your students while they learn the skills that will start their new careers.</p>\n<p>\nOutside of course times, you’ll work with the other trainers to update the curriculum, develop new workshops, assess student applications, run coding sessions for schools and events, deliver bespoke training for tech companies, and work with our hiring partners to find great jobs for your students after they graduate.</p>\n<p>\nAll of our trainers are given their own training, shadowing on the full 16 week Full Stack Track before they begin with their own class. So don’t worry if you’ve never taught before, or don’t know our exact stack. We’ll support you.</p>\n<p>\nThe most important thing is that you’ve got real world experience as a programmer, and want to do something a bit different to help give people a new start in life.</p>\n<p><b>\nAbout you</b></p>\n<p>\nYou’ll have worked as a professional software developer for at least a couple of years, with experience on real client projects. You will have helped support your team with difficult problems and be happy helping junior developers. You will have skills in OOP and be comfortable programming for the web with a back-end language, working with current industry standard technologies.</p>\n<p>\nYou will have experience with a range of development tools as well as experience of methodologies such as agile, pair programming and code reviews.</p>\n<p>\nWe’re not concerned with what language/s you use, as long as you have the experience and are happy to learn our own languages (PHP, Node.js and Javascript).</p>\n<p>\nIt doesn’t matter whether you use C, C++, C#, Ruby, Java, Python, Go, Swift or anything else – the most important thing is that you’re a friendly, motivated team player who wants to help people. We’re all about changing lives, and hope you are too.</p>\n<p><b>\nAbout us</b></p>\n<p>\nWe are all about people. We train people of all ages and backgrounds to code, giving them everything they need to know to land their first job as a junior software developer. We work hard to make sure our course is as inclusive as possible, and help to make positive change in the tech industry. Our graduates consistently tell us that their time at the Academy was one of the best in their lives.</p>\n<p>\nOur small classes mean you’ll get to know your students really well, and you’ll be part of a welcoming and fun team.</p>\n<p>\nOur offices are based in a historic building in beautiful Bath. It’s a 10 minute walk from the train station, with incredible views over the city and a lovely big garden. We’ve got break-out rooms with comfy sofas, books, board games and Mario Kart, and a big kitchen with tea, coffee, toast and fruit.</p>\n<p>\nWe pride ourselves on having created a happy place to work with a strong sense of value and purpose. You’ll be working alongside award-winning trainers and mentors in a team of people who love what they do. And you’ll be making a genuine difference to people’s lives.</p>\n<p>\nInterested?</p>\n<p>\nJust send a CV and a cover letter saying why you’d like to work with us. We’d love to hear from you.</p>\n<p>\nMust be eligible to live and work in the UK.</p>\n<p><b>\nSalary: £30-50k Plus Benefits</b></p>\n<p><b>\nSTRICTLY NO AGENCIES</b></p></div>, <p></p>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.3740822, "longitude": -2.3785498}}, {"title": "Software Developer Trainer - Mayden Academy", "company": "Mayden", "raw_location": "Bath", "raw_salary": "\n£30,000 - £50,000 a year", "min_salary": 30000.0, "max_salary": 50000.0, "mid_salary": 40000.0, "detail_url": "http://www.indeed.co.uk/company/Mayden/jobs/Software-Developer-Trainer-dfedd1c031d61796?fccid=2d4c73d1e68cf818&vjs=3", "description": "[<p><b>Software developer trainer</b></p>, <p><b>Are you an enthusiastic programmer looking for a new challenge? Come and work with us to help change people’s lives!</b></p>, <p><b>We run a 16 week coding course which turns newbies into junior developers, then get them great jobs which we know they’ll love. As an Academy trainer you’ll mainly focus on teaching - being a coach, mentor and trainer for your students while they learn the skills that will start their new careers.</b></p>, <p><b>Outside of course times, you’ll work with the other trainers to update the curriculum, develop new workshops, assess student applications, run coding sessions for schools and events, deliver bespoke training for tech companies, and work with our hiring partners to find great jobs for your students after they graduate.</b></p>, <p><b>All of our trainers are given their own training, shadowing on the full 16 week Full Stack Track before they begin with their own class. So don’t worry if you’ve never taught before, or don’t know our exact stack. We’ll support you. </b></p>, <p><b>The most important thing is that you’ve got real world experience as a programmer, and want to do something a bit different to help give people a new start in life.</b></p>, <p><b>About you</b></p>, <p><b>You’ll have worked as a professional software developer for at least a couple of years, with experience on real client projects. You will have helped support your team with difficult problems and be happy helping junior developers. You will have skills in OOP and be comfortable programming for the web with a back-end language, working with current industry standard technologies. </b></p>, <p><b>You will have experience with a range of development tools as well as experience of methodologies such as agile, pair programming and code reviews.</b></p>, <p><b>We’re not concerned with what language/s you use, as long as you have the experience and are happy to learn our own languages (PHP, Node.js and Javascript). </b></p>, <p><b>It doesn’t matter whether you use C, C++, C#, Ruby, Java, Python, Go, Swift or anything else – the most important thing is that you’re a friendly, motivated team player who wants to help people. We’re all about changing lives, and hope you are too. </b></p>, <p><b>About us</b></p>, <p><b>We are all about people. We train people of all ages and backgrounds to code, giving them everything they need to know to land their first job as a junior software developer. We work hard to make sure our course is as inclusive as possible, and help to make positive change in the tech industry. Our graduates consistently tell us that their time at the Academy was one of the best in their lives. </b></p>, <p><b>Our small classes mean you’ll get to know your students really well, and you’ll be part of a welcoming and fun team.</b></p>, <p><b>Our offices are based in a historic building in beautiful Bath. It’s a 10 minute walk from the train station, with incredible views over the city and a lovely big garden. We’ve got break-out rooms with comfy sofas, books, board games and Mario Kart, and a big kitchen with tea, coffee, toast and fruit.</b></p>, <p><b>We pride ourselves on having created a happy place to work with a strong sense of value and purpose. You’ll be working alongside award-winning trainers and mentors in a team of people who love what they do. And you’ll be making a genuine difference to people’s lives.</b></p>, <p><b>Interested?</b></p>, <p><b>Just send a CV and a cover letter saying why you’d like to work with us. We’d love to hear from you.</b></p>, <p><b>Must be eligible to live and work in the UK.</b></p>, <p><b>Salary: Competitive DOE Plus Benefits</b></p>, <p><b>STRICTLY NO AGENCIES</b></p>, <p>Job Types: Full-time, Permanent</p>, <p>Salary: £30,000.00 to £50,000.00 /year</p>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.3740822, "longitude": -2.3785498}}, {"title": "Node JS Full Stack Developer", "company": "Ignite Digital", "raw_location": "Bristol", "raw_salary": "\n£45,000 a year", "min_salary": 45000.0, "max_salary": 45000.0, "mid_salary": 45000.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=540c9fbefa8b0c41&fccid=0c51e1b4ac484e43&vjs=3", "description": "[<div><h2 class=\\\"jobSectionHeader\\\"><b>Full Stack Developer (Node JS)</b></h2>\n<br/>\nA small &amp; dynamic product and services company based in North Bristol who have a focus on the defence and security sectors are actively seeking an experienced full stack developer to help produce scalable software solutions within a small deployment team.<br/>\n<br/>\nThey are looking for a developer who is comfortable amongst both front-end and back-end coding languages, development frameworks and third-party libraries - ideally a candidate who also does have a knack for detailed, visual design and utility.<br/>\n<br/>\n<b>Day To Day</b><br/>\n<br/>\n. Working alongside engineering teams and PM\\'s to ideate software solutions<br/>\n. Designing client-side and server-side architecture<br/>\n. Write effective API\\'s<br/>\n. Test software to ensure responsiveness and efficiency<br/>\n. Troubleshoot, debug and upgrade software<br/>\n. Create security and data protection settings<br/>\n. Build features and applications with a mobile responsive design<br/>\n. Write technical documentation<br/>\n. Work with engineering and capability delivery to improve software<br/>\n. Work out of our clients Bristol office but occasional on-site engagements within the UK and abroad and also WFH options available<br/>\n<br/>\n<b>Experience</b><br/>\n<br/>\n. Proven experience as full stack developer<br/>\n. Desktop and mobile experience<br/>\n. Familiarity with the TICK stack (Telegraf, InfluxDB, Chronograf and Kapacitor)<br/>\n. HTML, CSS, JavaScript, XML, jQuery<br/>\n. Experience of front end libraries such as Vue, Bootstrap, ReactJS, Angular<br/>\n. Strong Node JS experience and knowledge of Python<br/>\n. API\\'s<br/>\n. MySQL, MongoDB<br/>\n<br/>\n<b>Culture</b><br/>\n<br/>\n. Tech and process driven<br/>\n. Innovative and inquisitive thinking<br/>\n. Flexible, friendly and fun but driven to making the business a success<br/>\n<br/>\n<b>On Application</b><br/>\n<br/>\n. Applicants must be entitled work in the UK<br/>\n. Applicants must be willing to be security vetted</div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.44805239999999, "longitude": -2.5822392}}, {"title": "Data Architect", "company": "Elenor Consulting Limited", "raw_location": "Bristol", "raw_salary": "\n£38,000 a year", "min_salary": 38000.0, "max_salary": 38000.0, "mid_salary": 38000.0, "detail_url": "http://www.indeed.co.uk/company/Elenor-Consulting-Limited/jobs/Data-Architect-277ff5129ab6631f?fccid=a1dd5de0a1bed61d&vjs=3", "description": "[<p>Data Artichet – BigData, Python, Java, Scala, AWS, Kafka, RabbitMQ, Elasticsearch, Spark –</p>, <p>A leading AI software house, based in Bristol, are seeking a Data Architect to join their innovative, data team and work closely with Data Scientists, Analysts, developers, Product etc in an Agile Lean environment.</p>, <p>The successful Data Architect , will be part of a team and participate in technology decisions whilst building scalable, complex data driven models/features in a range of different languages such as Python, Java, Scala along with AWS, Cloudformation, DynamoDB, Druid, Kafka, Elasticsearch, Spark, Airflow etc.</p>, <p>Job Types: Full-time, Permanent</p>, <p>Salary: £38,000.00 /year</p>, <p>Experience:</p>, <ul><li>ETL: 7 years (Preferred)</li></ul>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.454513, "longitude": -2.58791}}, {"title": "Python/ Go Developer £40-60k", "company": "Headforwards", "raw_location": "South West", "raw_salary": "\n£40,000 - £60,000 a year", "min_salary": 40000.0, "max_salary": 60000.0, "mid_salary": 50000.0, "detail_url": "http://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0DuHDjNWw39SJ5e6sYpMBsA1c0MQ32LDXTWEMHTY-Wt9ZQzCHqjxt7ZbJTKCx1V4ZVW3A1qpVUyL8QXEoJ4hRVCx1OkQ-efXv4ZkL56kDwdfFnW1kvWN3Z4r7xDPB0FOGn5FWCfWiAk-dPE92itq021Z0WIkC8FCL4t1sd5Y_4svKGy4BvrkeEnpAwRnJnWBFprdDLJWkwHWljCHJLm80doeB5JY6a5yYh7dF5yoizi3w_whV82kEqIH-67D4b7drjYj6eqylcWkZEJatMAqviP0A1L7KUEz5C2I2hUBarH6N5p_EKHlJGhNXzNSM5GOdNJlJL7eLqxzfZSvr-4wAWJTD-RiqZfsXnwQ_AUF5PZA7-nPSzfORSARwbOyigY3xcyV-YL13cYtqAr4V1qrmAPT_TKMOzHhSW-0TOlVf3zX89I4JHelkiJOjyf57NXlpPK7DusjvVT4Hdy9I5jfKUt47CFPstmERE=&p=0&fvj=1&vjs=3", "description": "[<p><b>Are you a Developer who is keen to bleed the edges of your experience?</b></p>, <p>If so, we would love to hear from you! We are looking for an experienced developer in Python and/or Go to join one of our high performing development teams. If you have good commercial experience in a similar or related language you could also fit in well.</p>, <p><b>We are offering a salary of up to £60,000 depending on experience.</b></p>, <p><b>What will you be doing? </b></p>, <ul><li>You will be joining a fast-moving development team working on the backend of a cutting-edge web application for one of the largest telecoms companies in the world, building and deploying microservices at scale, on a Kubernetes platform, with multiple global regions.</li><li>You will be using and improving our in house continuous delivery pipelines to release new features and functionality to the client.</li></ul>, <p>We are delivering multiple releases every day and working with some pretty exciting technologies alongside fully employing the use of Agile methodologies across the whole business.</p>, <p>You may currently be a Team Lead, or an Architect in your current role and looking for a new challenge.</p>, <p><b>Why work for Headforwards?</b></p>, <ul><li>We are a software development company with just over 100 people from 18 different countries and we like to have fun at work!</li><li>We are agile with a very laid back feel, a relatively flat structure and small self-organising teams of 2-7 people. We work in teams dedicated to various clients and we work on global projects with cutting edge technologies, tools and techniques.</li><li>There\\'s no pressure to work extra hours to churn out more and more code.</li><li>Our culture and environment is dedicated to making people happy at work.</li><li>We live in beautiful Cornwall, our offices are 5 miles from the beach. We want to make sure our people have a good work life balance so that they can enjoy all that Cornwall has to offer : )</li><li>We have lots of social activities and monthly learning sessions, talks and cross company communities of practice for various languages, tools and frameworks.</li></ul>, <p>This is a place where you can make a difference, work in a small team start-up feel but benefit from the support of a larger community of developers and like-minded people.</p>, <p><b>Key Personal Traits</b></p>, <ul><li>You will have been a developer for at least five years</li></ul>, <ul><li>You will have used Python or Go</li><li>You are happy to work as both a Mentor or Leader within a team, and contribute to a wider project team</li><li>We enjoy spirited exchanges of ideas, pushing us towards technical excellence and we expect to hear your voice in these conversations.</li><li>You will be a natural problem solver and able to align business delivery priories against implementation choices.</li><li>You will have the desire and ability to continually learn in improve yourself, and your colleagues.</li></ul>, <p><b>Key Technical Skills</b></p>, <ul><li>Knowledge of relational and / or non-relational (NoSQL) databases (we use MongoDB, Postgres, Redis, InfluxDB)</li><li>Experience of message queues (we use Kafka)</li><li>Experience of container orchestration (we use Kubernetes, Docker)</li><li>An operational mindset with knowledge of high availability, monitoring and diagnostics</li><li>Understanding of the web application stack</li><li>A pragmatic and practical approach to solving business problems</li><li>Exposure to test driven development and integration testing</li><li>Experience working with development team tools (e.g. continuous integration systems (we use Jenkins) and version control systems (we use Git)</li></ul>, <p><b>The closing date for this role is 31st March 2020. We recruit on a rolling basis and fill our vacancies as soon as we find people who fit our culture and meet the skills requirements. This means that whilst we have a closing date on all of our roles, we may offer the role to someone before the end date, so we recommend that you apply as soon as possible.</b></p>, <p>Job Types: Full-time, Permanent</p>, <p>Salary: £40,000.00 to £60,000.00 /year</p>, <p>Experience:</p>, <ul><li>Python: 4 years (Preferred)</li></ul>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 50.2272249, "longitude": -5.2716259}}, {"title": "Junior Python Developer - Trading", "company": "Client Server", "raw_location": "Bristol", "raw_salary": "\n£50,000 - £75,000 a year", "min_salary": 50000.0, "max_salary": 75000.0, "mid_salary": 62500.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=1998d35c0a752edc&fccid=892c145157842ceb&vjs=3", "description": "[<p></p>, <div><div><div>Junior Python Developer / Software Engineer (Trading C++ Linux). One of the most successful proprietary trading forms in the world is seeking a bright, ambitious Junior Python Developer to join their highly accomplished team and work on a strong pipeline of projects.\n<br/>\n<br/>\nAs a Junior Python Developer you\\'ll work on highly complex, deeply technical systems with cross-functional teams who are committed to delivering high quality software releases, business-wide exposure with the chance to benefit from their culture of curiosity and continual learning.\n<br/>\n<br/>\nThe organisation is behind one of the most powerful computing grids in the world, and has asserted its position on the global stage by combining cutting-edge technology and granular data to solve the most complex of technical problems.\n<br/>\n<br/>\nAs a Junior Python Developer, you\\'ll join the rapidly expanding Core Development sector of the business, in a highly collaborative team that designs, codes, tests and maintains the high performance distributed systems that powers their trading operation. You\\'ll work directly with a close-knit team to deploy critical features to the trading platform with the opportunity to benefit from accomplished senior colleagues.\n<br/>\n<br/>\n*Please note: this company is able to conduct an entirely remote interview process during the current circumstances*<br/>\n<br/>\nRequirements:<br/>\n<ul><li>You\\'re degree educated (2.1 or above, BSc / MSc / PhD)\n</li><li>You have strong Python coding ability\n</li><li>You have a thorough understanding of Computer Science fundamentals like OOP, Data Structures, threading models and networking\n</li><li>You\\'re naturally analytical and approach complex technical problems in a logical, thoughtful manner\n</li><li>You\\'re a positive team player who enjoys working collaboratively\n</li><li>Desirable: C++ skills\n</li></ul><br/>\nAs a Junior Python Developer you\\'ll earn a highly competitive salary (to £75k) plus bonus and a comprehensive benefits package.\n<br/>\n<br/>\nApply now or call for a confidential discussion about this Junior Python Developer / Software Engineer (Trading C++ Linux) opportunity.</div></div></div>, <p></p>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.454513, "longitude": -2.58791}}, {"title": "Full Stack Applications Developer", "company": "Graphcore", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/pagead/clk?mo=r&ad=-6NYlbfkN0B2LP6KtwgLMWcIJbzQK4y118hUYa2NHT0ELzb4aR6nDrO9_32R0LtazQt5Ev9ntbMF67x-uIqCFBIaSgF3Jr_RlBZttv17jHoO36gbiKCViwKMlso9PTYyZrCltqyWFf2M33tYYDFxulDCuG005fjA9bOKTyD0CWzIrw-icr-yXFjrwYvhunqWAvVlQR4NmQ62IFeMIOSqfleiAN_d-pQ4MQpqfXtD7RMR_UwmdV2R4qLN7ak_e1Cdndnn1q6R_NzrewPKjxabZkmhvcpm2VyvZ8vrVLv4lcISYo9CkFyW1dctUV_eodaGDSVSaXkY3ViYgb_QP97-rlL8LLzGmYgoomoDSO5mvy2gLWY7h6Cl-ytDCGQoDaeTRJTmXaRGHkuNTEsRF-27ASDrpaGJ8owyI1fr6Too3lfGPAyG6v_IWS_wWBqrUWxk&p=2&fvj=0&vjs=3", "description": "[<div><b>Full Stack Applications Developer, Full-Time, Bristol</b>\n<br/>\n<br/>\nGraphcore has created a completely new processor, the Intelligence Processing Unit (IPU), specifically designed for artificial intelligence. The IPU\\'s unique architecture means developers can run current machine learning models orders of magnitude faster. More importantly, it lets AI researchers undertake entirely new types of work, not possible using current technologies, to drive the next great breakthroughs in general machine intelligence.\n<br/>\n<br/>\nWe believe our IPU technology will become the worldwide standard for artificial intelligence compute. The performance of Graphcore\\'s IPU is going to be transformative across all industries and sectors whether you are a medical researcher, roboticist or building autonomous cars.\n<br/>\n<br/>\nOur team is at the forefront of the artificial intelligence revolution, enabling innovators from all industries and sectors to expand human potential with technology. What we do, really makes a difference.\n<br/>\n<br/>\nThe Full-Stack Application Developer will contribute by supporting the planning and release procedures, by designing, scoping and building a number of critical tools and applications. You will be involved in creating a visual tool for release and features planning, release automation, UI to a number of systems to simplify, expand and improve the SDLC of the whole SW engineering and Product team.\n<br/>\n<br/>\nIdeally, you are an expert in full-stack applications space and will be instrumental in the improvements and capabilities of the day-by-day work in Graphcore.\n<br/>\n<br/>\nYou will work with the Release Manager, collect requirements from the Product team. You will be closely involved with the DevOps team and the whole SW engineering while shaping the future SDLC. Everything you will build will be used by hundreds of developers across the globe, to deliver the latest AI technology.<br/>\n<h2 class=\\\"jobSectionHeader\\\"><b>\nResponsibilities</b></h2>\n<ul><li>Develop applications and tools in full-stack, cross-platform, environment.</li>\n<li>Ability to build an application from scratch: from design to deployment</li>\n<li>Ability to design efficient and effective UIs</li>\n<li>Working with an Agile scrum methodology, breaking work down in epics and stories</li>\n</ul><h2 class=\\\"jobSectionHeader\\\"><b>Key Skills</b></h2>\n<ul><li>Passion driven, goal-oriented and \\\"Can do\\\" attitude</li>\n<li>Experience of full-stack cross-platform environment: Linux/MacOS/Windows</li>\n<li>Intimate familiarity of version control, specifically git</li>\n<li>Ability to build complex applications in Python, PHP, bash</li>\n<li>Knowledge of SQL and relational databases like MySQL or SQLite</li>\n<li>Comfortable in understanding opensource tools and build extensions for them</li>\n<li>Ability to interface with opensource communities as needed</li>\n</ul>Please note, we are only considering candidates who have an established right to work in the UK for roles based in Bristol, UK\n<br/>\n<br/>\nWe welcome people of different backgrounds and experiences and are committed to building an inclusive work environment that makes Graphcore a great home for everyone. We are an equal opportunity employer and want to build a work environment where everyone is happy, productive and respectful, so they can do their best work. If you have a disability or additional need that requires accommodation, just let us know.</div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4552872, "longitude": -2.5923872}}, {"title": "Backend Developer (Python)", "company": "Chronomics", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=128236f9aae020a8&fccid=be1fa4c3e40ce18e&vjs=3", "description": "[\\'Our mission\\n\\', <br/>, <br/>, \\'\\nWant to make a difference in this world and work on something meaningful? At Chronomics we enable people to quantify how their environment and lifestyle is affecting their health to live healthier and happier lives… all from their DNA. We will love you because…\\n\\', <br/>, \\'You’re an expert coder in at least 1 language (Python/PHP/Node.js).\\n\\', <br/>, \\'You have a product mindset and understand creating value, not features.\\n\\', <br/>, \\\"And most of all you\\'r enthusiastic and get shit done. Working in a product focused cross functional team alongside other developers, designers, data scientists and bioinformaticians you will take ownership of projects and get to work on a cutting edge microservice architecture using serverless working with HUGE data (each DNA sample is 100GB…) to build a ground breaking epigenetics platform which is the first of its kind in the world. We built to ship, we ship fast and then we learn and iterate. With a can-do attitude and a strong product mentality you are happy to jump in and get your hands dirty which could be anything from learning GO, building a Lambda microservice or optimizing an AWS pipeline. You will get the chance to work with numerous different technologies, have a say in how we drive the company forward and learn a ton of science along the way. Essential skills:\\n\\\", <br/>, <br/>, \\'\\nCan write secure, scalable, readable code in at least one or two languages\\n\\', <br/>, \\'Experience designing and scaling databases\\n\\', <br/>, \\'Designing, building, consuming AND documenting REST APIs\\n\\', <br/>, \\'Cloud platforms (AWS)\\n\\', <br/>, \\'Happy on the command line\\n\\', <br/>, \\'Agile development\\n\\', <br/>, \\'Test automation\\n\\', <br/>, \\'Familiarity with mobile and web development\\n\\', <br/>, <ul>\n<li>Work as part of a focused team, but at the same time self-driven and able to work independently Nice to have:</li>\n</ul>, \\'\\nSome dev ops (CI/CD/Docker)\\n\\', <br/>, \\'Infrastructure as code (Terraform/CloudFormation)\\n\\', <br/>, \\'Experience with other languages such as Python/JavaScript (React/Node) etc\\n\\', <br/>, \\'Serverless experience\\n\\', <br/>, \\'Experience with big data\\n\\', <br/>, \\'Experience working on high scalability websites\\n\\', <br/>, \\'Have worked with genetics data\\n\\', <br/>, \\'Experience with serverless and microservices architecture\\n\\', <br/>, \\'Graph Databases\\n\\', <br/>, <b>Location:</b>, \\' Bristol, London, Cambridge or part remote Start date: 1st Jan 2020 onwards Company size: 10-20 people Company type: VC funded\\n\\', <br/>, <br/>, \\'\\nBenefits\\n\\', <br/>, <br/>, \\'\\nShare options so early contributors benefit from our success.\\n\\', <br/>, \\'Epigenetic test!!\\n\\', <br/>, \\'Flexible office or home working.\\n\\', <br/>, \\'Macbook pro\\n\\', <br/>, \\'Friday pub sessions.\\n\\', <br/>, \\'About Us\\n\\', <br/>, <br/>, \\'\\nChronomics is an ambitious health tech start-up that believes people should be in charge of their own health. Health management should be proactive, not reactive and it should be personalised. We are using longitudinal biological data to bring about this revolution. A revolution where not only will people be in control of their own future but also in control of how they contribute to the future of humanity through the use of their data.\\n\\', <br/>, <br/>, \\\"\\nThis product is just the first step towards a platform technology that will serve as the interface between the biological and digital world. It\\'s an incredibly exciting time to come on board where you can really make a difference. Find out more at www.chronomics.com\\\"]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.5166006, "longitude": -0.2254268}}, {"title": "Entry Level GIS Professional", "company": "Geollect Limited", "raw_location": "Bristol", "raw_salary": "\n£18,000 - £22,500 a year", "min_salary": 18000.0, "max_salary": 22500.0, "mid_salary": 20250.0, "detail_url": "http://www.indeed.co.uk/company/Geollect/jobs/Entry-Level-GIS-Professional-7aa2c691079199be?fccid=9b81b6ebc61889fd&vjs=3", "description": "[<p><b>Geospatial Analyst - Entry Level</b><br/>Geollect is an agile geospatial intelligence and analysis company, providing dynamic insights for decision support to a network of global clients in the defence, maritime insurance and cruise industries. We are looking for an ambitious candidate who has a passion for GIS, loves a good challenge, and wants to be part of a rapidly growing company.</p>, <p><b>Job Description</b></p>, <p>The successful candidate will form an integral part of the geospatial analytical team, working on multiple projects across a diverse range of sectors. We are looking for someone who can embrace each challenge with enthusiasm as a team player or independently with a strong will to succeed. You will be required to analyse and interpret multiple data layers using innovative techniques to assist in the automation and quality control of Geollect\\'s suite of products. You will leverage all available datasets, including, but not limited to, satellite imagery, infrastructure data, news and social media, maritime vessel locations, third-party APIs and crowd-sourced data. The analytical team are looking for relationships in the data, patterns of life and anomalies to provide powerful insights within a comprehensive operating picture to help our clients identify operational risk and opportunities. You will also work closely with the data scientists, data engineers and web developers.</p>, <p>This opportunity is perfect for a GIS (or related subject) graduate, who wants to develop a keen understanding of how geospatial technology is applied in a commercial setting. For the right employee, this role provides the opportunity to grow into leadership positions as the company scales.</p>, <p>You are encouraged to apply even if you don\\'t meet all of the requirements below. Geollect are building a team that fit together well, and are open to a variety of skills and levels of experience. Candidates are welcome to get in touch for further information prior to application.</p>, <p><b>Required Skill Sets</b></p>, <p><i>GIS analysis qualifications</i></p>, <ul><li>ArcGIS suite of products experience</li><li>ArcGIS Online experience</li><li>Web Mapping Service (WMS) knowledge</li><li>Web Feature Service (WFS) knowledge</li><li>JSON knowledge</li><li>SQL knowledge</li><li>Data entry, conversion and maintenance</li><li>Metadata creation and editing</li><li>Portability of skills on multi-platforms</li><li>Basic understanding of programming</li></ul>, <p><i>Other qualifications</i></p>, <ul><li>Ability to work effectively from a remote location</li><li>Ability to quickly learn sector-specific information to better exploit available datasets</li><li>Apply skill sets and expertise in multiple domains</li><li>Creative thinking with attention to detail</li><li>Innovative and proactive approach to problem solving</li><li>Evidence of continued personal and professional development</li></ul>, <p><i>Desired Skillsets</i></p>, <ul><li>Programming language (Python, .Net)</li><li>Imagery exploitation training or equivalent experience</li><li>GIS workflows - model building</li><li>GIS architecture (web and desktop)</li><li>Knowledge of SAR exploitation</li><li>Ability to translate user needs to solutions</li><li>Ability to present solutions in a simplistic visual manner</li><li>Clear, concise communication skills</li><li>Customer support skills</li></ul>, <p>Benefits:</p>, <ul><li>On-site parking</li><li>Flexible working hours</li><li>Sick pay</li><li>Bonus scheme</li><li>Casual dress</li><li>Company events &amp; social hours</li></ul>, <p>Job Types: Full-time, Contract, Permanent</p>, <p>Salary: £18,000.00 to £22,500.00 /year</p>, <p>Experience:</p>, <ul><li>ArcGIS: 1 year (Preferred)</li><li>GIS: 1 year (Preferred)</li></ul>, <p>Education:</p>, <ul><li>Bachelor\\'s (Preferred)</li></ul>, <p>Location:</p>, <ul><li>Bristol, Bristol (Required)</li></ul>, <p>Language:</p>, <ul><li>English (Required)</li></ul>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.454513, "longitude": -2.58791}}, {"title": "Python Developer", "company": "Explore Group", "raw_location": "Bath", "raw_salary": "\n£25,000 - £60,000 a year", "min_salary": 25000.0, "max_salary": 60000.0, "mid_salary": 42500.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=ddd4b0b1dbdb5489&fccid=f877f9ab98439bf6&vjs=3", "description": "[\\'After being acquired by a multi-billion dollar company headquartered in America, a software development company based in Bath are looking for a number of Python Developers as they expand.\\n\\', <br/>, <br/>, \\'\\nThis company have revolutionised the retail area, by creating an in-house product that is monitored by a central server. This product has distributed networks of virtualized and containerized services, that gives the client the instruments for Cloud Management in an onsite premise. They use Python, React as well as a number of other technologies and now that they have had great success in the roll out of their product, are looking for several developers at this exciting turning point for the company.\\n\\', <br/>, \\'You will be working on both new and existing areas of the product, with a chance to use a wide range of technologies. They are looking for Fullstack Python Developers from no commercial experience upwards, where you will produce code that is clean, create test-cases for functionality as well as a multitude of other tasks, all within an office in central Bath.\\n\\', <br/>, <br/>, \\'\\n\\', <b>If you have these you could be a great fit:</b>, <br/>, \\'\\nPython experience\\n\\', <br/>, \\'React experience\\n\\', <br/>, \\'Computer Science degree (or similar)\\n\\', <br/>, <b>Now, let\\'s talk numbers:</b>, \\' £25-60k DOE\\']", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.3810641, "longitude": -2.3590167}}, {"title": "Data Scientist", "company": "Toumetis", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=bad349f4892ea944&fccid=1408f3873505835f&vjs=3", "description": "[<div><p>Toumetis Job Description</p><br/>\n<p></p>\n<p>\nData Scientist</p><br/>\n<p></p>\n<p>\nSalary DOE</p><br/>\n<p></p>\n<p>\nAbout our Company - Our mission at Toumetis is to deliver intelligence that can transform business operations and enable new revenue via the application of machine learning. We combine experience in applied machine learning, frontend development, data engineering, and cloud computing to help Fortune-1000 companies bring elegant IoT solutions to life, surfacing unique insights to predict and prevent problems and improve organisational performance. Our engineers, developers and data scientists share a passion for innovation and are dedicated to providing our customers with solutions that enable new insights that revolutionise business processes. We have a friendly working environment with flexible hours, regular social events, great coffee and snacks, free parking, ride to work scheme, bike racks, shower facilities and you will be supplied with a MacBook Pro.</p><br/>\n<p></p>\n<p>\nThe ideal candidate will have several years experience working commercially as a Data Scientist, with a keen interest to apply data science and machine learning working in client facing roles. You will be a key member of fast paced teams. Working alongside data engineers, front end developers and UX designers, you will be tasked with getting your algorithms into production on our real time analytics platform. You should be open to learning and using data science techniques on other applications.</p><br/>\n<p></p>\n<p>\nResponsibilities / Job Role</p>\n<ul>\n<li>Gaining a detailed understanding of client business issues.</li>\n<li>Exploratory data analysis.</li>\n<li>Cleaning, transforming and fusing large raw data sets.</li>\n<li>Model development and performance evaluation.</li>\n<li>Deploying models in production environments.</li>\n<li>Continuous evaluation and improvement of models in production.</li>\n<li>Keeping up to date with the latest tools, methods &amp; technologies</li><br/>\n</ul><p></p>\n<p>\nKey Skills / Experience</p>\n<ul>\n<li>Knowledge of python for data analysis and machine learning (pandas, numpy, scikit-learn, tensorflow, keras, etc.).</li>\n<li>Demonstrable machine learning experience (supervised/unsupervised) such as developing and deploying deep learning solutions relating to time series, NLP, video, and images.</li>\n<li>Knowledge in visualizing and presenting complex data and information.</li>\n<li>Exposure to working with large, complex and messy data sets.</li>\n<li>Capability to communicate complex concepts and data patterns to non-technical audiences.</li>\n<li>Experience or an interest to work in cloud-based development, test &amp; production environments.</li>\n</ul>\n<p>You’ll also have access to company paid training services as we’re keen for you to grow your skills.</p></div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4470004, "longitude": -2.6086458}}, {"title": "Software Developer Trainer - Mayden Academy", "company": "Mayden", "raw_location": "Bath", "raw_salary": "\n£30,000 - £50,000 a year", "min_salary": 30000.0, "max_salary": 50000.0, "mid_salary": 40000.0, "detail_url": "http://www.indeed.co.uk/company/Mayden/jobs/Software-Developer-Trainer-dfedd1c031d61796?fccid=2d4c73d1e68cf818&vjs=3", "description": "[<p><b>Software developer trainer</b></p>, <p><b>Are you an enthusiastic programmer looking for a new challenge? Come and work with us to help change people’s lives!</b></p>, <p><b>We run a 16 week coding course which turns newbies into junior developers, then get them great jobs which we know they’ll love. As an Academy trainer you’ll mainly focus on teaching - being a coach, mentor and trainer for your students while they learn the skills that will start their new careers.</b></p>, <p><b>Outside of course times, you’ll work with the other trainers to update the curriculum, develop new workshops, assess student applications, run coding sessions for schools and events, deliver bespoke training for tech companies, and work with our hiring partners to find great jobs for your students after they graduate.</b></p>, <p><b>All of our trainers are given their own training, shadowing on the full 16 week Full Stack Track before they begin with their own class. So don’t worry if you’ve never taught before, or don’t know our exact stack. We’ll support you. </b></p>, <p><b>The most important thing is that you’ve got real world experience as a programmer, and want to do something a bit different to help give people a new start in life.</b></p>, <p><b>About you</b></p>, <p><b>You’ll have worked as a professional software developer for at least a couple of years, with experience on real client projects. You will have helped support your team with difficult problems and be happy helping junior developers. You will have skills in OOP and be comfortable programming for the web with a back-end language, working with current industry standard technologies. </b></p>, <p><b>You will have experience with a range of development tools as well as experience of methodologies such as agile, pair programming and code reviews.</b></p>, <p><b>We’re not concerned with what language/s you use, as long as you have the experience and are happy to learn our own languages (PHP, Node.js and Javascript). </b></p>, <p><b>It doesn’t matter whether you use C, C++, C#, Ruby, Java, Python, Go, Swift or anything else – the most important thing is that you’re a friendly, motivated team player who wants to help people. We’re all about changing lives, and hope you are too. </b></p>, <p><b>About us</b></p>, <p><b>We are all about people. We train people of all ages and backgrounds to code, giving them everything they need to know to land their first job as a junior software developer. We work hard to make sure our course is as inclusive as possible, and help to make positive change in the tech industry. Our graduates consistently tell us that their time at the Academy was one of the best in their lives. </b></p>, <p><b>Our small classes mean you’ll get to know your students really well, and you’ll be part of a welcoming and fun team.</b></p>, <p><b>Our offices are based in a historic building in beautiful Bath. It’s a 10 minute walk from the train station, with incredible views over the city and a lovely big garden. We’ve got break-out rooms with comfy sofas, books, board games and Mario Kart, and a big kitchen with tea, coffee, toast and fruit.</b></p>, <p><b>We pride ourselves on having created a happy place to work with a strong sense of value and purpose. You’ll be working alongside award-winning trainers and mentors in a team of people who love what they do. And you’ll be making a genuine difference to people’s lives.</b></p>, <p><b>Interested?</b></p>, <p><b>Just send a CV and a cover letter saying why you’d like to work with us. We’d love to hear from you.</b></p>, <p><b>Must be eligible to live and work in the UK.</b></p>, <p><b>Salary: Competitive DOE Plus Benefits</b></p>, <p><b>STRICTLY NO AGENCIES</b></p>, <p>Job Types: Full-time, Permanent</p>, <p>Salary: £30,000.00 to £50,000.00 /year</p>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.3740822, "longitude": -2.3785498}}, {"title": "Engineering Software Developer", "company": "DNV GL AS", "raw_location": "Bristol BS2", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=e7dc19595b875eab&fccid=e11925963c0b831e&vjs=3", "description": "[<div>Local Unit &amp; Position Description:<div>\nThe Loads, Aero &amp; Control (LAC) department - part of the Renewables Advisory Service Area within DNV GL Energy - is looking for a scientific/ engineering software developer to support the maintenance and development of our wind turbine control system and load analysis software products.</div><div></div><br/>\n<div>\nThe primary focus of this role is to provide software expertise to the maintenance and development of our in-house software and to contribute towards the digitalization of our services. The LAC department consists of 24 engineers delivering engineering consultancy services in the area of loads analysis and control system design for wind turbines. The same services are also offered in wave and tidal energy markets. The main customers are wind turbine manufacturers; however, the department also offers engineering services to support wind farm developers, owners and operators.</div><div></div><br/>\n<div>\nThe role is based in our Bristol office and will involve occasional travel worldwide for client visits, training delivery and attendance at conferences / events.</div><div></div><br/>\n<div><b>\nAreas of Responsibility / Key Tasks:</b></div><div>\nWe are looking for a software developer with a physics or engineering background and a desire to work within a dynamic team and participate in discovery, design and software development. This involves working closely with other developers or engineering specialists, and occasionally with clients and partners.</div><div><br/>\nThe successful applicant will be a skilled C++ and Python developer who will join a team of engineers working on both wind turbine control design and load analysis and able to perform and coordinate software design to high quality standard using appropriate architecture and tools.</div><div></div><br/>\n<div>\nKey upcoming goals for the wind turbine control system software (main language C++)</div><ul><li>Enhance the existing C++ code base and code generation system based around xml files &amp; XSLT\n</li><li>Review the code structure and develop it to achieve better modularity and robustness\n</li><li>Create and maintain automatic code test suite on DevOps</li><li>Extend the code to support new target PLC platforms and implement new control system functionality in collaboration with control engineers</li></ul><div></div><br/>\n<div>\nKey upcoming goals for the wind turbine and wind farm load analysis tool (main languages Matlab, Python and C++)</div><ul><li>Develop appropriate software architecture/frameworks and ensure consistency in any development performed by the team\n</li><li>Harmonize software development across the team into a common platform</li><li>Implement new functionalities in collaboration with load engineers</li><li>Design suitable digital apps to facilitate data and software sharing both internally and with external customers</li></ul><div></div><br/>\n<div>\nThe role includes responsibility for both direct communications with customers and technical aspects of the work.</div><div><br/>\nInternational travel in the region of 1-2 travels per year is to be expected. This will be for 2-3 day sessions for client meetings and delivery of training. DNV GL has a mature international travel safety policy and follows UK Foreign Office advice at all times.</div><div></div><br/>\nPosition Qualifications:<div>\nRequired:<br/>\n<ul><li>At least an upper second-class degree or equivalent in physics, engineering, computer science, or similar numerate subject</li><li>High level of competence in software design for good structure, testability, and maintainability</li><li>Good knowledge of C/C++, including cross-platform portability issues</li><li>Design and implementation experience with real-time embedded software systems E.g. in aviation, automotive or wind turbines</li><li>Good knowledge of Python, Matlab</li><li>Good knowledge of source code control systems and automated testing</li><li>Years of experience in one of the fields mentioned above</li></ul><br/>\nDesirable:<br/>\n(this is a broad range of expertise; we do not expect a candidate to have high levels of expertise in all of these)<br/>\n<ul><li>Experience with TFS, DevOps or similar SaaS platforms</li><li>Real-time Linux</li><li>Network protocols including Ethernet, IP, TCP, UDP and HTTP.</li><li>C#, CLI, .NET framework\n</li><li>XML, XSLT</li><li>PLCs and IEC 61131 programming</li></ul></div><div></div><br/>\n<div><b>\nWe offer:</b><br/>\n<ul><li>Interesting and challenging multidisciplinary projects – regional and international</li><li>Work with dedicated and competent colleagues with a high experience and specialization level in an international environment</li><li>Be part of a global company with 13 000 employees, world leading professional networks and diverse internal job opportunities</li><li>The possibility to grow and develop your competencies and ambitions within DNV GL</li><li>Focus on good work and life balance</li></ul></div>\nCompany &amp; Business Area Description:<div>\nDNV GL is a global quality assurance and risk management company. Driven by our purpose of safeguarding life, property and the environment, we enable our customers to advance the safety and sustainability of their business.\n<br/>\n<br/>\nWe provide classification, technical assurance, software and independent expert advisory services to the maritime, oil &amp; gas, power and renewables industries. We also provide certification, supply chain and data management services to customers across a wide range of industries.</div><div></div><br/>\n<div>\nCombining technical, digital and operational expertise, risk methodology and in-depth industry knowledge, we empower our customers’ decisions and actions with trust and confidence. We continuously invest in research and collaborative innovation to provide customers and society with operational and technological foresight.\n<br/>\n<br/>\nWith origins stretching back to 1864 and operations in more than 100 countries, our experts are dedicated to helping customers make the world safer, smarter and greener.</div><div></div><br/>\n<div>\nDNV GL delivers world-renowned testing and advisory services to the energy value chain including renewables and energy efficiency. Our expertise spans onshore and offshore wind power, solar, conventional generation, transmission and distribution, smart grids, and sustainable energy use, as well as energy markets and regulations. Our experts support customers around the globe in delivering a safe, reliable, efficient, and sustainable energy supply.</div><div></div><br/>\nEqual Opportunity Statement:<div>\nDNV GL is an Equal Opportunity Employer and gives consideration for employment to qualified applicants without regard to gender, religion, race, national or ethnic origin, cultural background, social group, disability, sexual orientation, gender identity, marital status, age or political opinion. Diversity is fundamental to our culture and we invite you to be part of this diversity!</div></div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.452105, "longitude": -2.579475}}, {"title": "Python Developer", "company": "+1 location", "raw_location": "Bristol", "raw_salary": "\n£45,000 - £55,000 a year", "min_salary": 45000.0, "max_salary": 55000.0, "mid_salary": 50000.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=b74c0444f5ddc94e&fccid=e884fac1a9f6027b&vjs=3", "description": "[\\'Varied project base all centred on Data Science/IoT.\\n\\', <br/>, \\'Ambitious growth period with scope to get from 30 to 100 in the next 2 years.\\n\\', <br/>, \\'International customer base working with a diverse range of household names.\\n\\', <br/>, <br/>, \\'\\nA well-reputed predictive analytics & application consulting provider is going through a rapid period of growth and are looking for Python Developers to join their team. Born in America, the Bristol office is now at c30 (developers, testers, data scientists/engineers) with scope to get to 50 in 2020, and 100 in the next 2 years. They operate in a highly Agile environment, working with an incredibly diverse & global customer base spread across the UK, Australia, Canada, Germany, Mexico, Spain & Monaco. The business are constantly looking to integrate new & emerging technologies into the business, a lot of their techies are customer facing as well.\\n\\', <br/>, <br/>, \\\"\\nWhat skills you\\'ll need\\n\\\", <br/>, <br/>, \\'\\nProven Python development experience, preferably with an interest in data science/visualisation.\\n\\', <br/>, \\'Back-end focused with an appreciation for front-end technology. Understanding of React/TypeScript.\\n\\', <br/>, \\'Significant knowledge of infrastructure-as-code (Terraform).\\n\\', <br/>, \\'Containerisation experience (Docker, Kubernetes).\\n\\', <br/>, \\'Awareness of cloud technology, particularly with AWS.\\n\\', <br/>, \\'Any understanding of FastAPI, Git or Postgres would be beneficial.\\n\\', <br/>, \\'Extensive knowledge of Agile/Scrum methodologies and ability to work in a highly Agile environment.\\n\\', <br/>, <br/>, \\\"\\nWhat you\\'ll be doing\\n\\\", <br/>, <br/>, \\'\\nJoining a small development team in the data science division of the business, you will take ownership of a high-level data science platform which will need a service-based architecture built to allow adaptation of requirements depending on the particular customer. This role is primarily server-side focused but you will need to offer enthusiasm for the front-end and will offer support with React/TypeScript as and when needed. The solution will be deployed on AWS using Docker & Terraform; it ingests & processes data from various sources and then cascades it back to their stakeholders. There will be some backlog work to involve yourself in initially but then the focus will be on adding new features/functionalities to the platform. You will need to grasp technical details quickly, familiarising yourself with the design & architecture of any given project so you can adjust your approach to best support the customer’s requirements\\n\\', <br/>, <br/>, \\\"\\nWhat you\\'ll get in return for your experience\\n\\\", <br/>, <br/>, \\'\\nThe company offer a very relaxed & casual environment, offering flexible working hours (core day is 10am – 4pm) and plenty of scope for training & progression. As the business expands there could be scope to move into more of a lead position depending on which way you see your career going, and they encourage their employees to go on a range of training courses & tech conferences. They’re offering a generous salary, healthy pension scheme and free food in the office. It really does have the culture of a start-up but with the backing of a large international business!\\n\\', <br/>, <br/>, \\'\\nWhat next?\\n\\', <br/>, <br/>, \\\"\\nThis is a fantastic opportunity to work for an amazing company, so if you\\'re interested, send your CV to Joe ASAP or give us a call to find out more.\\\"]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4087315, "longitude": -2.5799254}}, {"title": "Software Developer Trainer", "company": "Mayden", "raw_location": "Bath", "raw_salary": "\n£30,000 - £50,000 a year", "min_salary": 30000.0, "max_salary": 50000.0, "mid_salary": 40000.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=f82f8cd0cf14dfe3&fccid=c3c454cd2a9999ad&vjs=3", "description": "[<div><p><b>Salary: </b>£30,000 - £50,000<br/>\n</p><p><b>\nLocation: </b>Bath<br/>\n</p><p>\nAre you an enthusiastic programmer looking for a new challenge? Come and work with us to help change people’s lives!</p>\n<p>\nWe run a 16 week coding course which turns newbies into junior developers, then get them great jobs which we know they’ll love. As an Academy trainer you’ll mainly focus on teaching – being a coach, mentor and trainer for your students while they learn the skills that will start their new careers.</p>\n<p>\nOutside of course times, you’ll work with the other trainers to update the curriculum, develop new workshops, assess student applications, run coding sessions for schools and events, deliver bespoke training for tech companies, and work with our hiring partners to find great jobs for your students after they graduate.</p>\n<p>\nAll of our trainers are given their own training, shadowing on the full 16 week Full Stack Track before they begin with their own class. So don’t worry if you’ve never taught before, or don’t know our exact stack. We’ll support you.</p>\n<p>\nThe most important thing is that you’ve got real world experience as a programmer, and want to do something a bit different to help give people a new start in life.</p>\n<p><b>\nAbout you</b></p>\n<p>\nYou’ll have worked as a professional software developer for at least a couple of years, with experience on real client projects. You will have helped support your team with difficult problems and be happy helping junior developers. You will have skills in OOP and be comfortable programming for the web with a back-end language, working with current industry standard technologies.</p>\n<p>\nYou will have experience with a range of development tools as well as experience of methodologies such as agile, pair programming and code reviews.</p>\n<p>\nWe’re not concerned with what language/s you use, as long as you have the experience and are happy to learn our own languages (PHP, Node.js and Javascript).</p>\n<p>\nIt doesn’t matter whether you use C, C++, C#, Ruby, Java, Python, Go, Swift or anything else – the most important thing is that you’re a friendly, motivated team player who wants to help people. We’re all about changing lives, and hope you are too.</p>\n<p><b>\nAbout us</b></p>\n<p>\nWe are all about people. We train people of all ages and backgrounds to code, giving them everything they need to know to land their first job as a junior software developer. We work hard to make sure our course is as inclusive as possible, and help to make positive change in the tech industry. Our graduates consistently tell us that their time at the Academy was one of the best in their lives.</p>\n<p>\nOur small classes mean you’ll get to know your students really well, and you’ll be part of a welcoming and fun team.</p>\n<p>\nOur offices are based in a historic building in beautiful Bath. It’s a 10 minute walk from the train station, with incredible views over the city and a lovely big garden. We’ve got break-out rooms with comfy sofas, books, board games and Mario Kart, and a big kitchen with tea, coffee, toast and fruit.</p>\n<p>\nWe pride ourselves on having created a happy place to work with a strong sense of value and purpose. You’ll be working alongside award-winning trainers and mentors in a team of people who love what they do. And you’ll be making a genuine difference to people’s lives.</p>\n<p>\nInterested?</p>\n<p>\nJust send a CV and a cover letter saying why you’d like to work with us. We’d love to hear from you.</p>\n<p>\nMust be eligible to live and work in the UK.</p>\n<p><b>\nSalary: £30-50k Plus Benefits</b></p>\n<p><b>\nSTRICTLY NO AGENCIES</b></p></div>, <p></p>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.3740822, "longitude": -2.3785498}}, {"title": "Senior Python Developer", "company": "Toumetis", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=f54f8cf6292107ea&fccid=1408f3873505835f&vjs=3", "description": "[<div><p>TouMetis Job Description</p><br/>\n<p></p>\n<p>\nSenior Python Developer</p><br/>\n<p></p>\n<p>\nSalary DOE</p><br/>\n<p></p>\n<p>\nAbout our Company Our mission at Toumetis is to deliver intelligence that can transform business operations and enable new revenue via the application of machine learning. We combine experience in applied machine learning, frontend development, data engineering, and cloud computing to help Fortune-1000 companies bring elegant solutions to life, surfacing unique insights to predict and prevent problems and improve organisational performance. Our engineers, developers and data scientists share a passion for innovation and are dedicated to providing our customers with solutions that enable new insights that revolutionise business processes. We have a friendly working environment with flexible hours, regular social events, great coffee and snacks, free parking, ride to work scheme, bike racks, shower facilities and you will be supplied with a MacBook Pro.</p><br/>\n<p></p>\n<p>\nJoining the Cascadence development team you will work closely with the data science team to deploy data science models. We’re building a service based architecture that gives us flexibility so that we can adapt to the requirements of each customer. We’re deploying on AWS using Docker and Terraform.</p>\n<p>\nWe’re looking for someone with roughly 3 years of professional experience with Python, an interest in data science and data visualisation is a bonus. You’ll be working in a small team of developers who are working in an Agile development process. We’re looking for someone keen to take advantage of opportunities to develop their skills and to suggest ways to improve our code and our products.</p><br/>\n<p></p>\n<p>\nIf you have good experience with any or all of our tech stack then please get in touch!</p>\n<p>\nTech we use</p>\n<ul><li>Python 3</li></ul>\n<ul><li>FastApi</li></ul>\n<ul><li>AWS</li></ul>\n<ul><li>Docker</li></ul>\n<ul><li>Terraform</li></ul>\n<ul><li>React.js (with Redux)</li></ul>\n<ul><li>Typescript</li></ul>\n<ul><li>Git</li></ul>\n<ul><li>Postgres</li></ul><br/>\n<p></p>\n<p>\nYou’ll also have access to company paid training services as we’re keen for you to grow your skills.\n<br/>\n<br/>\nFor a confidential discussion about this role, or if you feel your skillset would be of benefit to the TouMetis team but doesn’t match a specific job spec, please get in touch with our Talent Acquisition team - george.wrightson@Toumetis.com/ 07853 926 928</p></div>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4470004, "longitude": -2.6086458}}, {"title": "Vulnerable Application Developer (Contract)", "company": "Immersive Labs", "raw_location": "Bristol", "raw_salary": null, "min_salary": null, "max_salary": null, "mid_salary": null, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=2d2b1d960d8bc910&fccid=8f8f3106603d3e52&vjs=3", "description": "[\\'Contract\\n\\', <br/>, <br/>, \\'\\nDo you enjoy building Capture the Flag (CTF) style challenges?\\n\\', <br/>, <br/>, \\'\\nCan you write web applications in various languages and understand how to improve the security of your code?\\n\\', <br/>, <br/>, \\'\\nDo you want to help others overcome coding challenges and educate people on coding vulnerabilities?\\n\\', <br/>, <br/>, \\'\\nWe are looking for engineers on a contract basis either Bristol based or remotely (with regular visits to the Bristol office) to write deliberately vulnerable web applications for Immersive Labs and help us educate developers around the world on how to fix vulnerabilities in their code and engineer more secure applications.\\n\\', <br/>, <br/>, \\'\\nThe opportunity\\n\\', <br/>, <br/>, \\\"\\nAt Immersive Labs, we\\'ve just launched our latest offering - Secure Coding. This exciting new addition to our market-leading platform teaches developers how to write secure code. We are creating labs that take our users from the basics of writing a secure application avoiding the standard OWASP pitfalls through to building secure public cloud-hosted web apps.\\n\\\", <br/>, <br/>, \\'\\nThe first set of secure coding labs are live and loved by our users, we are now looking to expand our offering to drive this forward!\\n\\', <br/>, <br/>, \\'\\n\\', <b>Your main responsibilities:</b>, <br/>, \\'\\n\\', <ul>\n<li>Develop deliberately vulnerable applications</li>\n<li>Develop a set of resources to help users understand the vulnerabilities for each lab and how to mitigate them</li>\n<li>Develop an automated set of tests that can verify that the user has fixed a given vulnerability</li>\n<li>Plan, write, test and improve secure coding labs in the Immersive Labs platform</li>\n<li>Understand the learning process for software developers to challenge and teach them through Immersive Labs</li>\n</ul>, \\'\\n\\', <b>To be successful:</b>, <br/>, \\'\\n\\', <ul>\n<li>Software Development experience across one or all of the following languages: PHP, Java, Rails</li>\n<li>Some experience developing in HTML/CSS, JavaScript and Python would be beneficial</li>\n<li>Deep and demonstrable understanding of developing secure software</li>\n<li>An understanding of the OWASP Top 10 Web application security risks, and other historic, prevalent or emerging application security risks</li>\n<li>Experience writing theory and online learning content about programming, secure coding, IT/Computing and/or Cyber</li>\n<li>Familiarity with Linux and Docker would be beneficial</li>\n</ul>, \\'\\nFind out more at https://www.immersivelabs.com/careers/\\n\\', <br/>, <br/>, \\'\\nHelp change the face of cybersecurity, apply now!\\']", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.4531476, "longitude": -2.5912439}}, {"title": "C++ Developer - Technologist", "company": "Client Server", "raw_location": "Bristol", "raw_salary": "\n£28,000 - £35,000 a year", "min_salary": 28000.0, "max_salary": 35000.0, "mid_salary": 31500.0, "detail_url": "http://www.indeed.co.uk/rc/clk?jk=8cb72e2d13039ea3&fccid=892c145157842ceb&vjs=3", "description": "[<p></p>, <div><div><div>C++ Developer / Software Engineer (C++ Python Java SPARK). Are you a skilled, passionate technologist looking for an opportunity to support the global operation of a trailblazing tech start up? You could join a 120-strong, international team of exceptional engineers and will play a key role in developing bleeding edge technologies to meet the highest grade of open-source software development.<br/>\n<br/>\nThe company specialises in secure, reliable applications cover industries; from avionics, aerospace and defence to medical and energy, their advanced technologies are industry leading across the world. In this C++ Developer role, you\\'ll work directly on the language library for code intelligence for their proprietary programming language, and developing tools and libraries to support it.<br/>\n<br/>\nAs a C++ Developer you\\'ll have an extraordinary chance to develop your technical skills using cutting-edge technologies Libadalang, SPARK and Python, in conjunction with refining your craft on more traditional languages like C++ and Java. There will be a continuous, strong pipeline of projects to choose from, and will be supported to learn in a culture based on curiosity.<br/>\n<br/>\nYou\\'ll be based in brand new offices in Bristol, (a short walk from transport links) where you can enjoy great facilities, as well cake on Wednesday\\'s and drinks on Fridays in a highly inclusive team atmosphere. You\\'ll also have access to regular training opportunities, including the chance to travel to the New York and Paris offices, and a 3 day, company-wide gathering in Summer.<br/>\n<br/>\nRequirements:<br/>\n<ul><li>You have experience working with one or more high-level programming language (C++ / Java / Python)</li><li>You\\'re degree educated (2.1 or above, BSc / MSc / PhD)</li><li>You have a strong understanding of Computer Science fundamentals</li><li>You have knowledge of / interest in compilation / programming language analysis (demonstrable experience, even in form of university projects is highly beneficial)</li><li>You\\'re a confident, self-assured communicator who works well independently / is a key contributor in a team</li></ul>\n<br/>\nAs a C++ Developer you\\'ll earn a highly competitive salary (to £35k) plus a profits-based bonus and a comprehensive benefits package, including a generous holiday allowance, pension, private dental and healthcare and more.<br/>\n<br/>\nIf you\\'re interested in this C++ Developer / Software Engineer (C++ Python Java SPARK) role, apply now or get in touch today to find out more.</div></div></div>, <p></p>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.454513, "longitude": -2.58791}}, {"title": "Data Architect", "company": "Elenor Consulting Limited", "raw_location": "Bristol", "raw_salary": "\n£38,000 a year", "min_salary": 38000.0, "max_salary": 38000.0, "mid_salary": 38000.0, "detail_url": "http://www.indeed.co.uk/company/Elenor-Consulting-Limited/jobs/Data-Architect-277ff5129ab6631f?fccid=a1dd5de0a1bed61d&vjs=3", "description": "[<p>Data Artichet – BigData, Python, Java, Scala, AWS, Kafka, RabbitMQ, Elasticsearch, Spark –</p>, <p>A leading AI software house, based in Bristol, are seeking a Data Architect to join their innovative, data team and work closely with Data Scientists, Analysts, developers, Product etc in an Agile Lean environment.</p>, <p>The successful Data Architect , will be part of a team and participate in technology decisions whilst building scalable, complex data driven models/features in a range of different languages such as Python, Java, Scala along with AWS, Cloudformation, DynamoDB, Druid, Kafka, Elasticsearch, Spark, Airflow etc.</p>, <p>Job Types: Full-time, Permanent</p>, <p>Salary: £38,000.00 /year</p>, <p>Experience:</p>, <ul><li>ETL: 7 years (Preferred)</li></ul>]", "search_term_what": "python developer", "search_term_where": "Bristol", "geocoded_location": {"latitude": 51.454513, "longitude": -2.58791}}]}